{ "id": "/2017/12/19/sécurité-surface-attaque-site-statique", "title": "Sécurité - la surface d'attaque", "url": "https://bertrandkeller.info/2017/12/19/sécurité-surface-attaque-site-statique/", "date": 1513638000, "html": "<p><strong>Note :</strong> bien entendu, la sécurité n’est pas mon domaine, je manipule des concepts que je ne maîtrise pas complètement.</p>\n\n<h2 id=\"surface-dattaque\">Surface d’attaque</h2>\n\n<p>En sécurité, la surface d’attaque est en gros le nombre de portes d’entrée possibles que vous laissez à vos potentiels agresseurs.</p>\n\n<p>Si vous avez chez vous une porte principale, une porte dans votre jardin et une porte de garage, vous aurez plus de possibilités d’oublier de fermer chez vous que si vous n’avez qu’une porte principale.</p>\n\n<blockquote>\n <p>Il s’agit de tous les points d’entrée et les points de communication qu’un système d’information possède avec l’extérieur.</p>\n</blockquote>\n\n<p>Ça a l’air simple comme ça, mais comme la sécurité n’est pas la priorité première dans les organisations ; les choix historiques, les contingences, le travail en silo,… laisse pas mal de vide pour des entrées frauduleuses.</p>\n\n<p>Ce n’est souvent qu’après une attaque, un vol, qu’on se soucie de ce problème mais il est souvent trop tard. Vos concurrents partent avec les secrets de votre brevet que vous avez mis tant d’année à développer.</p>\n\n<p>Une des première chose à faire pour réduire les attaques reste de diminuer au maximum sa surface d’attaque.</p>\n\n<h2 id=\"la-cas-wordpress\">La cas WordPress</h2>\n\n<p>On compare souvent les sites statiques à WordPress en essayant de lister le pour et les contres dans les 2 approches. Ces 2 systèmes sont différents et ne peuvent pas être comparés point à point car ils ne répondent pas toujours aux mêmes besoins.</p>\n\n<p>Pour autant quand un <a href=\"/generateur-site-statique/\">générateur de site statique</a> répond au besoin, s’il y a bien un avantage en sa faveur, c’est sa faible capacité à se faire pirater.</p>\n\n<p>Il faut savoir que WordPress est très populaire et donc très exposé, il est donc très soumis à des attaques en permanence sur le réseau.</p>\n\n<p>Aujourd’hui par exemple, il y eu une attaque “brute force” sur tous les WordPress du monde. Cette attaque “brute force”, ça ressemble à quoi concrètement ?</p>\n\n<ul>\n <li>L’attaque a jusqu’ici culminé à 14,1 millions de connexions par heure ;</li>\n <li>le nombre total d’IP impliquées à ce moment-là est supérieur à 10 000 ;</li>\n <li>nous voyons jusqu’à 190 000 sites WordPress ciblés par heure ;</li>\n <li>c’est la campagne la plus agressive que nous ayons jamais vue par le volume d’attaque horaire.</li>\n</ul>\n\n<p>Lire <a href=\"https://www.wordfence.com/blog/2017/12/aggressive-brute-force-wordpress-attack/\">Breaking: Aggressive WordPress Brute Force Attack Campaign Started Today, 3am UTC</a>.</p>\n\n<h2 id=\"solution--dcomplexifier-son-systme\">Solution : décomplexifier son système</h2>\n\n<p>Je ne sais pas si l’internet et le web sont devenu des champs de bataille mondial ; mais sachez qu’il est possible de maintenir son activité quotidienne d’édition sans avoir à paniquer de manière permanente.</p>\n\n<p>Parfois, sur les <a href=\"/generateur-site-statique/\">générateurs de site statique</a>, j’entends dire : <q> c’est marrant, avec les pages statiques, on revient 20 ans en arrière.</q>. Ceci n’est pas tout à fait vrai, mais pas tout à fait faux, non plus.</p>\n\n<p>Pour le comprendre, citons le grand Jacques Ellul :</p>\n\n<blockquote>\n <p>Le progrès technique soulève des problèmes plus difficiles qu’il n’en résout effectivement. Atteinte à la vie privée, pouvoir secret, excessif, centralisation, complexité croissante…</p>\n</blockquote>\n\n<p>Plus, on ajoute de couches techniques pour répondre à des besoins qu’on a pas forcément, plus on compléxifie un système. Et plus on augmente, potentiellement, sa surface d’attaque.</p>\n\n<p>Partir sur du statique, en ayant une bonne culture de la sécurité, est un bon moyen d’aborder sereinement la publication de contenu sur le web sans avoir à se soucier de la sécurité de ses données.</p>\n", "markdown": "**Note :** bien entendu, la sécurité n'est pas mon domaine, je manipule des concepts que je ne maîtrise pas complètement.\n\n## Surface d'attaque\n\nEn sécurité, la surface d'attaque est en gros le nombre de portes d'entrée possibles que vous laissez à vos potentiels agresseurs.\n\nSi vous avez chez vous une porte principale, une porte dans votre jardin et une porte de garage, vous aurez plus de possibilités d'oublier de fermer chez vous que si vous n'avez qu'une porte principale.\n\n> Il s’agit de tous les points d’entrée et les points de communication qu’un système d’information possède avec l’extérieur.\n\nÇa a l'air simple comme ça, mais comme la sécurité n'est pas la priorité première dans les organisations ; les choix historiques, les contingences, le travail en silo,… laisse pas mal de vide pour des entrées frauduleuses.\n\nCe n'est souvent qu'après une attaque, un vol, qu'on se soucie de ce problème mais il est souvent trop tard. Vos concurrents partent avec les secrets de votre brevet que vous avez mis tant d'année à développer.\n\nUne des première chose à faire pour réduire les attaques reste de diminuer au maximum sa surface d'attaque.\n\n## La cas WordPress\n\nOn compare souvent les sites statiques à WordPress en essayant de lister le pour et les contres dans les 2 approches. Ces 2 systèmes sont différents et ne peuvent pas être comparés point à point car ils ne répondent pas toujours aux mêmes besoins.\n\nPour autant quand un [générateur de site statique](/generateur-site-statique/) répond au besoin, s'il y a bien un avantage en sa faveur, c'est sa faible capacité à se faire pirater.\n\nIl faut savoir que WordPress est très populaire et donc très exposé, il est donc très soumis à des attaques en permanence sur le réseau. \n\nAujourd’hui par exemple, il y eu une attaque \"brute force\" sur tous les WordPress du monde. Cette attaque \"brute force\", ça ressemble à quoi concrètement ?\n\n* L'attaque a jusqu'ici culminé à 14,1 millions de connexions par heure ;\n* le nombre total d'IP impliquées à ce moment-là est supérieur à 10 000 ;\n* nous voyons jusqu'à 190 000 sites WordPress ciblés par heure ;\n* c'est la campagne la plus agressive que nous ayons jamais vue par le volume d'attaque horaire.\n\nLire [Breaking: Aggressive WordPress Brute Force Attack Campaign Started Today, 3am UTC](https://www.wordfence.com/blog/2017/12/aggressive-brute-force-wordpress-attack/).\n\n## Solution : décomplexifier son système\n\nJe ne sais pas si l'internet et le web sont devenu des champs de bataille mondial ; mais sachez qu'il est possible de maintenir son activité quotidienne d'édition sans avoir à paniquer de manière permanente.\n\nParfois, sur les [générateurs de site statique](/generateur-site-statique/), j'entends dire : <q> c'est marrant, avec les pages statiques, on revient 20 ans en arrière.</q>. Ceci n'est pas tout à fait vrai, mais pas tout à fait faux, non plus.\n\nPour le comprendre, citons le grand Jacques Ellul :\n\n > Le progrès technique soulève des problèmes plus difficiles qu’il n’en résout effectivement. Atteinte à la vie privée, pouvoir secret, excessif, centralisation, complexité croissante…\n\nPlus, on ajoute de couches techniques pour répondre à des besoins qu'on a pas forcément, plus on compléxifie un système. Et plus on augmente, potentiellement, sa surface d'attaque.\n\nPartir sur du statique, en ayant une bonne culture de la sécurité, est un bon moyen d'aborder sereinement la publication de contenu sur le web sans avoir à se soucier de la sécurité de ses données.\n" }