{ "id": "/2017/11/27/les-utilisateurs-ne-peuvent-pas-editer-le-markdown", "title": "Mes utilisateurs ne peuvent pas éditer de Markdown !", "url": "https://bertrandkeller.info/2017/11/27/les-utilisateurs-ne-peuvent-pas-editer-le-markdown/", "date": 1511737200, "html": "<p>Les avantages des fichiers statiques est partagé par la majorité, mais beaucoup ne veulent pas utiliser ce système car les rédacteurs ne sont pas capables d’éditer du Markdown (entendre éditer en utilisant la syntaxe Markdown).</p>\n\n<blockquote>\n <p>Mes utilisateurs ne veulent pas éditer du Markdown, c’est un truc de geek.</p>\n</blockquote>\n\n<h2 id=\"markdown-do-a-vient-\">Markdown d’où ça vient ?</h2>\n\n<p>Markdown a été inventé pour écrire de manière structurée un texte, c’est-à-dire, plus ou moins, écrire du HTML sans avoir à manipuler un langage de balisage verbeux.</p>\n\n<blockquote>\n <p>Un document balisé par Markdown peut être lu en l’état sans donner l’impression d’avoir été balisé ou formaté par des instructions particulières.</p>\n</blockquote>\n\n<p>On sait que la lecture sur un écran demande de la structuration. Présenter des éléments de manière structurée permet d’améliorer la lecture des humains mais aussi des machines.</p>\n\n<p>Par exemple, une liste numérotée permet :\n- de présenter différents points selon un ordre clair au lecteur ;\n- de lister les points dans une synthèse vocale pour des malvoyants (comme pour un menu de navigation) ;\n- d’indiquer à un moteur de recherche qu’il s’agit de trois éléments séparés, ce qui aide au référencement.</p>\n\n<p>Si vous voulez structurer un texte avec des titres, des paragraphes, du <strong>gras</strong>, de l’<em>italique</em>, il n’y a pas d’autres moyens que de l’indiquer dans le document : ça c’est un titre, ça c’est une liste…</p>\n\n<p>Il est possible de le faire avec un éditeur de texte Wysiwyg (en imitant le fonctionnement d’un traitement de texte, style Microsoft Word) ou en écrivant directement dans un fichier texte en balisant sont texte avec du Markdown.</p>\n\n<p>Certaines personnes ont peur de Markdown car il s’agit d’une syntaxe particulière avec du balisage, mais il faut bien admettre que le balisage doit obligatoirement être indiqué à un moment ou à un autre dans le document.</p>\n\n<h2 id=\"mais-pourquoi-markdown-alors-\">Mais pourquoi Markdown, alors ?</h2>\n\n<p>Tout d’abord, il existe plusieurs langages de balisage concurrents à Markdown, il font à peu près la même chose. Markdown s’est peut-être imposé car il est plus simple de prise en main et qu’il se destine à de la rédaction de documents sans grande complexité (contrairement à LaTeX par exemple qui est utilisé pour des documents scientifiques).</p>\n\n<p>Markdown est simple, portable et léger.</p>\n\n<p>Pour la mise en place d’un simple blog, avec quelques pages et quelques articles, pas besoin de serveur avec une base de données. On s’embête bien moins pour l’achat et la maintenance d’un serveur pour la gestion de ce micro site.</p>\n\n<p>En plus, c’est très facile à corriger par les autres utilisateurs. Si un rédacteur a des soucis pour la rédaction, il est possible de voir à quel endroit il a eu des blocages. Ainsi, on peut le faire progresser.</p>\n\n<p>La formation est facile ; l’expérience montre que les rédacteurs ne se plaignent jamais de l’utilisation du Markdown.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Il y a bien entendu plusieurs manières d’éditer du Markdown. Nous verrons dans des prochains billets qu’on peut aller de l’utilisation d’un éditeur de texte ou de notes jusqu’à l’utilisation d’une interface en ligne.</p>\n\n<p>Néanmoins, l’utilisation de la technologie Markdown, c’est-à-dire passer par des fichiers textes pour enregistrer du contenu (plus de base de données), simplifie la complexité des sites qui servent principalement à de la publication de contenu.</p>\n", "markdown": "Les avantages des fichiers statiques est partagé par la majorité, mais beaucoup ne veulent pas utiliser ce système car les rédacteurs ne sont pas capables d’éditer du Markdown (entendre éditer en utilisant la syntaxe Markdown).\n\n> Mes utilisateurs ne veulent pas éditer du Markdown, c’est un truc de geek.\n\n## Markdown d'où ça vient ?\n\nMarkdown a été inventé pour écrire de manière structurée un texte, c'est-à-dire, plus ou moins, écrire du HTML sans avoir à manipuler un langage de balisage verbeux.\n\n> Un document balisé par Markdown peut être lu en l'état sans donner l’impression d'avoir été balisé ou formaté par des instructions particulières.\n\nOn sait que la lecture sur un écran demande de la structuration. Présenter des éléments de manière structurée permet d'améliorer la lecture des humains mais aussi des machines.\n\nPar exemple, une liste numérotée permet :\n- de présenter différents points selon un ordre clair au lecteur ;\n- de lister les points dans une synthèse vocale pour des malvoyants (comme pour un menu de navigation) ;\n- d’indiquer à un moteur de recherche qu'il s'agit de trois éléments séparés, ce qui aide au référencement.\n\nSi vous voulez structurer un texte avec des titres, des paragraphes, du **gras**, de l'*italique*, il n'y a pas d'autres moyens que de l'indiquer dans le document : ça c'est un titre, ça c'est une liste…\n\nIl est possible de le faire avec un éditeur de texte Wysiwyg (en imitant le fonctionnement d'un traitement de texte, style Microsoft Word) ou en écrivant directement dans un fichier texte en balisant sont texte avec du Markdown.\n\nCertaines personnes ont peur de Markdown car il s'agit d'une syntaxe particulière avec du balisage, mais il faut bien admettre que le balisage doit obligatoirement être indiqué à un moment ou à un autre dans le document.\n\n## Mais pourquoi Markdown, alors ?\n\nTout d'abord, il existe plusieurs langages de balisage concurrents à Markdown, il font à peu près la même chose. Markdown s'est peut-être imposé car il est plus simple de prise en main et qu'il se destine à de la rédaction de documents sans grande complexité (contrairement à LaTeX par exemple qui est utilisé pour des documents scientifiques).\n\n\nMarkdown est simple, portable et léger.\n\nPour la mise en place d'un simple blog, avec quelques pages et quelques articles, pas besoin de serveur avec une base de données. On s'embête bien moins pour l'achat et la maintenance d'un serveur pour la gestion de ce micro site.\n\nEn plus, c'est très facile à corriger par les autres utilisateurs. Si un rédacteur a des soucis pour la rédaction, il est possible de voir à quel endroit il a eu des blocages. Ainsi, on peut le faire progresser.\n\nLa formation est facile ; l’expérience montre que les rédacteurs ne se plaignent jamais de l'utilisation du Markdown.\n\n## Conclusion\n\nIl y a bien entendu plusieurs manières d'éditer du Markdown. Nous verrons dans des prochains billets qu'on peut aller de l'utilisation d'un éditeur de texte ou de notes jusqu'à l'utilisation d'une interface en ligne.\n\nNéanmoins, l'utilisation de la technologie Markdown, c'est-à-dire passer par des fichiers textes pour enregistrer du contenu (plus de base de données), simplifie la complexité des sites qui servent principalement à de la publication de contenu.\n" }