{ "id": "/2017/09/26/developpeur-jekyll-hugo-generateur-site-statique", "title": "Développeur sur générateurs de site statique", "url": "https://bertrandkeller.info/2017/09/26/developpeur-jekyll-hugo-generateur-site-statique/", "date": 1506376800, "html": "<p>Je m’amuse en ce moment à travailler mon positionnement SEO sur les <a href=\"/generateur-site-statique/\">générateurs de site statique</a>. Premièrement, je me rends compte qu’il n’existe pas beaucoup de développeurs qui se positionnent sur le secteur ; deuxièmement, j’ai aussi l’impression que ça n’intéresse personne.</p>\n\n<h2 id=\"travailler-sur-le-statique\">Travailler sur le statique</h2>\n\n<p>Depuis quelques mois, on sent que les professionnels du domaines sont convaincus de l’avantage des sites statiques par rapport aux sites utilisant des bases de données (wordpress par exemple). Voir la conférence <a href=\"/2016/10/04/ne-passons-pas-cote-choses-simples/\">Ne passons pas à côté des choses simples Paris Web 2016</a>.</p>\n\n<p>Cependant, il n’existe très peu de demande pour l’accompagnement ou la réalisation de sites statiques. D’un côté, il est vrai que ça ne semble pas compliqué à faire, mais d’un autre côté il existe pas mal de petite choses à savoir qui peuvent tout changer sur la configuration d’un site.</p>\n\n<h2 id=\"une-complexit-mal-perue\">Une complexité mal perçue</h2>\n\n<p>C’est vrai que je défends le besoin de rester sur des choses simples ; et que les sites statiques restent des systèmes assez simples à mettre en place.</p>\n\n<p>Pourtant, même si le système de génération de pages statiques reste simple, le processus de gestion de contenus reste complexe. Et c’est justement pour appréhender et maîtriser la complexité de publication qu’il faut rester sur des système simples.</p>\n\n<p>Malheureusement, j’ai l’impression que les générateurs des site statiques sont souvent mis en place (en interne) par des développeurs comme de vulgaires objets techniques sans comprendre la philosophie sous jacente des bases de fichiers statiques.</p>\n\n<h2 id=\"valoriser-le-statique\">Valoriser le statique</h2>\n\n<p>Le statique commence à être considérés pour la réalisation de sites. Mais il me semble que la promotion de l’usage qu’on peut en faire n’est pas encore très ancré.</p>\n\n<p>Utiliser des bases de fichiers statiques est une philosophie. Elle se base sur l’idée de l’auto-documentation.</p>\n\n<p>Le principe est de considérer qu’une ressources n’existe qu’une seule fois à un seul endroit et peut être générées sur différentes formes à différents endroits. Chaque bout de texte ou de code produits est de facto documenté et cette documentation est accessible à un ensemble de personnes sous différentes formes.</p>\n\n<p>Il s’agit là de la véritable révolution numérique.</p>\n\n<p>Je développerai ce principe dans d’autres articles. Mais il s’agit bien évidemment de procéder à une aculturation globale et continue d’une organisation. Et il me semble que cela n’est pas perçu.</p>\n\n", "markdown": "Je m’amuse en ce moment à travailler mon positionnement SEO sur les [générateurs de site statique](/generateur-site-statique/). Premièrement, je me rends compte qu’il n'existe pas beaucoup de développeurs qui se positionnent sur le secteur ; deuxièmement, j'ai aussi l'impression que ça n'intéresse personne.\n\n## Travailler sur le statique\n\nDepuis quelques mois, on sent que les professionnels du domaines sont convaincus de l’avantage des sites statiques par rapport aux sites utilisant des bases de données (wordpress par exemple). Voir la conférence [Ne passons pas à côté des choses simples Paris Web 2016](/2016/10/04/ne-passons-pas-cote-choses-simples/).\n\nCependant, il n’existe très peu de demande pour l’accompagnement ou la réalisation de sites statiques. D’un côté, il est vrai que ça ne semble pas compliqué à faire, mais d’un autre côté il existe pas mal de petite choses à savoir qui peuvent tout changer sur la configuration d’un site.\n\n## Une complexité mal perçue\n\nC’est vrai que je défends le besoin de rester sur des choses simples ; et que les sites statiques restent des systèmes assez simples à mettre en place.\n\nPourtant, même si le système de génération de pages statiques reste simple, le processus de gestion de contenus reste complexe. Et c’est justement pour appréhender et maîtriser la complexité de publication qu’il faut rester sur des système simples.\n\nMalheureusement, j'ai l’impression que les générateurs des site statiques sont souvent mis en place (en interne) par des développeurs comme de vulgaires objets techniques sans comprendre la philosophie sous jacente des bases de fichiers statiques.\n\n## Valoriser le statique\n\nLe statique commence à être considérés pour la réalisation de sites. Mais il me semble que la promotion de l'usage qu'on peut en faire n’est pas encore très ancré.\n\nUtiliser des bases de fichiers statiques est une philosophie. Elle se base sur l'idée de l'auto-documentation.\n\nLe principe est de considérer qu’une ressources n'existe qu'une seule fois à un seul endroit et peut être générées sur différentes formes à différents endroits. Chaque bout de texte ou de code produits est de facto documenté et cette documentation est accessible à un ensemble de personnes sous différentes formes.\n\nIl s'agit là de la véritable révolution numérique.\n\nJe développerai ce principe dans d'autres articles. Mais il s'agit bien évidemment de procéder à une aculturation globale et continue d’une organisation. Et il me semble que cela n’est pas perçu.\n\n" }