{ "id": "/2017/06/02/rencentrage-statique", "title": "Recentrage sur le statique", "url": "https://bertrandkeller.info/2017/06/02/rencentrage-statique/", "date": 1496354400, "html": "<p>Ces 6 derniers mois, je me suis beaucoup dissipé sur des questions de technique, d’organisation et relation aux autres. Après avoir élagué pas mal de choses, je continue mon recentrage sur des activités plus valorisantes.</p>\n\n<h2 id=\"perte-de-sens\">Perte de sens</h2>\n\n<p>La <a href=\"https://medium.com/@ericclemmons/javascript-fatigue-48d4011b6fc4\">JavaScript fatigue</a> ou le fait d’essayer de maîtriser les derniers technologies à la mode et d’avoir l’impression qu’une technologie est toujours en train d’en chasser une autre. La JavaScript fatigue ou la dure condition de l’homme technicien qui est obligé de suivre les évolutions de la technique sous peine de se voir déclasser.</p>\n\n<p>Vouloir suivre différents chevaux, pour être sur de trouver le bon, conduit inévitablement à une perte de sens. Perte de sens d’autant plus grande pour moi quand je suis convaincu qu’il existe d’autres moyens de locomotion que le cheval.</p>\n\n<h2 id=\"tour-dobservation\">Tour d’observation</h2>\n\n<p>Bouger pour suivre ou survivre, se transformer pour exister… mais pourquoi ne simplement ne pas bouger et observer. Survivre c’est aussi savoir dépenser le moins d’énergie possible et attendre que les choses arrivent à soit.</p>\n\n<p>Je pense donc que les <a href=\"/generateur-site-statique/\">générateurs de site statique</a> restent un outil formidable pour promouvoir un web qui me semble bien moribond. Un web de publication de données qui apportent connaissances et partages à notre société.</p>\n\n<p>Pendant que des frameworks JS se tirent la bourre pour la création d’applications dans le navigateur, je trace mon bonhomme de chemin en créant directement avec des clients des nouveaux processus éditoriaux.</p>\n\n<p>On ne peut pas dire que ça morde énormément mais je pense avoir un bon spot.</p>\n\n<h2 id=\"publier\">Publier</h2>\n\n<p>Malgré 5 années à décliner des sites statiques et à essayer de développer les modèles les plus simples, les plus faciles à reproduire et les plus performants, je me rends compte que je ne publie pas grand chose sur le sujet.</p>\n\n<p>Les prochains billets de ce blog vont donc repartir sur des sujets un peu plus technique. Je vais essayer de faire quelques retours d’expérience sur les différents essais que j’ai pu faire et montrer leur avantages, leur évolution possible et leur limite.</p>\n\n", "markdown": "Ces 6 derniers mois, je me suis beaucoup dissipé sur des questions de technique, d'organisation et relation aux autres. Après avoir élagué pas mal de choses, je continue mon recentrage sur des activités plus valorisantes.\n\n## Perte de sens\n\nLa [JavaScript fatigue](https://medium.com/@ericclemmons/javascript-fatigue-48d4011b6fc4) ou le fait d'essayer de maîtriser les derniers technologies à la mode et d'avoir l'impression qu'une technologie est toujours en train d'en chasser une autre. La JavaScript fatigue ou la dure condition de l'homme technicien qui est obligé de suivre les évolutions de la technique sous peine de se voir déclasser.\n\nVouloir suivre différents chevaux, pour être sur de trouver le bon, conduit inévitablement à une perte de sens. Perte de sens d'autant plus grande pour moi quand je suis convaincu qu'il existe d'autres moyens de locomotion que le cheval.\n\n## Tour d'observation\n\nBouger pour suivre ou survivre, se transformer pour exister… mais pourquoi ne simplement ne pas bouger et observer. Survivre c'est aussi savoir dépenser le moins d'énergie possible et attendre que les choses arrivent à soit.\n\nJe pense donc que les [générateurs de site statique](/generateur-site-statique/) restent un outil formidable pour promouvoir un web qui me semble bien moribond. Un web de publication de données qui apportent connaissances et partages à notre société.\n\nPendant que des frameworks JS se tirent la bourre pour la création d'applications dans le navigateur, je trace mon bonhomme de chemin en créant directement avec des clients des nouveaux processus éditoriaux.\n\nOn ne peut pas dire que ça morde énormément mais je pense avoir un bon spot.\n\n## Publier\n\nMalgré 5 années à décliner des sites statiques et à essayer de développer les modèles les plus simples, les plus faciles à reproduire et les plus performants, je me rends compte que je ne publie pas grand chose sur le sujet.\n\nLes prochains billets de ce blog vont donc repartir sur des sujets un peu plus technique. Je vais essayer de faire quelques retours d'expérience sur les différents essais que j'ai pu faire et montrer leur avantages, leur évolution possible et leur limite.\n\n\n\n\n\n\n" }