{ "id": "/2020/02/05/lowtus-outil-de-comparaison-site", "title": "Lowtus outil de comparaison de pages web", "url": "https://bertrandkeller.info/2020/02/05/lowtus-outil-de-comparaison-site/", "date": 1580857200, "html": "<p>Après plusieurs mois de travail, j’ai enfin passé le pas en éditant mon outil Lowtus sur cette URL : <a href=\"https://lowtus.fr\">Lowtus</a>.</p>\n\n<h2 id=\"lowtus--qui-a-sert-\">Lowtus à qui ça sert ?</h2>\n\n<p>Dans les pratiques que nous avons pour tester des pages web, la plupart du temps, on teste une page ou plusieurs pages. Quand on veut regarder ce que ça donne, on observe les résultats des tests sur des pages différentes.</p>\n\n<p>Sur ces pages :</p>\n\n<ul>\n <li>On a plein de graphiques</li>\n <li>On regarde un ou 2 indicateurs</li>\n <li>On accède aux chiffres en se connectant à un service</li>\n <li>…</li>\n</ul>\n\n<p>Bref, on ne sait pas qui regarde les chiffres, ce qu’on doit faire avec… et je dois pas trop me tromper car la performances des sites web de manière générale est médiocre.</p>\n\n<p>Lowtus n’est pas un outil révolutionnaire. Son objectif est de présenter des chiffres différemment à travers des scores parlant afin d’engager des actions transverses (tous ensemble).</p>\n\n<h2 id=\"lowtus-a-fait-quoi-\">Lowtus ça fait quoi ?</h2>\n\n<p>Lowtus, c’est un gestionnaire de site statique qui lit des fichiers de résultat de différents tests automatisés.</p>\n\n<p>On le nourrit avec un fichier qui comprends des paniers. Chaque panier comprend des pages web. Un panier peut avoir pour but de comparer :</p>\n\n<ul>\n <li>Les pages d’un site (à partir d‘un plan de site).</li>\n <li>Les pages de sites différents (toutes les pages d’accueil par exemple).</li>\n</ul>\n\n<h2 id=\"lowtus-pour-qui-\">Lowtus pour qui ?</h2>\n\n<h3 id=\"groupe-industriel-organisation-politique-holding\">Groupe industriel, Organisation politique, holding…</h3>\n\n<p>Je suis une structure, j’ai une galaxie de sites web hétérogènes qui sont gérés par plusieurs équipes. Je veux engager une convergence sur la qualité des interfaces et avoir une vision globale de leur qualité ou de leur impact énergétique.</p>\n\n<p>Je peux être :</p>\n\n<ul>\n <li>Groupama</li>\n <li>Le parti des verts</li>\n <li>Technip</li>\n <li>…</li>\n</ul>\n\n<h3 id=\"un-association-une-star-up-un-site-e-commerce\">Un association, une star-up, un site e-commerce…</h3>\n\n<p>Je suis un site dans un secteur fortement concurrentiel. Je sais que les utilisateurs sont sensibles aux performances de mon site pour avoir une raison de le fréquenter d’avantage ou de transformer un achat. Je vais tester une page de mon site ainsi que la même page chez tous mes concurrents afin de me situer par rapport à eux et engager des actions pour rendre mon site plus qualitatif ou plus cohérent par rapport à mes engagements.</p>\n\n<p>Je peux être :</p>\n\n<ul>\n <li>Headict (vente de chapeau)</li>\n <li>The shift project</li>\n <li>Le GIEC (oui leur site fait 5 Mb)</li>\n <li>ChangeNow Summit (oui leur site fait 18 Mb)</li>\n <li>…</li>\n</ul>\n\n<h2 id=\"lowtusfr-pourquoi-\">Lowtus.fr pourquoi ?</h2>\n\n<p>Lowtus parce que la performance des sites web est mauvaise. Si on regarde la consommation énergétique du numérique, les problèmes environnementaux et le poids des pages par rapport aux informations qu‘on fait circuler, les performances des sites sont plus que mauvaises (on pourrait dire irresponsables).</p>\n\n<p>Donc, Lowtus.fr c’est un site qui va éditer des rapports de manière régulière pour donner un aperçu de la performance globale de sites à des gens qui ne connaissent pas particulièrement la technique.</p>\n\n<p>Lowtus va donc pouvoir dire, dans un secteur donné, les sites qui ont une démarche vertueuse et ceux qui n’ont pas de démarches vertueuse.</p>\n\n<p>Si cet outil peut aider les gens qui essayent d’être vertueux à avoir un indicateur leur permettant de convaincre d’autres personnes de faire mieux, alors ce sera déjà bien.</p>\n\n<div class=\"btn-link\">\n<a href=\"https://lowtus.fr\">Visiter le site Lowtus</a>.\n</div>\n", "markdown": "Après plusieurs mois de travail, j’ai enfin passé le pas en éditant mon outil Lowtus sur cette URL : [Lowtus](https://lowtus.fr).\n\n## Lowtus à qui ça sert ?\n\nDans les pratiques que nous avons pour tester des pages web, la plupart du temps, on teste une page ou plusieurs pages. Quand on veut regarder ce que ça donne, on observe les résultats des tests sur des pages différentes.\n\nSur ces pages :\n\n- On a plein de graphiques\n- On regarde un ou 2 indicateurs\n- On accède aux chiffres en se connectant à un service\n- …\n\nBref, on ne sait pas qui regarde les chiffres, ce qu'on doit faire avec… et je dois pas trop me tromper car la performances des sites web de manière générale est médiocre.\n\nLowtus n’est pas un outil révolutionnaire. Son objectif est de présenter des chiffres différemment à travers des scores parlant afin d’engager des actions transverses (tous ensemble).\n\n## Lowtus ça fait quoi ?\n\nLowtus, c'est un gestionnaire de site statique qui lit des fichiers de résultat de différents tests automatisés.\n\nOn le nourrit avec un fichier qui comprends des paniers. Chaque panier comprend des pages web. Un panier peut avoir pour but de comparer :\n\n- Les pages d’un site (à partir d‘un plan de site).\n- Les pages de sites différents (toutes les pages d'accueil par exemple).\n\n## Lowtus pour qui ?\n\n### Groupe industriel, Organisation politique, holding…\n\nJe suis une structure, j'ai une galaxie de sites web hétérogènes qui sont gérés par plusieurs équipes. Je veux engager une convergence sur la qualité des interfaces et avoir une vision globale de leur qualité ou de leur impact énergétique.\n\nJe peux être :\n\n- Groupama\n- Le parti des verts\n- Technip\n- …\n\n### Un association, une star-up, un site e-commerce…\n\nJe suis un site dans un secteur fortement concurrentiel. Je sais que les utilisateurs sont sensibles aux performances de mon site pour avoir une raison de le fréquenter d'avantage ou de transformer un achat. Je vais tester une page de mon site ainsi que la même page chez tous mes concurrents afin de me situer par rapport à eux et engager des actions pour rendre mon site plus qualitatif ou plus cohérent par rapport à mes engagements.\n\nJe peux être :\n\n- Headict (vente de chapeau)\n- The shift project\n- Le GIEC (oui leur site fait 5 Mb)\n- ChangeNow Summit (oui leur site fait 18 Mb)\n- …\n\n## Lowtus.fr pourquoi ?\n\nLowtus parce que la performance des sites web est mauvaise. Si on regarde la consommation énergétique du numérique, les problèmes environnementaux et le poids des pages par rapport aux informations qu‘on fait circuler, les performances des sites sont plus que mauvaises (on pourrait dire irresponsables).\n\nDonc, Lowtus.fr c'est un site qui va éditer des rapports de manière régulière pour donner un aperçu de la performance globale de sites à des gens qui ne connaissent pas particulièrement la technique.\n\nLowtus va donc pouvoir dire, dans un secteur donné, les sites qui ont une démarche vertueuse et ceux qui n'ont pas de démarches vertueuse.\n\nSi cet outil peut aider les gens qui essayent d’être vertueux à avoir un indicateur leur permettant de convaincre d’autres personnes de faire mieux, alors ce sera déjà bien.\n\n<div class=\"btn-link\">\n<a href=\"https://lowtus.fr\">Visiter le site Lowtus</a>.\n</div>\n" }