{ "id": "/2017/12/20/5500-sites-wordpress-infeste", "title": "5 500 sites Wordpress infestés", "url": "https://bertrandkeller.info/2017/12/20/5500-sites-wordpress-infeste/", "date": 1513724400, "html": "<blockquote>\n <p>Cybersecurity spending has been growing for the last decade — in 2017 it grew up to $85bn! There are many opportunities for startups.</p>\n</blockquote>\n\n<p>Tout d’abord, il faut noter l’intérêt grandissant pour la sécurité informatique. Le secteur est en train de grossir à la même vitesse que d’autres ayant, eux aussi, le vent en poupe. 2017 a été encore une année avec son lot de révélation sur du vol de données.</p>\n\n<p>Pour revenir à WordPress, pour bien se rendre compte du phénomène, regardons ce script malicieux qui infecte 5 500 sites (dans le top 200,000 d’Alexa).</p>\n\n<p><img src=\"/assets/WordPress-site-keylogger.png\" alt=\"Wordpress Key logger\"/></p>\n\n<p>Celui-ci est en mesure de collecter les “identifiants/Mot de passe” à la connexion à l’administration du site, mais aussi lorsqu’on remplit des commentaires. Ce qui veut dire que le propriétaire du site est concerné, mais que vous aussi, potentiellement, en tant qu’utilisateur.</p>\n\n<p>Je ne sais pas vous, mais ça ne me donne plus trop envie d’utiliser des formulaires en ligne, surtout sur WordPress. Le passage à des sites statiques devient plus que nécessaire.</p>\n\n<p>Lire <a href=\"https://www.bleepingcomputer.com/news/security/keylogger-found-on-nearly-5-500-infected-wordpress-sites/\">Keylogger Found on Nearly 5,500 Infected WordPress Sites</a>.</p>\n", "markdown": "> Cybersecurity spending has been growing for the last decade — in 2017 it grew up to $85bn! There are many opportunities for startups.\n\nTout d'abord, il faut noter l'intérêt grandissant pour la sécurité informatique. Le secteur est en train de grossir à la même vitesse que d'autres ayant, eux aussi, le vent en poupe. 2017 a été encore une année avec son lot de révélation sur du vol de données.\n\nPour revenir à WordPress, pour bien se rendre compte du phénomène, regardons ce script malicieux qui infecte 5 500 sites (dans le top 200,000 d'Alexa).\n\n![Wordpress Key logger](/assets/WordPress-site-keylogger.png)\n\nCelui-ci est en mesure de collecter les \"identifiants/Mot de passe\" à la connexion à l'administration du site, mais aussi lorsqu’on remplit des commentaires. Ce qui veut dire que le propriétaire du site est concerné, mais que vous aussi, potentiellement, en tant qu'utilisateur.\n\nJe ne sais pas vous, mais ça ne me donne plus trop envie d'utiliser des formulaires en ligne, surtout sur WordPress. Le passage à des sites statiques devient plus que nécessaire.\n\nLire [Keylogger Found on Nearly 5,500 Infected WordPress Sites](https://www.bleepingcomputer.com/news/security/keylogger-found-on-nearly-5-500-infected-wordpress-sites/).\n" }