{ "id": "/2017/06/25/conference-paris-web-2017", "title": "Atelier sur les GSS à Paris Web 2017", "url": "https://bertrandkeller.info/2017/06/25/conference-paris-web-2017/", "date": 1498341600, "html": "<p>Première étape de la communication sur les générateurs de sites statiques, la propostion d’un atelier à Paris Web 2017. Mon sujet <a href=\"https://www.paris-web.fr/2017/ateliers/decliner-des-sites-statiques-performants-avec-un-gss-jekyll-hugo.php\">Décliner des sites statiques performants avec un GSS (Jekyll, Hugo…)</a> s’orientera sur la compréhension du processus de mise en ligne : de l’installation à l’hébergement.</p>\n\n<h2 id=\"le-sujet--dcliner-des-sites-statiques-performants-avec-un-gss-jekyll-hugo\">Le sujet : Décliner des sites statiques performants avec un GSS (Jekyll, Hugo…)</h2>\n\n<blockquote>\n <p>Smashing Magazine vient de passer son blog sur un générateur de site statique.<br/>\nBeaucoup de commentaires dithyrambiques se sont succédés et on a même vu une vidéo avec des codeurs du projet montrant un sourire satisfait.<br/>\nNous verrons ce qui se cache derrière le moteur. Comment Github développe Jekyll pour de l’édition de pages sur Github, comment avancent les développements de Hugo. Un peu de syntaxe, un peu de push/pull, des essais de plugins majeurs, des tentatives de templating, du headless CMS…<br/>\nEt puis bien sûr de l’optimisation des performances web avec une présentation de Netlify (sa configuration, ses webhooks…).</p>\n</blockquote>\n\n<h2 id=\"le-processus\">Le processus</h2>\n\n<p>Les générateurs de sites statiques changent la donne en ce qui concerne la mise en place et la maintenance de sites.</p>\n\n<p>Même si la prise en main d’une générateur de site statique peut demander du temps ; ils ne proposent aucun frein pour la mise en place de règles concernant l’affichage ou la performance.</p>\n\n<p>Non seulement un site pourra être aussi rapide que vous le souhaitez mais en plus en fonction de votre choix de générateur la question du volume de données sera plus évidente à résoudre.</p>\n\n<p>Comment choisit-on sa techno ? Comment mettre en place un générateur de site sur un hébergement ? Comment fonctionne sa mise à jour seul ou à plusieurs ?</p>\n\n<h2 id=\"mon-objectif\">Mon objectif</h2>\n\n<p>Faire comprendre aux participants que les générateurs de site statique ne sont pas qu’une simple affaire technique.</p>\n\n<p>Combien voit-on de personne dire : moi aussi je les utilise j’en ai installé un pour réaliser un blog.</p>\n\n<p>Je veux montrer comment leur utilisation change complètement la manière de faire du web en ouvrant des portes vers une autre façon de manipuler de la donnée.</p>\n", "markdown": "Première étape de la communication sur les générateurs de sites statiques, la propostion d'un atelier à Paris Web 2017. Mon sujet [Décliner des sites statiques performants avec un GSS (Jekyll, Hugo…)](https://www.paris-web.fr/2017/ateliers/decliner-des-sites-statiques-performants-avec-un-gss-jekyll-hugo.php) s'orientera sur la compréhension du processus de mise en ligne : de l'installation à l'hébergement.\n\n## Le sujet : Décliner des sites statiques performants avec un GSS (Jekyll, Hugo…)\n\n> Smashing Magazine vient de passer son blog sur un générateur de site statique. \nBeaucoup de commentaires dithyrambiques se sont succédés et on a même vu une vidéo avec des codeurs du projet montrant un sourire satisfait. \nNous verrons ce qui se cache derrière le moteur. Comment Github développe Jekyll pour de l'édition de pages sur Github, comment avancent les développements de Hugo. Un peu de syntaxe, un peu de push/pull, des essais de plugins majeurs, des tentatives de templating, du headless CMS… \nEt puis bien sûr de l'optimisation des performances web avec une présentation de Netlify (sa configuration, ses webhooks…).\n\n## Le processus\n\nLes générateurs de sites statiques changent la donne en ce qui concerne la mise en place et la maintenance de sites.\n\nMême si la prise en main d'une générateur de site statique peut demander du temps ; ils ne proposent aucun frein pour la mise en place de règles concernant l'affichage ou la performance.\n\nNon seulement un site pourra être aussi rapide que vous le souhaitez mais en plus en fonction de votre choix de générateur la question du volume de données sera plus évidente à résoudre.\n\nComment choisit-on sa techno ? Comment mettre en place un générateur de site sur un hébergement ? Comment fonctionne sa mise à jour seul ou à plusieurs ?\n\n## Mon objectif\n\nFaire comprendre aux participants que les générateurs de site statique ne sont pas qu'une simple affaire technique.\n\nCombien voit-on de personne dire : moi aussi je les utilise j'en ai installé un pour réaliser un blog.\n\nJe veux montrer comment leur utilisation change complètement la manière de faire du web en ouvrant des portes vers une autre façon de manipuler de la donnée.\n" }