{ "id": "/2019/11/27/quatre-facteurs-changement-low-tech", "title": "4 facteurs de changement pour la sobriété énergétique", "url": "https://bertrandkeller.info/2019/11/27/quatre-facteurs-changement-low-tech/", "date": 1574809200, "html": "<p>Je vous remets la pyramide des facteurs de changement qui est certainement une chose à affiner, mais qui liste une série d’attitudes qui peuvent permettre de modifier son comportement.</p>\n\n<h2 id=\"limiter-la-consommation\">4 ⬇ Limiter la consommation</h2>\n\n<p>Le facteur le moins impactant pour la société sera de diminuer la consommation de ses périphériques d’abord en contrôlant leur consommation, mais aussi en pratiquant un non renouvellement de son parc informatique.</p>\n\n<p>Ce n’est pas chose aisée quand l’activité de son entreprise tient à la vente de produit nouveaux. Même en modifiant des choses en interne, l’entreprise Orange, par exemple, continuera à vendre des mobiles en 5G à des usagers qui n’en ont pas une utilité directe.</p>\n\n<h2 id=\"supprimer-linutile\">3 ⬇ Supprimer l’inutile</h2>\n\n<p>Vous pouvez aussi commencer à limiter les nombres d’outils que vous utilisez chaque jour. Supprimer les connexions permanentes à des interfaces chronophages, arrêter de vous prendre la tête sur des développements de programmes qui ne plaisent pas à la majorité.</p>\n\n<p>Nettoyer votre bureau, le bureau de votre ordinateur, l’écran d’accueil de votre portable. Faites place nette.</p>\n\n<h2 id=\"construire-sobrement\">2 ⬆ Construire sobrement</h2>\n\n<p>Essayer de vous concentrer sur ce qui semble le plus enrichissant à un niveau individuel et collectif. Remplissez l’objectif qui semble primordial quitte à ne pas remplir des objectifs annexes.</p>\n\n<p>Pensez à ce que l’objectif principal puisse être garanti le plus longtemps possible dans le temps.</p>\n\n<h2 id=\"concevoir-de-faon-responsable\">1 ⬆ Concevoir de façon responsable</h2>\n\n<p>Quand vous aurez réussi à penser à des réalisations de choses simples et résilientes. Peut-être pourrez vous construire des outils utiles pour la société.</p>\n\n<p>Vous pourrez peut-être réaliser des choses : Utile, Durable et Accessible.</p>\n\n<p>Pour cela je vous invite à consulter cet article que j’ai écrit : <a href=\"https://bertrandkeller.info/2019/06/24/table-low-tech/\">Les tables de la Low (Tech)</a></p>\n\n<p>Enfin, je vous remets le lien la consulter vidéo : <a href=\"https://www.youtube.com/watch?v=C2Xr_R6D6MY\">https://www.youtube.com/watch?v=C2Xr_R6D6MY</a></p>\n", "markdown": "Je vous remets la pyramide des facteurs de changement qui est certainement une chose à affiner, mais qui liste une série d’attitudes qui peuvent permettre de modifier son comportement.\n\n## 4 ⬇ Limiter la consommation\n\nLe facteur le moins impactant pour la société sera de diminuer la consommation de ses périphériques d'abord en contrôlant leur consommation, mais aussi en pratiquant un non renouvellement de son parc informatique.\n\nCe n’est pas chose aisée quand l’activité de son entreprise tient à la vente de produit nouveaux. Même en modifiant des choses en interne, l'entreprise Orange, par exemple, continuera à vendre des mobiles en 5G à des usagers qui n'en ont pas une utilité directe.\n\n## 3 ⬇ Supprimer l’inutile\n\nVous pouvez aussi commencer à limiter les nombres d’outils que vous utilisez chaque jour. Supprimer les connexions permanentes à des interfaces chronophages, arrêter de vous prendre la tête sur des développements de programmes qui ne plaisent pas à la majorité.\n\nNettoyer votre bureau, le bureau de votre ordinateur, l'écran d'accueil de votre portable. Faites place nette.\n\n## 2 ⬆ Construire sobrement\n\nEssayer de vous concentrer sur ce qui semble le plus enrichissant à un niveau individuel et collectif. Remplissez l’objectif qui semble primordial quitte à ne pas remplir des objectifs annexes.\n\nPensez à ce que l’objectif principal puisse être garanti le plus longtemps possible dans le temps.\n\n## 1 ⬆ Concevoir de façon responsable\n\nQuand vous aurez réussi à penser à des réalisations de choses simples et résilientes. Peut-être pourrez vous construire des outils utiles pour la société.\n\nVous pourrez peut-être réaliser des choses : Utile, Durable et Accessible.\n\nPour cela je vous invite à consulter cet article que j'ai écrit : [Les tables de la Low (Tech)](https://bertrandkeller.info/2019/06/24/table-low-tech/)\n\nEnfin, je vous remets le lien la consulter vidéo : <https://www.youtube.com/watch?v=C2Xr_R6D6MY>\n" }