{ "id": "/2019/06/24/table-low-tech", "title": "Les tables de la Low (Tech)", "url": "https://bertrandkeller.info/2019/06/24/table-low-tech/", "date": 1561327200, "html": "<p>Parlons de <a href=\"/low-tech-site-web-internet/\">Low-Tech</a>, parlons de Low-Tech appliqué au web, mais d’abord définissons ce qu’est la Low-Tech.</p>\n\n<p>Je vais reprendre simplement ce que définit le <a href=\"https://lowtechlab.org\">Low-Tech Lab</a>.</p>\n\n<blockquote>\n <p>Nous appelons “Low-Tech” les objets, les systèmes, les techniques, les services, les savoir-faire, les pratiques, les comportements et même les courants de pensée qui s’articulent autour des 3 principes : utile, durable, accessible.</p>\n</blockquote>\n\n<p>Selon la dénomination (Ellulienne entre autres) cette liste (systèmes, objets,…) désigne la technique tout simplement. Pas besoin de la décliner, puisque la technique est une méthode pour rechercher en toutes choses l’efficacité. Du coup, ce qu’il faut définir n’est pas Low-Tech mais Low appliqué à Tech.</p>\n\n<h2 id=\"dfinition\">Définition</h2>\n\n<dl>\n <dt>1 - Utile</dt>\n <dd>Répond à un besoin essentiel : accès à l’eau, à la santé… Elle redonne du sens à l’action et rend possible des modes de vie sains et épanouissants.</dd>\n <dt>2 - Durable</dt>\n <dd>Elle reste sobre. Elle est donc efficace mais au <strong>juste nécessaire</strong> énergétique, économique et en utilisation de matières. Sort de la logique d’exploitation de l’environnement pour aller vers une préservation des écosystèmes.</dd>\n <dt>3 - Accessible</dt>\n <dd>Accessible au plus grand monde. Simple, optimisée, robuste, fabriquée et réparée localement. La compréhension de son fonctionnement doit être “démocratisé”. Elle favorise une plus grande autonomie des populations, ainsi qu’une meilleure répartition de la valeur travail.</dd>\n</dl>\n\n<h2 id=\"interprtation\">Interprétation</h2>\n\n<p>Il y a plusieurs choses dans cette définition. La description technique et la description politique de la Low-Tech.</p>\n\n<p>La Low-Tech doit être utile donc se dégager de la frivolité (Michel Clouscard) ; elle doit être durable donc être immobilisé sur un temps le plus long possible ; elle doit être durable c’est à dire demander de consommer le moins de matière possible.</p>\n\n<p>Il est possible de suivre ces 3 principes, sans pour autant chercher à aider des populations à vivre mieux.</p>\n\n<p>Personnellement, je pense que privilégier le bien être des personnes et préserver les écosystèmes constitue un tout (quand on pense Low-Tech), que cela reste logique ; mais intellectuellement il est possible de séparer le côté technique et le côté politique. C’est d’ailleurs ce qu’est capable de faire le capitalisme en récupérant le principe de la Low-Tech pour survivre mais en ayant jamais pour but de répartir la valeur travail.</p>\n\n<h2 id=\"low-tech-web\">Low-Tech Web</h2>\n\n<p>Ainsi, il serait intéressant de parcourir cette définition et de voir dans quels cas on peut les appliquer à un site web.</p>\n\n<p>Apparemment, ce n’est pas parce que j’utilise un panneau solaire que mon site web sort du côté futile, où qu’il est maintenable facilement.</p>\n\n<p>À suivre.</p>\n", "markdown": "Parlons de [Low-Tech](/low-tech-site-web-internet/), parlons de Low-Tech appliqué au web, mais d’abord définissons ce qu’est la Low-Tech.\n\nJe vais reprendre simplement ce que définit le [Low-Tech Lab](https://lowtechlab.org).\n\n> Nous appelons \"Low-Tech\" les objets, les systèmes, les techniques, les services, les savoir-faire, les pratiques, les comportements et même les courants de pensée qui s'articulent autour des 3 principes : utile, durable, accessible.\n\nSelon la dénomination (Ellulienne entre autres) cette liste (systèmes, objets,…) désigne la technique tout simplement. Pas besoin de la décliner, puisque la technique est une méthode pour rechercher en toutes choses l'efficacité. Du coup, ce qu'il faut définir n’est pas Low-Tech mais Low appliqué à Tech.\n\n## Définition\n\n1 - Utile\n: Répond à un besoin essentiel : accès à l'eau, à la santé… Elle redonne du sens à l’action et rend possible des modes de vie sains et épanouissants.\n\n2 - Durable\n: Elle reste sobre. Elle est donc efficace mais au **juste nécessaire** énergétique, économique et en utilisation de matières. Sort de la logique d’exploitation de l’environnement pour aller vers une préservation des écosystèmes.\n\n3 - Accessible\n: Accessible au plus grand monde. Simple, optimisée, robuste, fabriquée et réparée localement. La compréhension de son fonctionnement doit être \"démocratisé\". Elle favorise une plus grande autonomie des populations, ainsi qu'une meilleure répartition de la valeur travail.\n\n## Interprétation\n\nIl y a plusieurs choses dans cette définition. La description technique et la description politique de la Low-Tech.\n\nLa Low-Tech doit être utile donc se dégager de la frivolité (Michel Clouscard) ; elle doit être durable donc être immobilisé sur un temps le plus long possible ; elle doit être durable c’est à dire demander de consommer le moins de matière possible.\n\nIl est possible de suivre ces 3 principes, sans pour autant chercher à aider des populations à vivre mieux.\n\nPersonnellement, je pense que privilégier le bien être des personnes et préserver les écosystèmes constitue un tout (quand on pense Low-Tech), que cela reste logique ; mais intellectuellement il est possible de séparer le côté technique et le côté politique. C'est d’ailleurs ce qu'est capable de faire le capitalisme en récupérant le principe de la Low-Tech pour survivre mais en ayant jamais pour but de répartir la valeur travail.\n\n## Low-Tech Web\n\nAinsi, il serait intéressant de parcourir cette définition et de voir dans quels cas on peut les appliquer à un site web.\n\nApparemment, ce n'est pas parce que j'utilise un panneau solaire que mon site web sort du côté futile, où qu'il est maintenable facilement.\n\nÀ suivre.\n" }