{ "id": "/2020/06/01/internet-plus-rapide-les-sites-web-non", "title": "The Internet est plus rapide qu'il y a 23 ans, mais les sites web non !", "url": "https://bertrandkeller.info/2020/06/01/internet-plus-rapide-les-sites-web-non/", "date": 1590962400, "html": "<p>Au cours des 10 dernières années, <a href=\"Httparchive.org\">https://httparchive.org/</a> a enregistré des temps de chargement de page pour 6 millions de sites Web les plus populaires. Les résultats ne sont pas encourageants :</p>\n\n<blockquote>\n <p>Pour les pages Web visitées à partir d’un ordinateur de bureau, le temps de chargement médian ne s’est pas amélioré. Les sites Web d’aujourd’hui ne sont pas beaucoup plus rapides qu’ils ne l’étaient il y a 10 ans.</p>\n</blockquote>\n\n<p><img src=\"/assets/change-in-page-load-time-vs-connection-speed-desktop.png\" alt=\"comparaison dans le temps entre le temps de chargement de pages et la connection internet\"/></p>\n\n<p>Les règles de la perception humaine du temps fournissent un cadre pour comprendre les effets des retards de page Web : les gens peuvent détecter des retards aussi courts que 1/10e de seconde, donc <strong>tout ce qui prend plus de temps ne semble pas “instantané”</strong>.</p>\n\n<p>Un délai de 1 secondes suffit à interrompre le processus de pensée consciente d’une personne, transformant l’expérience en une attente du système, plutôt que d’avoir l’impression de contrôler directement l’interface. Ce délai réduit la conversion.</p>\n\n<p>Si en plus on prend en compte le fait que tout le monde ne profite pas de périphériques ou de réseaux identiques ; on voit qu’on est pas tous logés à la même enseigne.</p>\n\n<p><img src=\"https://d33wubrfki0l68.cloudfront.net/6e855591b55513d9414ead5e34917c7133961338/53c38/static/c7e7dd1756462191f79441053ce9d5a7/28bdc/cost-of-js.png\" alt=\"comparaison de chargement sur différent mobiles en fonction de leur performance\"/></p>\n\n<p>Pour résumer, ces chiffres indiquent qu’on peut être plus efficace pour charger plus de données sur un écran, mais pas plus efficient pour communiquer de la donnée. Si le temps de chargement reste identique, c’est donc la courbe de la consommation d’énergie qui augmente en continue.</p>\n\n<p>Développeur responsable c’est, par exemple, limiter la consommation d’énergie en créant des sites compatibles sur des périphériques peu performants. Pour le bien être de tous.</p>\n\n<p>Lire <a href=\"https://www.nngroup.com/articles/the-need-for-speed/\">The Need for Speed, 23 Years Later</a>.</p>\n", "markdown": "Au cours des 10 dernières années, [https://httparchive.org/](Httparchive.org) a enregistré des temps de chargement de page pour 6 millions de sites Web les plus populaires. Les résultats ne sont pas encourageants&nbsp;:\n\n> Pour les pages Web visitées à partir d’un ordinateur de bureau, le temps de chargement médian ne s'est pas amélioré. Les sites Web d’aujourd’hui ne sont pas beaucoup plus rapides qu'ils ne l'étaient il y a 10 ans.\n\n![comparaison dans le temps entre le temps de chargement de pages et la connection internet](/assets/change-in-page-load-time-vs-connection-speed-desktop.png)\n\nLes règles de la perception humaine du temps fournissent un cadre pour comprendre les effets des retards de page Web : les gens peuvent détecter des retards aussi courts que 1/10e de seconde, donc **tout ce qui prend plus de temps ne semble pas \"instantané\"**.\n\nUn délai de 1 secondes suffit à interrompre le processus de pensée consciente d’une personne, transformant l'expérience en une attente du système, plutôt que d’avoir l’impression de contrôler directement l’interface. Ce délai réduit la conversion.\n\nSi en plus on prend en compte le fait que tout le monde ne profite pas de périphériques ou de réseaux identiques ; on voit qu'on est pas tous logés à la même enseigne.\n\n![comparaison de chargement sur différent mobiles en fonction de leur performance](https://d33wubrfki0l68.cloudfront.net/6e855591b55513d9414ead5e34917c7133961338/53c38/static/c7e7dd1756462191f79441053ce9d5a7/28bdc/cost-of-js.png)\n\nPour résumer, ces chiffres indiquent qu'on peut être plus efficace pour charger plus de données sur un écran, mais pas plus efficient pour communiquer de la donnée. Si le temps de chargement reste identique, c’est donc la courbe de la consommation d’énergie qui augmente en continue.\n\nDéveloppeur responsable c’est, par exemple, limiter la consommation d’énergie en créant des sites compatibles sur des périphériques peu performants. Pour le bien être de tous.\n\nLire [The Need for Speed, 23 Years Later](https://www.nngroup.com/articles/the-need-for-speed/).\n" }