{ "id": "/2016/03/31/processus-edition", "title": "Mon processus d’édition", "url": "https://bertrandkeller.info/2016/03/31/processus-edition/", "date": 1459375200, "html": "<p>Ce site a vu sa fréquence d’édition baisser depuis presque 2 ans. La vérité c’est que mon changement de statut et de vie m’a peu laissé de temps et de raisons d’écrire. Comment vais-je essayer de mettre à jour ma pratique ?</p>\n\n<h2 id=\"changement-de-vie\">Changement de vie</h2>\n\n<p>Depuis maintenant 3 ans, je ne travaille plus dans une entreprise. Je n’ai plus de poste fixe avec une pratique exécutive récurrente et déterminée.</p>\n\n<p>La pratique professionnelle est toujours présente mais reste comprise dans un tout qui est la gestion d’un quotidien qui comporte bien d’autres choses.</p>\n\n<p>À changement de vie, changement de pratique éditoriale. C’est pour ça que je suis passé d’un site wordpress éditorialisé autour de l’intégration web à un site beaucoup plus personnel basé sur l’affichage de notes.</p>\n\n<h2 id=\"la-prise-de-notes\">La prise de notes</h2>\n\n<p>Si les moteurs de blog et autres CMS ont permis la mise en ligne de nombreux blogs et sites d’actualités, l’utilisation d’une base de données et d’un site multifonctions se révèle trop complexe pour la simple prise de notes.</p>\n\n<p>La consultation mobile a eu pour effet de modifier la manière d’accéder au contenu. Alors qu’il y a encore peu la presque totalité de la lecture se faisait sur des écrans assis à un bureau (comme on le faisait pour un journal). Désormais, les journaux s’affichent sur des interfaces plus petites sur lesquelles les lecteurs ne désirent pas être perturbés par des informations secondaires.</p>\n\n<p>Il y aurait donc un désir à la fois d’accéder à du contenu clair et précis, mais aussi un besoin de pouvoir soi-même éditer des idées ou des observations qu’on aurait eu en situation nomade.</p>\n\n<p>C’est pour ces raisons que je travaille sur des méthodologies de mise en ligne de notes mais aussi que je me lance dans la mise en ligne de mes propres réflexions.</p>\n\n<h2 id=\"le-processus-actuel-ddition\">Le processus actuel d’édition</h2>\n\n<p>Au niveau technique, j’ai migré le contenu de mon blog sur Jekyll.</p>\n\n<p>J’ai plus ou moins archivé mes anciens billets. Le principe a été de générer des pages HTML et de les générer ensuite directement en tant que page HTML plutôt que les générer en tant que billets (gain de rapidité de génération). Le désavantage est que si les menus du site changent, je dois tout régénérer pour mettre à jour les header et footer.\nMais ces billets n’ont plus pour beaucoup qu’une utilité historique, que pratique car passés de mode.</p>\n\n<p>Ensuite, j’ai décidé de cloner le répertoire de notes sur une Dropbox pour être sûr de ne pas les perdre en cas de vol matériel. L’utilisation d’un lien symbolique vers le répertoire de travail permet cette manipulation.</p>\n\n<p>Les répertoires des billets comportent toutes mes notes. J’utilise Nvalt sur macosx. Celui-ci me permet d’éditer des fichiers .md et de les synchroniser avec Simplenote. \nL’application Simplenote va me permettre d’éditer mes notes sur mon mobile ou sur ma tablette, ou sur n’importe quel ordinateur sur le service en ligne.</p>\n\n<p>Jekyll ne compile les billets de blogs qu’en fonction de leur nommage (date+titre:YYYY-MM-JJ-titre-de-mon-billet). Si j’édite une note avec un titre lambda, il n’est pas compilé. Si je rédige un article avec le bon titre, il sera compilé.</p>\n\n<p>Pour finir, si je veux héberger le site sur github (par exemple), j’indique dans le .gitignore de ne pas versionner les notes dont le titre ne commence pas un chiffre. Ainsi, mes notes personnelles ne seront pas disponibles à tout le monde (mais seront bien sauvegardées grâce à Dropbox).</p>\n\n<h2 id=\"en-pratique\">En pratique</h2>\n\n<p>Le système que j’ai mis en place n’est pas forcément des plus propres. Je mélange des billets à compiler et des billets à ne pas compiler. Mais on peut considérer que pour un usage personnel c’est acceptable.</p>\n\n<p>Simplenote n’enregistre pas directement les billets en .md. Cependant, Nvalt modifie l’extension lors de son édition. De plus, je suis obligé de passer par mon ordinateur principal pour mettre en ligne les billets. Je ne peux pas passer par Simplenote directement. \nOn ne peut pas tout avoir.</p>\n\n<p>Autre avantage, je peux partager des notes sur simplenote et donc soit rédiger un article à quatre mains soit publier une proposition d’article d’une autre personne. C’est une option intéressante pour l’écriture collaborative.</p>\n\n", "markdown": "Ce site a vu sa fréquence d'édition baisser depuis presque 2 ans. La vérité c'est que mon changement de statut et de vie m'a peu laissé de temps et de raisons d'écrire. Comment vais-je essayer de mettre à jour ma pratique ?\n\n## Changement de vie\n\nDepuis maintenant 3 ans, je ne travaille plus dans une entreprise. Je n'ai plus de poste fixe avec une pratique exécutive récurrente et déterminée.\n\nLa pratique professionnelle est toujours présente mais reste comprise dans un tout qui est la gestion d'un quotidien qui comporte bien d'autres choses.\n\nÀ changement de vie, changement de pratique éditoriale. C'est pour ça que je suis passé d'un site wordpress éditorialisé autour de l'intégration web à un site beaucoup plus personnel basé sur l'affichage de notes.\n\n## La prise de notes\n\nSi les moteurs de blog et autres CMS ont permis la mise en ligne de nombreux blogs et sites d'actualités, l'utilisation d'une base de données et d'un site multifonctions se révèle trop complexe pour la simple prise de notes.\n\nLa consultation mobile a eu pour effet de modifier la manière d'accéder au contenu. Alors qu'il y a encore peu la presque totalité de la lecture se faisait sur des écrans assis à un bureau (comme on le faisait pour un journal). Désormais, les journaux s'affichent sur des interfaces plus petites sur lesquelles les lecteurs ne désirent pas être perturbés par des informations secondaires.\n\nIl y aurait donc un désir à la fois d'accéder à du contenu clair et précis, mais aussi un besoin de pouvoir soi-même éditer des idées ou des observations qu'on aurait eu en situation nomade.\n\nC'est pour ces raisons que je travaille sur des méthodologies de mise en ligne de notes mais aussi que je me lance dans la mise en ligne de mes propres réflexions.\n\n## Le processus actuel d'édition\n\nAu niveau technique, j'ai migré le contenu de mon blog sur Jekyll. \n\nJ'ai plus ou moins archivé mes anciens billets. Le principe a été de générer des pages HTML et de les générer ensuite directement en tant que page HTML plutôt que les générer en tant que billets (gain de rapidité de génération). Le désavantage est que si les menus du site changent, je dois tout régénérer pour mettre à jour les header et footer.\nMais ces billets n'ont plus pour beaucoup qu'une utilité historique, que pratique car passés de mode.\n\nEnsuite, j'ai décidé de cloner le répertoire de notes sur une Dropbox pour être sûr de ne pas les perdre en cas de vol matériel. L'utilisation d'un lien symbolique vers le répertoire de travail permet cette manipulation.\n\nLes répertoires des billets comportent toutes mes notes. J'utilise Nvalt sur macosx. Celui-ci me permet d'éditer des fichiers .md et de les synchroniser avec Simplenote. \nL'application Simplenote va me permettre d'éditer mes notes sur mon mobile ou sur ma tablette, ou sur n'importe quel ordinateur sur le service en ligne.\n\nJekyll ne compile les billets de blogs qu'en fonction de leur nommage (date+titre:YYYY-MM-JJ-titre-de-mon-billet). Si j'édite une note avec un titre lambda, il n'est pas compilé. Si je rédige un article avec le bon titre, il sera compilé.\n\nPour finir, si je veux héberger le site sur github (par exemple), j'indique dans le .gitignore de ne pas versionner les notes dont le titre ne commence pas un chiffre. Ainsi, mes notes personnelles ne seront pas disponibles à tout le monde (mais seront bien sauvegardées grâce à Dropbox).\n \n## En pratique\n\nLe système que j'ai mis en place n'est pas forcément des plus propres. Je mélange des billets à compiler et des billets à ne pas compiler. Mais on peut considérer que pour un usage personnel c'est acceptable.\n\nSimplenote n'enregistre pas directement les billets en .md. Cependant, Nvalt modifie l'extension lors de son édition. De plus, je suis obligé de passer par mon ordinateur principal pour mettre en ligne les billets. Je ne peux pas passer par Simplenote directement. \nOn ne peut pas tout avoir.\n\nAutre avantage, je peux partager des notes sur simplenote et donc soit rédiger un article à quatre mains soit publier une proposition d'article d'une autre personne. C'est une option intéressante pour l'écriture collaborative.\n\n\n\n\n\n" }