{ "id": "/2016/07/21/ce-qui-doit-durer-lent-croitre", "title": "Tout ce qui doit durer est lent a croître", "url": "https://bertrandkeller.info/2016/07/21/ce-qui-doit-durer-lent-croitre/", "date": 1469052000, "html": "<p>La singularité technologique serait un concept, selon lequel, à partir d’un point hypothétique de son évolution technologique, la civilisation humaine pourrait connaître une croissance technologique d’un ordre supérieur.</p>\n\n<h2 id=\"des-ides-singulires\">Des idées singulières</h2>\n\n<p>Lorsque vous fréquentez des conférences ou rencontres de personnes écervelées par des concepts fumeux (tels que : on ne peut pas refuser le progrès technologique, le progrès technologique soit on rate train, soit on l’accepte…) une certaine impression d’impuissance vous envahit.</p>\n\n<p>Graphes à l’appui, on vous présente une description historique de l’humanité à travers 2 prismes soit celui de l’économie, soit celui de la technique.</p>\n\n<blockquote>\n <p>La définition de la singularité technologique serait alors : un progrès technologique si rapide que cela dépasse la capacité des humains à la contrôler ou à la prédire, à la comprendre et à réagir à temps.<br/>\n <em>Wikipedia</em></p>\n</blockquote>\n\n<p>On place une vingtaines de points sur un graphique, on trace une courbe et on vous montre que tout cela évolue dans un sens que vous ne pouvez contredire. Un peu à la manière d’un banquier pour vous faire investir dans les subprimes. Sauf que…</p>\n\n<h2 id=\"apprhender-la-temporalit\">Appréhender la temporalité</h2>\n\n<p>C’est oublier un peu vite d’autres caractères historiques fondamentaux de nos ancêtres et ignorer les nombreux effondrements de civilisations.</p>\n\n<p>On leur a dit que l’histoire n’avait pas de sens, que l’histoire n’est pas une ligne droite. Les “singularistes” nous dessinent alors une courbe algorythmique.</p>\n\n<p>Pourtant, l’observation de la nature et de nous même montre que les choses prennent du temps. On regarde une forêt, un groupe d’amis, une carrière professionnelle… tout cela se réalise sur le nombre des années.</p>\n\n<blockquote>\n <p>Tout ce qui doit durer est lent a croître<br/>\n <em>Louis de Bonald</em></p>\n</blockquote>\n\n<p>Le cerveau de l’enfant humain ne rattrape celui du petit singe qu’à partir de 2 ans. À la naissance, le petit singe est beaucoup plus développer. Mais comme il n’a pas pris son temps pour se développé, il stagne. Après 2 ans, le cerveau humain qui a maturé va continuer à grossir et apprendre moults connaissances et savoirs.<br/>\nSe dépêcher et grandir sans méthode, c’est prendre le risque de stagner.</p>\n\n<h2 id=\"perte-de-mmoire\">Perte de mémoire</h2>\n\n<p>Mais alors si tout s’accélère, alors c’est sûrement que nous sommes déjà en train de stagner, voir même de régresser ?</p>\n\n<p>Bon nombre de mes contemporains me diront que le progrès a quand même permis à l’homme de vivre dans ce monde merveilleux que celui avec avec des machines à laver et des smartphones.</p>\n\n<figure>\n <p><img src=\"/assets/duree-vie-disques-durs.jpg\" alt=\"durée de vie des disques durs\"/></p>\n</figure>\n\n<p>Seulement, ce monde merveilleux ne serait-il pas en train de construire une historicité tournée sur elle même et le présent ? Quand un artefact pouvait représenter des milliers d’années d’histoires pour certaines civilisations, un disque dur aujourd’hui ne représente que 3 années de mémoires (à partir du moment où le coût d’entretien d’un disque dur est plus élevé que ce qu’il rapporte).</p>\n\n<p>Nous allons vite, nous courrons, nous poussons, nous suivons… au risque de perdre toute mémoire c’est-à-dire de ne plus exister du tout.</p>\n\n", "markdown": "La singularité technologique serait un concept, selon lequel, à partir d'un point hypothétique de son évolution technologique, la civilisation humaine pourrait connaître une croissance technologique d'un ordre supérieur.\n\n## Des idées singulières\n\nLorsque vous fréquentez des conférences ou rencontres de personnes écervelées par des concepts fumeux (tels que : on ne peut pas refuser le progrès technologique, le progrès technologique soit on rate train, soit on l'accepte…) une certaine impression d’impuissance vous envahit.\n\nGraphes à l'appui, on vous présente une description historique de l'humanité à travers 2 prismes soit celui de l’économie, soit celui de la technique.\n\n > La définition de la singularité technologique serait alors : un progrès technologique si rapide que cela dépasse la capacité des humains à la contrôler ou à la prédire, à la comprendre et à réagir à temps. \n *Wikipedia*\n\nOn place une vingtaines de points sur un graphique, on trace une courbe et on vous montre que tout cela évolue dans un sens que vous ne pouvez contredire. Un peu à la manière d’un banquier pour vous faire investir dans les subprimes. Sauf que…\n\n## Appréhender la temporalité\n\nC'est oublier un peu vite d'autres caractères historiques fondamentaux de nos ancêtres et ignorer les nombreux effondrements de civilisations.\n\nOn leur a dit que l'histoire n'avait pas de sens, que l'histoire n'est pas une ligne droite. Les \"singularistes\" nous dessinent alors une courbe algorythmique. \n\nPourtant, l'observation de la nature et de nous même montre que les choses prennent du temps. On regarde une forêt, un groupe d'amis, une carrière professionnelle… tout cela se réalise sur le nombre des années.\n\n > Tout ce qui doit durer est lent a croître \n *Louis de Bonald*\n \nLe cerveau de l’enfant humain ne rattrape celui du petit singe qu’à partir de 2 ans. À la naissance, le petit singe est beaucoup plus développer. Mais comme il n'a pas pris son temps pour se développé, il stagne. Après 2 ans, le cerveau humain qui a maturé va continuer à grossir et apprendre moults connaissances et savoirs. \nSe dépêcher et grandir sans méthode, c’est prendre le risque de stagner.\n\n## Perte de mémoire\n\nMais alors si tout s'accélère, alors c’est sûrement que nous sommes déjà en train de stagner, voir même de régresser ?\n\nBon nombre de mes contemporains me diront que le progrès a quand même permis à l'homme de vivre dans ce monde merveilleux que celui avec avec des machines à laver et des smartphones.\n\n<figure markdown=\"1\">\n![durée de vie des disques durs](/assets/duree-vie-disques-durs.jpg)\n</figure>\n\nSeulement, ce monde merveilleux ne serait-il pas en train de construire une historicité tournée sur elle même et le présent ? Quand un artefact pouvait représenter des milliers d'années d'histoires pour certaines civilisations, un disque dur aujourd’hui ne représente que 3 années de mémoires (à partir du moment où le coût d'entretien d'un disque dur est plus élevé que ce qu'il rapporte).\n\nNous allons vite, nous courrons, nous poussons, nous suivons… au risque de perdre toute mémoire c'est-à-dire de ne plus exister du tout.\n\n\n" }