{ "id": "/2016/04/29/communaute-jekyll", "title": "La communauté Jekyll", "url": "https://bertrandkeller.info/2016/04/29/communaute-jekyll/", "date": 1461880800, "html": "<p>Récemment s’est lancé la communauté <a href=\"http://jekyll-fr.org/\">Jekyll France</a>. Un petit groupe de discussion autour des évolutions de ce <a href=\"/generateur-site-statique/\">générateur de site statique</a>.</p>\n\n<p>Étant le plus populaire, nous voyons un grand nombre d’évolutions arriver à chaque nouvelle mouture du système mais nous voyons aussi des modules permettant de brancher Jekyll avec des services tiers. Ces services sont du type éditeurs de contenu en ligne ou encore sites d’e-commerce.</p>\n\n<h2 id=\"mon-orientation\">Mon orientation</h2>\n\n<p>De mon côté, j’ai toujours aimé les choses simples, robustes et pas prises de tête. C’est pour ce la que je décline des sites avec Jekyll et que je le conseille si la solution est pertinente. Pour avoir décliné des pages pendant des années avec des CMS, je n’ai jamais compris pourquoi on passait des semaines à tordre un système pour afficher quelques pages de contenus.</p>\n\n<p>Je reste fidèle au web et au contenu first, c’est pour cette raison que je participe à l’animation de la communauté Jekyll France afin de promouvoir d’abord les gestionnaires de contenu statique et ensuite Jekyll en relayant son actualité.<br/>\nC’est en discutant des avancées de Jekyll qu’on peut mettre en perspective les orientations des autres gestionnaires de site statique qui doivent forcément se démarquer pour exister.</p>\n\n<h2 id=\"mon-sentiment\">Mon sentiment</h2>\n\n<p>Ce qui est appréciable avec les gestionnaires de contenu statique c’est que techniquement les discussions ne vont pas très loin. Tout ce qui est développé existe déjà dans les CMS et tout ce qu’il est possible d’utiliser s’applique en quelques petites heures.</p>\n\n<p>La simplicité est telle que les conversations se déplacent vers la manière de construire les pages web, le processus de rédaction de contenu et de déploiement. Il est, par exemple, plus facile d’appréhender le principe d’une Pull Request sur Github avec ce type de projet qu’avec un gros bousin sans nom.</p>\n\n<p>Le travail est mieux valorisé, on progresse plus rapidement sur des problématiques meta : organisation, rédaction, optimisation…</p>\n\n<h2 id=\"le-chemin-parcouru\">Le chemin parcouru</h2>\n\n<p>Ainsi après 3 ans d’utilisation de Jekyll, je n’ai pas l’impression d’avoir développé des compétences techniques hors du commun qui pourraient me faire passer pour un “expert”, mais plutôt d’avoir eu suffisamment vu de cas d’études pour avoir une meilleure idée des applications possibles.</p>\n\n<p>Je me rends compte que j’enseigne Jekyll à des groupes depuis 3 années, c’est pourquoi je propose aux personnes intéressées des <a href=\"/formation-jekyll\">cours de web à travers la maîtrise de Jekyll</a>. L’idée est de rendre les personnes autonomes pour la réalisation de sites web en utilisant Jekyll et Github pages (par exemple). Cela se passe à travers des ateliers où il est possible de faire passer des idées ou des petits récits sur l’histoire du web.</p>\n\n<p>Et tout cela me permet de continuer de rêver. Pourquoi ne pas construire des espaces nomades de travail ? Des collaborations avec des personnes aux quatre coins de France. Organiser des ateliers manuels, inventer des espaces collaboratifs… écrire des livres.</p>\n\n", "markdown": "Récemment s'est lancé la communauté [Jekyll France](http://jekyll-fr.org/). Un petit groupe de discussion autour des évolutions de ce [générateur de site statique](/generateur-site-statique/).\n\nÉtant le plus populaire, nous voyons un grand nombre d'évolutions arriver à chaque nouvelle mouture du système mais nous voyons aussi des modules permettant de brancher Jekyll avec des services tiers. Ces services sont du type éditeurs de contenu en ligne ou encore sites d'e-commerce.\n\n## Mon orientation\n\nDe mon côté, j'ai toujours aimé les choses simples, robustes et pas prises de tête. C'est pour ce la que je décline des sites avec Jekyll et que je le conseille si la solution est pertinente. Pour avoir décliné des pages pendant des années avec des CMS, je n'ai jamais compris pourquoi on passait des semaines à tordre un système pour afficher quelques pages de contenus.\n\nJe reste fidèle au web et au contenu first, c'est pour cette raison que je participe à l'animation de la communauté Jekyll France afin de promouvoir d'abord les gestionnaires de contenu statique et ensuite Jekyll en relayant son actualité. \nC'est en discutant des avancées de Jekyll qu'on peut mettre en perspective les orientations des autres gestionnaires de site statique qui doivent forcément se démarquer pour exister.\n\n## Mon sentiment\n\nCe qui est appréciable avec les gestionnaires de contenu statique c'est que techniquement les discussions ne vont pas très loin. Tout ce qui est développé existe déjà dans les CMS et tout ce qu'il est possible d'utiliser s'applique en quelques petites heures.\n\nLa simplicité est telle que les conversations se déplacent vers la manière de construire les pages web, le processus de rédaction de contenu et de déploiement. Il est, par exemple, plus facile d'appréhender le principe d'une Pull Request sur Github avec ce type de projet qu'avec un gros bousin sans nom.\n\nLe travail est mieux valorisé, on progresse plus rapidement sur des problématiques meta : organisation, rédaction, optimisation…\n\n## Le chemin parcouru\n\nAinsi après 3 ans d'utilisation de Jekyll, je n'ai pas l'impression d'avoir développé des compétences techniques hors du commun qui pourraient me faire passer pour un \"expert\", mais plutôt d'avoir eu suffisamment vu de cas d'études pour avoir une meilleure idée des applications possibles.\n\nJe me rends compte que j'enseigne Jekyll à des groupes depuis 3 années, c'est pourquoi je propose aux personnes intéressées des [cours de web à travers la maîtrise de Jekyll](/formation-jekyll). L'idée est de rendre les personnes autonomes pour la réalisation de sites web en utilisant Jekyll et Github pages (par exemple). Cela se passe à travers des ateliers où il est possible de faire passer des idées ou des petits récits sur l'histoire du web.\n\nEt tout cela me permet de continuer de rêver. Pourquoi ne pas construire des espaces nomades de travail ? Des collaborations avec des personnes aux quatre coins de France. Organiser des ateliers manuels, inventer des espaces collaboratifs… écrire des livres.\n\n" }