{ "id": "/2016/07/04/entreprise-inversee-distance", "title": "L’entreprise inversée - la distance", "url": "https://bertrandkeller.info/2016/07/04/entreprise-inversee-distance/", "date": 1467583200, "html": "<h2 id=\"le-lieu-de-travail\">Le lieu de travail</h2>\n\n<p>Prendre un contrat dans une entreprise c’est aussi signer un contrat de travail et se soumettre à un lieu de travail sur lequel exercer les tâches demandées.</p>\n\n<p>À moins d’être en grande position de force ou dans des métiers bien particuliers, il n’est pas aisé de négocier une liberté de déplacements ou d’horaires à la carte.</p>\n\n<p>L’entreprise doit contrôler la production et son rôle tend à contraindre au maximum les parties à respecter des règles simples sensées permettre des cadences conséquentes.</p>\n\n<h2 id=\"lentreprise--une-famille\">L’entreprise : une famille</h2>\n\n<p>Dans les conférences RH (ressources humaines), les discussions entre gestionnaires des humains, on se gargarise des innovations sociales mise en place pour permettre un plus grand bonheur au travail.</p>\n\n<p>On parle d’une génération Y qui n’existe pas, du babyfoot disposé dans le hall, les paniers de fruits frais près de la machine à café…\nMais ces entreprises restent des entreprises avec un comité de direction tout en haut qui discute de la manière de faire fructifier leur capital investit.</p>\n\n<p>Ils parlent de placer l’humain au centre de leur préoccupation tout comme le bon patron d’usine industrielle parlait de ses employés en bon père paternaliste.</p>\n\n<p>Ces nouvelles entreprises font miroiter le bonheur au travail et le bien être, ils parlent de famille, comme pour contraindre toujours plus les employés à passer du temps sur leur lieu de travail.</p>\n\n<h2 id=\"la-distance\">La distance</h2>\n\n<p>Il n’y a aucune révolution dans les modes de gestion des entreprises, on change la manière de travailler, mais en soit les rapport sociaux ne changent pas. Voire ils empirent. Quand l’entreprise va mal, on harcèle insidieusement plutôt que d’annoncer les choses clairement.</p>\n\n<p>Malgré la révolution du support, la distance ne change pas. Les outils numériques sont vendus comme sensés nous faire gagner ou libérer du temps et au lieu de ça ils nous asservissent (=&gt; Burnout).</p>\n\n<p>L’entreprise doit savoir changer cette notion de distance. Mettre de la distance avec les employés, l’entreprise n’est pas une famille. Pour cela il est nécessaire d’être capable de permettre le travail à distance (qui n’est pas du télétravail).</p>\n\n<p>Si un collaborateur s’engage à participer à une entreprise à lui de proposer la manière dont il peut le mieux aider la réalisation de tâches. Inutile de le contraindre à venir sur un lieu, il devra rendre des comptes à son groupe et faire des retours sur son engagement et ce qu’il a mis en œuvre (dans le cadre d’une prise en considération constante de son apport citoyen).</p>\n\n<h2 id=\"le-travail--distance\">Le travail à distance</h2>\n\n<p>Dans l’entreprise inversée, il n’y a pas de lieu de travail déterminé. Les équipes partent d’un travail à distancea priori.</p>\n\n<p>Qu’ils puissent se réunir dans un lieu ou pas, tout est organisé pour pouvoir échanger à distance. Il existe aujourd’hui beaucoup de retour d’expériences avec des outils numériques pointus : chat, partage de documents, visioconférence…</p>\n\n<p>Un suivi constant est réalisé pour s’assurer que chacun maîtrise des systèmes techniques simples. Il est important qu’une personne ne prenne pas le pas sur les autres grâce à ses compétences techniques. L’objectif est d’être sûr que chacun puisse s’exprimer, se sente autoriser à participer au débat et remettre en cause les outils.</p>\n\n<p>Ainsi, un ensemble d’échanges sera archivé et disponible pour tout nouveau participant à un projet. On utilise le numérique comme outil de documentation.</p>\n\n<p>L’ouverture d’esprit est privilégié, les rencontres encouragées et les nouvelles expériences fortement souhaitées.</p>\n\n<p><em>Note</em> : on verra dans un billet à venir la question du lieu de travail comme laboratoire d’expérimentation.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>L’entreprise inversée décentralise complètement les rapports entre les collaborateurs.</p>\n\n<p>Chacun s’engage dans l’entreprise pour une raison qui lui est propre, l’entreprise est le support de son engagement. Il existe une distance entre l’entité et l’employé afin de permettre l’émancipation individuelle et collective.</p>\n\n<p>Les contraintes spaciales sont fixées par les nécessités des équipes ou projets pour cela les échanges sont par principe organisés pour se faire à distance (ce qui n’empêche pas les contacts de proximité).</p>\n\n<p>Les collaborateurs privilégient leur bien être avant celui du groupe, seul moyen d’avoir des groupes apaisés.</p>\n\n", "markdown": "## Le lieu de travail\n\nPrendre un contrat dans une entreprise c'est aussi signer un contrat de travail et se soumettre à un lieu de travail sur lequel exercer les tâches demandées.\n\nÀ moins d’être en grande position de force ou dans des métiers bien particuliers, il n'est pas aisé de négocier une liberté de déplacements ou d'horaires à la carte.\n\nL'entreprise doit contrôler la production et son rôle tend à contraindre au maximum les parties à respecter des règles simples sensées permettre des cadences conséquentes.\n\n## L’entreprise : une famille\n\nDans les conférences RH (ressources humaines), les discussions entre gestionnaires des humains, on se gargarise des innovations sociales mise en place pour permettre un plus grand bonheur au travail.\n\nOn parle d’une génération Y qui n'existe pas, du babyfoot disposé dans le hall, les paniers de fruits frais près de la machine à café…\nMais ces entreprises restent des entreprises avec un comité de direction tout en haut qui discute de la manière de faire fructifier leur capital investit.\n\nIls parlent de placer l'humain au centre de leur préoccupation tout comme le bon patron d'usine industrielle parlait de ses employés en bon père paternaliste.\n\nCes nouvelles entreprises font miroiter le bonheur au travail et le bien être, ils parlent de famille, comme pour contraindre toujours plus les employés à passer du temps sur leur lieu de travail.\n\n## La distance\n\nIl n'y a aucune révolution dans les modes de gestion des entreprises, on change la manière de travailler, mais en soit les rapport sociaux ne changent pas. Voire ils empirent. Quand l'entreprise va mal, on harcèle insidieusement plutôt que d’annoncer les choses clairement.\n\nMalgré la révolution du support, la distance ne change pas. Les outils numériques sont vendus comme sensés nous faire gagner ou libérer du temps et au lieu de ça ils nous asservissent (=> Burnout).\n\nL'entreprise doit savoir changer cette notion de distance. Mettre de la distance avec les employés, l'entreprise n'est pas une famille. Pour cela il est nécessaire d’être capable de permettre le travail à distance (qui n'est pas du télétravail).\n\nSi un collaborateur s'engage à participer à une entreprise à lui de proposer la manière dont il peut le mieux aider la réalisation de tâches. Inutile de le contraindre à venir sur un lieu, il devra rendre des comptes à son groupe et faire des retours sur son engagement et ce qu'il a mis en œuvre (dans le cadre d'une prise en considération constante de son apport citoyen).\n\n## Le travail à distance\n\nDans l'entreprise inversée, il n'y a pas de lieu de travail déterminé. Les équipes partent d'un travail à distancea priori.\n\nQu'ils puissent se réunir dans un lieu ou pas, tout est organisé pour pouvoir échanger à distance. Il existe aujourd'hui beaucoup de retour d'expériences avec des outils numériques pointus : chat, partage de documents, visioconférence…\n\nUn suivi constant est réalisé pour s'assurer que chacun maîtrise des systèmes techniques simples. Il est important qu'une personne ne prenne pas le pas sur les autres grâce à ses compétences techniques. L'objectif est d'être sûr que chacun puisse s'exprimer, se sente autoriser à participer au débat et remettre en cause les outils.\n\nAinsi, un ensemble d’échanges sera archivé et disponible pour tout nouveau participant à un projet. On utilise le numérique comme outil de documentation.\n\nL’ouverture d'esprit est privilégié, les rencontres encouragées et les nouvelles expériences fortement souhaitées.\n\n*Note* : on verra dans un billet à venir la question du lieu de travail comme laboratoire d’expérimentation.\n\n## Conclusion\n\nL'entreprise inversée décentralise complètement les rapports entre les collaborateurs.\n\nChacun s'engage dans l'entreprise pour une raison qui lui est propre, l'entreprise est le support de son engagement. Il existe une distance entre l’entité et l’employé afin de permettre l’émancipation individuelle et collective.\n\nLes contraintes spaciales sont fixées par les nécessités des équipes ou projets pour cela les échanges sont par principe organisés pour se faire à distance (ce qui n'empêche pas les contacts de proximité).\n\nLes collaborateurs privilégient leur bien être avant celui du groupe, seul moyen d'avoir des groupes apaisés.\n\n\n\n\n" }