{ "id": "/2019/12/03/resilience-systeme", "title": "Vulnérabilité et résilience d’un système", "url": "https://bertrandkeller.info/2019/12/03/resilience-systeme/", "date": 1575327600, "html": "<h2 id=\"quest-ce-que-la-rsilience-\">Qu’est-ce que la résilience ?</h2>\n\n<blockquote>\n <p>La résilience désigne originellement la résistance d’un matériau aux chocs ; (le « fait de rebondir », du latin resilientia, de resiliens), définition ensuite étendue à la capacité d’un corps, d’un organisme, d’une espèce, d’un système, d’une structure à surmonter une altération de son environnement.</p>\n</blockquote>\n\n<p>Pour un site web la résilience serait la capacité à continuer à donner accès à l’information malgré un faible réseau, une attaque extérieure,… la non maintenance dans le temps du système.</p>\n\n<h2 id=\"diffrents-modles-de-raction\">Différents modèles de réaction</h2>\n\n<p>Pour cet article, j’ai retenu 2 modèles de réaction d’un système face à une altération :</p>\n\n<ol>\n <li>Le modèle de protection</li>\n <li>Le modèle de stabilisation</li>\n</ol>\n\n<p>(Voir le graphique ci-dessus)</p>\n\n<p>Le modèle de protection est un modèle qui va compenser autant qu’il peut une altération mais pas la contenir en totalité. Le modèle de stabilisation semble plutôt un modèle qui compense l’altération quelle que soit la virulence de l’altération.</p>\n\n<p>Le modèle de stabilisation semble permettre au système une meilleur survie dans le temps.</p>\n\n<h2 id=\"wordpress-vs-sites-statiques\">WordPress VS Sites Statiques</h2>\n\n<p>WordPress est un système qui est attaqué de manière permanente étant donnée sa popularité et sa vulnérabilité. Pour protéger WordPress des attaques, il est nécessaire de mettre en place une série de configurations et d’installations de modules.</p>\n\n<p><strong>Quoiqu’il arrive, votre site ne résistera pas à une attaque massive.</strong></p>\n\n<p>Un site statique ne demande aucune configuration particulière pour sa protection. Il sert des pages statiques qui sont quasi-inattaquables. Le risque existe toujours un petit peu mais globalement une fois en place, il répondra de la même manière quelle que soit l’altération.</p>\n\n<p><strong>Votre site résistera (mieux) à des tentatives d’attaques massives.</strong></p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Si vous cherchez à mettre en place une architecture web résiliente. Personnellement, je dirais <strong>oubliez WordPress</strong> ; plus globalement, je dirais choisissez <strong>des systèmes qui proposent un modèle de stabilisation</strong>.</p>\n\n<p>Les générateurs de sites statiques sont des solutions très adaptées, qui vous permettront d’exposer le moins possible vos données pour une dépense d’énergie moindre.</p>\n\n", "markdown": "## Qu'est-ce que la résilience ?\n\n> La résilience désigne originellement la résistance d’un matériau aux chocs ; (le « fait de rebondir », du latin resilientia, de resiliens), définition ensuite étendue à la capacité d’un corps, d’un organisme, d’une espèce, d’un système, d’une structure à surmonter une altération de son environnement.\n\nPour un site web la résilience serait la capacité à continuer à donner accès à l’information malgré un faible réseau, une attaque extérieure,… la non maintenance dans le temps du système.\n\n## Différents modèles de réaction\n\nPour cet article, j'ai retenu 2 modèles de réaction d’un système face à une altération :\n\n1. Le modèle de protection\n2. Le modèle de stabilisation\n\n(Voir le graphique ci-dessus)\n\nLe modèle de protection est un modèle qui va compenser autant qu'il peut une altération mais pas la contenir en totalité. Le modèle de stabilisation semble plutôt un modèle qui compense l’altération quelle que soit la virulence de l’altération.\n\nLe modèle de stabilisation semble permettre au système une meilleur survie dans le temps.\n\n## WordPress VS Sites Statiques\n\nWordPress est un système qui est attaqué de manière permanente étant donnée sa popularité et sa vulnérabilité. Pour protéger WordPress des attaques, il est nécessaire de mettre en place une série de configurations et d’installations de modules.\n\n**Quoiqu’il arrive, votre site ne résistera pas à une attaque massive.**\n\nUn site statique ne demande aucune configuration particulière pour sa protection. Il sert des pages statiques qui sont quasi-inattaquables. Le risque existe toujours un petit peu mais globalement une fois en place, il répondra de la même manière quelle que soit l’altération.\n\n**Votre site résistera (mieux) à des tentatives d’attaques massives.**\n\n## Conclusion\n\nSi vous cherchez à mettre en place une architecture web résiliente. Personnellement, je dirais __oubliez WordPress__ ; plus globalement, je dirais choisissez __des systèmes qui proposent un modèle de stabilisation__.\n\nLes générateurs de sites statiques sont des solutions très adaptées, qui vous permettront d'exposer le moins possible vos données pour une dépense d’énergie moindre.\n\n" }