{ "id": "/2019/06/13/outil-ecriture-riche", "title": "Outils pour l'écriture riche - Ovide/Tiddlywiki/Odyssey", "url": "https://bertrandkeller.info/2019/06/13/outil-ecriture-riche/", "date": 1560376800, "html": "<p>Certains groupes de personnes ou communautés peuvent avoir besoin de structures de contenus différentes. Voici 3 outils un peu originaux.</p>\n\n<h2 id=\"ovide\">Ovide</h2>\n\n<p>Ovide est basé sur <a href=\"peritext\">https://peritext.github.io/</a></p>\n\n<blockquote>\n <p>Ovide est un outil expérimental d’écriture et d’édition. Il est fait pour permettre des activités de publication savante polymorphiques et ancrées dans un contexte documentaire et médiatique riche.</p>\n</blockquote>\n\n<p>Voilà tout est dit, mais ça n’explique pas qu’est-ce que le truc a de plus que les autres ?</p>\n\n<p>Il semble avoir été créé pour aider les personnes du monde universitaire à se créer des corpus documentaires qu’ils peuvent compléter/publier/analyser.</p>\n\n<p>De ce que j’ai compris, dans un schéma documentaire classique, on a une bibliothèque d’éléments d’un côté et un documents de l’autre ; ce document liste une partie des éléments de cette bibliothèque.</p>\n\n<p>Avec Peritext, on insère une phase intermédiaire de contextualisation. C’est un dire un conteneur (un graphique + un texte + une image). Ce conteneur peut être inséré dans une page, mais avec un paramètre d’affichage en fonction de l’endroit où on désire l’afficher (ils appellent ça un contexte de formatage).</p>\n\n<p>Comme ça, quand le document de la bibliothèque est complété, il met à jour l’ensemble de tous les documents qui l’utilise.</p>\n\n<p>Découvrir <a href=\"https://peritext.github.io/ovide/\">Ovide</a>.</p>\n\n<h2 id=\"tiddlywiki\">TiddlyWiki</h2>\n\n<blockquote>\n <p>TiddlyWiki est un bloc-notes non linéaire unique permettant de capturer, d’organiser et de partager des informations complexes.</p>\n</blockquote>\n\n<p>Pour le coup, le concept est déroutant. Le contenu est intégré dans une seule page HTML. Dans cette page HTML, on a des éléments de contenu (des tiddlers) complètement indépendants ; ces éléments de contenus sont “formatables” (typés) afin d’afficher correspondre aux informations qu’on souhaite traiter.</p>\n\n<p>Chaque tiddlers peut être lié aux autres par des liens. Apparemment unidirectionnels.</p>\n\n<p>Ensuite, il est possible de faire des groupements de tiddlers en appliquant une (ou plusieurs) catégories.</p>\n\n<div class=\"center\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/KtCUr83XgyE\" frameborder=\"0\" allow=\"accelerometer; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen=\"\"></iframe>\n</div>\n<p><br/></p>\n\n<p>Cet outil est conçu pour l’édition de notes/idées. Il correspond à une d’organisation de la pensée où chaque tiddler est une idée.</p>\n\n<p>Le but est de consulter ses idées et de pouvoir les ordonner en fonction du besoin.</p>\n\n<p>Découvrir <a href=\"https://tiddlywiki.com/\">Tiddlywiki</a>.</p>\n\n<h2 id=\"odyssey\">Odyssey</h2>\n\n<blockquote>\n <p>Un moyen simple pour les journalistes, les concepteurs, et créateurs pour tisser des histoires interactives.</p>\n</blockquote>\n\n<p>Odyssey est vraiment dédié à la rédaction d’histoires itinérantes. Nous avons un grand document rédigé sous un format qui ressemble à du MarkDown.</p>\n\n<p>Dans ce grand document, on a des éléments qui commencent par un titre (ici : Your first odyssey.js story) ; un élément comprend des métadonnées pour paramétrer l’affichage sur la carte ; en dessous un descriptif (texte, image, vidéo).</p>\n\n<p>```HTML\n#Your first odyssey.js story\n‘’’\n- center: [37.7620, -122.4385]\n- zoom: 9\nL.marker([37.7620, -122.4385]).actions.addRemove(S.map)\nO.Actions.Sleep(1000)\n‘’’</p>\n\n<p>Move the map around and save the position by clicking on “ADD &gt; Move map to the current position”. As you can see, now we are highlighting San Francisco.</p>\n\n<p>Then add here the description for your slide so it’s shown on the left side box.\n```</p>\n\n<p>À partir du même document rédactionnel, il est possible de décliner 2 affichages différents : slide et scroll.</p>\n\n<p>Dans leur example, on a une carte du monde, mais on doit aussi pouvoir faire des parcours plus restreints.</p>\n\n<p>Découvrir <a href=\"http://cartodb.github.io/odyssey.js/\">Odyssey</a>.</p>\n", "markdown": "Certains groupes de personnes ou communautés peuvent avoir besoin de structures de contenus différentes. Voici 3 outils un peu originaux.\n\n## Ovide\n\nOvide est basé sur [https://peritext.github.io/](peritext)\n\n> Ovide est un outil expérimental d'écriture et d'édition. Il est fait pour permettre des activités de publication savante polymorphiques et ancrées dans un contexte documentaire et médiatique riche.\n\nVoilà tout est dit, mais ça n’explique pas qu'est-ce que le truc a de plus que les autres ?\n\nIl semble avoir été créé pour aider les personnes du monde universitaire à se créer des corpus documentaires qu'ils peuvent compléter/publier/analyser.\n\nDe ce que j'ai compris, dans un schéma documentaire classique, on a une bibliothèque d'éléments d'un côté et un documents de l'autre ; ce document liste une partie des éléments de cette bibliothèque.\n\nAvec Peritext, on insère une phase intermédiaire de contextualisation. C'est un dire un conteneur (un graphique + un texte + une image). Ce conteneur peut être inséré dans une page, mais avec un paramètre d'affichage en fonction de l'endroit où on désire l'afficher (ils appellent ça un contexte de formatage).\n\nComme ça, quand le document de la bibliothèque est complété, il met à jour l'ensemble de tous les documents qui l'utilise.\n\n\nDécouvrir [Ovide](https://peritext.github.io/ovide/).\n\n## TiddlyWiki\n\n> TiddlyWiki est un bloc-notes non linéaire unique permettant de capturer, d'organiser et de partager des informations complexes.\n\nPour le coup, le concept est déroutant. Le contenu est intégré dans une seule page HTML. Dans cette page HTML, on a des éléments de contenu (des tiddlers) complètement indépendants ; ces éléments de contenus sont \"formatables\" (typés) afin d'afficher correspondre aux informations qu'on souhaite traiter.\n\nChaque tiddlers peut être lié aux autres par des liens. Apparemment unidirectionnels.\n\nEnsuite, il est possible de faire des groupements de tiddlers en appliquant une (ou plusieurs) catégories.\n\n<div class=\"center\">\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/KtCUr83XgyE\" frameborder=\"0\" allow=\"accelerometer; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n</div>\n<br>\n\nCet outil est conçu pour l’édition de notes/idées. Il correspond à une d'organisation de la pensée où chaque tiddler est une idée.\n\nLe but est de consulter ses idées et de pouvoir les ordonner en fonction du besoin.\n\nDécouvrir [Tiddlywiki](https://tiddlywiki.com/).\n\n## Odyssey\n\n> Un moyen simple pour les journalistes, les concepteurs, et créateurs pour tisser des histoires interactives.\n\nOdyssey est vraiment dédié à la rédaction d’histoires itinérantes. Nous avons un grand document rédigé sous un format qui ressemble à du MarkDown.\n\nDans ce grand document, on a des éléments qui commencent par un titre (ici : Your first odyssey.js story) ; un élément comprend des métadonnées pour paramétrer l'affichage sur la carte ; en dessous un descriptif (texte, image, vidéo).\n\n\n```HTML\n#Your first odyssey.js story\n'''\n- center: [37.7620, -122.4385]\n- zoom: 9\nL.marker([37.7620, -122.4385]).actions.addRemove(S.map)\nO.Actions.Sleep(1000)\n'''\n\nMove the map around and save the position by clicking on \"ADD > Move map to the current position\". As you can see, now we are highlighting San Francisco.\n\nThen add here the description for your slide so it's shown on the left side box.\n```\n\nÀ partir du même document rédactionnel, il est possible de décliner 2 affichages différents : slide et scroll.\n\nDans leur example, on a une carte du monde, mais on doit aussi pouvoir faire des parcours plus restreints.\n\nDécouvrir [Odyssey](http://cartodb.github.io/odyssey.js/).\n" }