{ "id": "/2016/06/17/entreprise-inversee", "title": "L'entreprise inversée", "url": "https://bertrandkeller.info/2016/06/17/entreprise-inversee/", "date": 1466114400, "html": "<p>Connaissez vous la classe inversée, ce principe qui consiste à ce que les élèves travaillent à la maison et mettent en application leur connaissance en classe.</p>\n\n<blockquote>\n <p>La classe inversée (en anglais : « flipped classroom ») est une approche pédagogique qui inverse la nature des activités d’apprentissage en classe et à la maison, ce qui amène une modification des rôles traditionnels d’apprentissage</p>\n</blockquote>\n\n<h2 id=\"la-classe-inverse\">La classe inversée</h2>\n\n<p>La classe inversée part du principe qu’énormément de contenus, cours, exemples sont disponibles sur le web.</p>\n\n<p>Par exemple, pour les petits sportifs en herbe, on trouve beaucoup de vidéos avec les techniques de jongles ou de dribbles. Nos jeunes pousses reproduisent ces gestes chez eux ou dans leur cours de récréation.</p>\n\n<p>Donc pas besoin de leur apprendre le geste, plutôt passer du temps à leur apprendre à faire le geste. Mieux vaut les mettre en condition de pratiquer une activité que d’apprendre l’activité elle-même. On est gagnant sur les 2 tableaux car le temps de pratique est plus important, mais aussi la discipline de groupe lors d’une activité de pratique est toujours plus facile que pour de la théorie.</p>\n\n<h2 id=\"lentreprise-inverse\">L’entreprise inversée</h2>\n\n<p>Et pourquoi pas faire la même chose pour les entreprises ? les savoirs de nombreuses professions évoluent en permanence, beaucoup sont déjà acquis à la maison ou lors de rencontres extra-professionnelles.</p>\n\n<p>L’entreprise n’est plus que le lieu de la mise en pratique de ces savoirs. Et la pratique est d’autant meilleure que les savoirs sont divers.</p>\n\n<p>Cet emploi du temps c’est celui que j’exerce en tant que freelance. Je ne me prive pas d’aller à des conférences (seule des contraintes familiales me freinent). Je discute le plus possible entre deux paliers. Je me nourris d’activités extra-professionnelles pour apprendre des gens que je côtoie.</p>\n\n<p>Finalement, je passe peu de temps à mon bureau et encore moins à coder. La majeure partie du temps, je lis, je compile, je partage et je discute. Et je n’ai pas de problème de synchronisation de groupe car je suis discipliné.</p>\n\n<p>Alors pourquoi encore aller au travail tous les jours et ne pas pratiquer l’entreprise inversée ? Pourquoi être dépendant d’un lieu fixe et ne pas se nourrir des activités d’autres personnes pour le faire partager à vos collègues ?</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Si la richesse des entreprises du web passe par leur capacité à tester et mettre en place des scénarios utilisateurs, elle doit permettre à ses employés d’avoir une diversité culturelle importante et pour cela les laisser vagabonder afin de libérer leurs esprits.</p>\n", "markdown": "Connaissez vous la classe inversée, ce principe qui consiste à ce que les élèves travaillent à la maison et mettent en application leur connaissance en classe.\n\n> La classe inversée (en anglais : « flipped classroom ») est une approche pédagogique qui inverse la nature des activités d'apprentissage en classe et à la maison, ce qui amène une modification des rôles traditionnels d'apprentissage\n\n## La classe inversée\n\nLa classe inversée part du principe qu'énormément de contenus, cours, exemples sont disponibles sur le web. \n\nPar exemple, pour les petits sportifs en herbe, on trouve beaucoup de vidéos avec les techniques de jongles ou de dribbles. Nos jeunes pousses reproduisent ces gestes chez eux ou dans leur cours de récréation.\n\nDonc pas besoin de leur apprendre le geste, plutôt passer du temps à leur apprendre à faire le geste. Mieux vaut les mettre en condition de pratiquer une activité que d'apprendre l'activité elle-même. On est gagnant sur les 2 tableaux car le temps de pratique est plus important, mais aussi la discipline de groupe lors d'une activité de pratique est toujours plus facile que pour de la théorie.\n\n## L'entreprise inversée\n\nEt pourquoi pas faire la même chose pour les entreprises ? les savoirs de nombreuses professions évoluent en permanence, beaucoup sont déjà acquis à la maison ou lors de rencontres extra-professionnelles.\n\nL'entreprise n'est plus que le lieu de la mise en pratique de ces savoirs. Et la pratique est d'autant meilleure que les savoirs sont divers.\n\nCet emploi du temps c'est celui que j'exerce en tant que freelance. Je ne me prive pas d'aller à des conférences (seule des contraintes familiales me freinent). Je discute le plus possible entre deux paliers. Je me nourris d'activités extra-professionnelles pour apprendre des gens que je côtoie.\n\nFinalement, je passe peu de temps à mon bureau et encore moins à coder. La majeure partie du temps, je lis, je compile, je partage et je discute. Et je n'ai pas de problème de synchronisation de groupe car je suis discipliné.\n\nAlors pourquoi encore aller au travail tous les jours et ne pas pratiquer l'entreprise inversée ? Pourquoi être dépendant d'un lieu fixe et ne pas se nourrir des activités d'autres personnes pour le faire partager à vos collègues ?\n\n## Conclusion\n\nSi la richesse des entreprises du web passe par leur capacité à tester et mettre en place des scénarios utilisateurs, elle doit permettre à ses employés d'avoir une diversité culturelle importante et pour cela les laisser vagabonder afin de libérer leurs esprits.\n" }