{ "id": "/2017/08/30/netlify-leve-12-millions-dollars", "title": "Netlify lève 12 millions de dollars", "url": "https://bertrandkeller.info/2017/08/30/netlify-leve-12-millions-dollars/", "date": 1504044000, "html": "<p>L’entreprise américaine spécialisée dans l’hébergement et le déploiement de sites statiques vient de lever 12 millions de dollars.</p>\n\n<blockquote>\n <p>Netlify, a startup that’s building software tools to help drive the future of web development, announced today that it has raised $12 million in series A funding.</p>\n</blockquote>\n\n<p>Des entreprises comme <a href=\"https://mailchimp.com/\">Mailchimp</a>, <a href=\"https://www.sequoiacap.com/\">Sequoia Capital</a> sont passées sur le modèle de la JAMStack.</p>\n\n<h2 id=\"les-sites-statiques-comme-systmes-de-modlisation\">Les sites statiques comme systèmes de modélisation</h2>\n\n<p>A l’heure de Frameworks Javascript robustes et établis, des interfaces mobiles qui doivent répondre des besoins métiers simples ; la maîtrise technique ne représente plus un avantage concurrentiel majeur.</p>\n\n<p>Pour développer de nouvelles activités, il est indispensable de s’orienter sur des secteurs de niche. Pour cela, le développement de l’image de marque et du positionnement web doit représenter le cœur de l’activité.</p>\n\n<p>Cela nécessite de mettre en place une culture d’entreprise particulière et une maîtrise de l’éditorialisation élaborée.</p>\n\n<p>Les <a href=\"/generateur-site-statique/\">générateurs de site statique</a> sont la pierre angulaire de la construction du processus éditorial avec la modélisation de l’ensemble des contenus : communiqués, actualités, newsletter, fiches…</p>\n\n<p>Une fois la base de contenus ciselée, il viendra enfin le temps de la monétisation et de l’ajout de fonctionnalités permettant la manipulation de ces mêmes contenus.</p>\n\n<h2 id=\"le-march-franais--la-ramasse-\">Le marché Français à la ramasse ?</h2>\n\n<p>Je ne fréquente pas les hautes sphères au quotidien, mais il ne semble pas que beaucoup de personnes sont encore en recherche de compétences spécifiques dans ce domaine.</p>\n\n<p>La partie éditorialisation serait-elle encore vue comme une partie triviale qui ne demande que peu d’intérêts ? Faut-il construire des systèmes imbitables avec des CMS extra compliqués pour justifier un poste dans le monde de l’informatique ?</p>\n\n<p>Ce qui est sûr c’est que la route pour la modélisation de contenus éditoriaux à forte valeur ajoutée est longue, très longue. C’est celle qui demande le plus de travail et qui bloque la sortie d’interfaces.</p>\n\n<p>Pourtant c’est elle qui doit permettre de se démarquer et d’apporter satisfaction aux utilisateurs.</p>\n\n", "markdown": "L'entreprise américaine spécialisée dans l'hébergement et le déploiement de sites statiques vient de lever 12 millions de dollars.\n\n> Netlify, a startup that’s building software tools to help drive the future of web development, announced today that it has raised $12 million in series A funding. \n\nDes entreprises comme [Mailchimp](https://mailchimp.com/), [Sequoia Capital](https://www.sequoiacap.com/) sont passées sur le modèle de la JAMStack.\n\n## Les sites statiques comme systèmes de modélisation\n\nA l'heure de Frameworks Javascript robustes et établis, des interfaces mobiles qui doivent répondre des besoins métiers simples ; la maîtrise technique ne représente plus un avantage concurrentiel majeur.\n\nPour développer de nouvelles activités, il est indispensable de s'orienter sur des secteurs de niche. Pour cela, le développement de l'image de marque et du positionnement web doit représenter le cœur de l'activité.\n\nCela nécessite de mettre en place une culture d'entreprise particulière et une maîtrise de l'éditorialisation élaborée.\n\nLes [générateurs de site statique](/generateur-site-statique/) sont la pierre angulaire de la construction du processus éditorial avec la modélisation de l'ensemble des contenus : communiqués, actualités, newsletter, fiches…\n\nUne fois la base de contenus ciselée, il viendra enfin le temps de la monétisation et de l'ajout de fonctionnalités permettant la manipulation de ces mêmes contenus.\n\n## Le marché Français à la ramasse ?\n\nJe ne fréquente pas les hautes sphères au quotidien, mais il ne semble pas que beaucoup de personnes sont encore en recherche de compétences spécifiques dans ce domaine.\n\nLa partie éditorialisation serait-elle encore vue comme une partie triviale qui ne demande que peu d'intérêts ? Faut-il construire des systèmes imbitables avec des CMS extra compliqués pour justifier un poste dans le monde de l'informatique ?\n\nCe qui est sûr c'est que la route pour la modélisation de contenus éditoriaux à forte valeur ajoutée est longue, très longue. C'est celle qui demande le plus de travail et qui bloque la sortie d'interfaces.\n\nPourtant c'est elle qui doit permettre de se démarquer et d'apporter satisfaction aux utilisateurs.\n\n\n\n\n\n\n\n\n " }