{ "id": "/2020/12/04/eco-conception-et-mesure", "title": "L’éco-conception et la mesure", "url": "https://bertrandkeller.info/2020/12/04/eco-conception-et-mesure/", "date": 1607036400, "html": "<h2 id=\"lingnieur-et-le-territoire-inconnu-la-colonie\">L’ingénieur et le territoire inconnu (la colonie)</h2>\n\n<p>Au milieu du 19ème siècle c’était le temps des colonies, les empires étaient dans une période de grande expansion ; ils découvraient des territoires inconnus, de nouvelles cultures qui fallait civiliser :</p>\n\n<blockquote>\n <p>La question coloniale, c’est, pour les pays voués par la nature même de leur industrie à une grande exportation, comme la nôtre, la question même des débouchés. [….] Au temps où nous sommes et dans la crise que traversent toutes les industries européennes, la fondation d’une colonie, c’est la création d’un débouché. […]<br/>\n<strong>Jules Ferry</strong></p>\n</blockquote>\n\n<p>À qui a-t-on donner le rôle de civiliser ces territoires ? À des ingénieurs de Pont-et-Chaussées. Avec tout le succès qu’on connaît en terme d’organisation sociale et d’affirmation des peuples à disposer d’eux même.</p>\n\n<blockquote>\n <p>C’est aux ingénieurs des ponts et chaussées et du génie militaire qu’il s’en remet pour jeter les bases du futur développement de la colonie. Le vaste programme d’aménagement du territoire et de travaux d’équipement qu’il leur assigne ne va pas sans céder un peu à la manie arithmétique chère aux utopistes.<br/>\n<a href=\"https://www.cairn.info/aux-sources-du-roman-colonial-1863-1914--9782811139292-page-337.htm\">Progrès technique et utopies coloniales - cairn.info</a></p>\n</blockquote>\n\n<p>La comparaison est un peu tirée par les cheveux, mais quand il a s’agit de coloniser le nouveau territoire numérique (Internet) afin de “développer des débouchés”, à qui confie-t-on la mission ?<br/>\n=&gt; <strong>Réponse</strong> : des ingénieurs.</p>\n\n<p>Nous avons appliqué la même logique que pendant le courant du 19ème siècle avec le même succès de développement de la citoyenneté ainsi qu’un des plus haut respect de la nature et de l’environnement.</p>\n\n<p>Et quand on se rend compte que le numérique pèse trop sur les éco-systèmes que cherche-t-on comme solution pour répondre au problème ?<br/>\n=&gt; <strong>Réponse</strong> : Une solution technique (parce qu’on pense que ça va marcher mais aussi parce qu’on n’imagine pas d’autres manières de faire, on est formé dans les écoles supérieures pour ça).</p>\n\n<h2 id=\"lingnieur-et-la-mesure\">L’ingénieur et la mesure</h2>\n\n<p>Je vous conseille de lire ce long article de Paul Jorion <a href=\"https://www.pauljorion.com/blog/2020/11/28/la-transmission-des-savoirs/\">“la transmission des savoirs”</a>. Je ne vais pas le résumer ce serait trop long, mais il explique que la ré-exploitation des marais salants (à partir de 1977), n’a pas pu se faire en appliquant la méthode scientifique (d’ingénierie coloniale).</p>\n\n<blockquote>\n <p>Et ces scientifiques sont arrivés, et ils ont dit : “Chers amis paludiers, votre métier va se simplifier de manière drastique parce qu’aujourd’hui nous vous apportons l’instrument qui vous dira s’il y a assez de sel dissout dans l’eau. Rien qu’en lisant la jauge ou le cadran”.</p>\n</blockquote>\n\n<p>Annonce à laquelle ont répondu les paludiers par :</p>\n\n<blockquote>\n <p>“Ce pèse-sel, ça ne sert absolument à rien !”.</p>\n</blockquote>\n\n<p>Et effectivement l’article explique que la spécificité de l’exploitation de chaque “carré” qui, étant soumis aux vents, à la faune, aux algues […] ne peut se faire avec une méthode dite scientifique mais uniquement par l’expérience et la pratique quotidienne du milieu ; transmise de génération en génération.</p>\n\n<h2 id=\"lco-conception-et-la-mesure\">L’éco-conception et la mesure</h2>\n\n<h3 id=\"loffre\">L’offre</h3>\n\n<p>Qu’est-ce que le “numérique responsable” et “l’éco-conception” ?</p>\n\n<p>Il ne faut pas se leurrer ça reste des concepts de communication introduits par des personnes réellement désireuses de changer la donne et de se faire entendre dans un milieu sourd à leurs arguments.</p>\n\n<p>Cependant, la récupération “marketing” est un phénomène classique du marché qui corrompt le sens des mots et l’applique à des offres de services ou à des produits afin de rester compétitif sur un marché qui évolue.</p>\n\n<p>À quoi assiste-t-on sur les Internet ? À la multiplication des offres par des organismes qui ne souciaient pas du sujet 2 mois auparavant :</p>\n\n<ul>\n <li>“Vous voulez un site plus GREEN ?” ;</li>\n <li>“Soyez écolos en scalant Worldwide mais en respectant les fleurs” ;</li>\n <li>“Avec notre offre 360 C° évitez le coup de chaud”.</li>\n</ul>\n\n<p>Que propose-t-on ? Évidemment un super processus, version Pont-et-Chaussées, mais surtout de la mesure. Avec des beaux indicateurs tout verts qui garantissent un résultat plus green que green.</p>\n\n<h3 id=\"la-transformation\">La transformation</h3>\n\n<p>Et donc le marché s’adaptant, les directions &amp; les équipes adoptent les éléments de langages et se verdissent. Mais en passant à côté du cœur du problème.</p>\n\n<p>En effet, les chiffres concernant la consommation énergétique du numérique ne révèlent pas que le numérique consomme trop ; que le feu (indicateur température) sur la marmite est un peu trop élevé et, qu’en conséquence (application d’une boucle de rétroaction), il faut contrôler cette température et mettre en place une correction (permettant une transition énergétique douce théorique qui ne vient pas et ne viendra jamais).</p>\n\n<p>Non, les chiffres sur le réchauffement climatique de manière générale disent que la marmite va exploser !!!! Car les indicateurs réchauffement ne sont pas des mesures de chiffres instantanés mais le résultat d’un cumul sur plusieurs décennies. (ça vous quelque chose Tchernobyl ?)</p>\n\n<p>Ce qui signifie que la gestion des flux et leur optimisation sont inopérants sur le global. Que la gestion par le simple chiffre (dans laquelle la connaissance fine du milieu est une option) ne permet pas de gérer la situation d’urgence.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Si vous pensez avoir des pratiques “numérique responsable” ou “d’éco-conception” parce que vous faites de l’optimisation de flux sachez que vous vous méprenez (selon moi).</p>\n\n<p>Bien entendu, chaque petite optimisation est bonne à prendre : c’est mieux. Mais comme pour le marais salant, il est faux de croire que l’instrument de mesure ainsi qu’une expertise ingénieure est indispensable.</p>\n\n<p>Non, le niveau de connaissance partagé (par un groupe) concernant le milieu est bien plus important. En “éco-conception”, il n’y a pas besoin d’être développeur pour savoir qu’une image sur une page web est lourde à charger (et si on l’affiche ou pas). Il n’est pas nécessaire de sortir d’une école pour voir que personne de se sert d’un service numérisé et que le service physique est plus performant.</p>\n\n<p>On pense global, on pense le numérique en interaction avec le milieu entier.</p>\n\n<p>L’éco-conception n’est pas de l’optimisation mais bien une réflexion d’ordre stratégique sur l’outillage d’une organisation. C’est une manière de procéder qui de tente permettre aux structures de s’adapter à cette situation d’urgence (climatique).</p>\n\n<p>Le partage des connaissances, les choix, les décisions viennent d’abord ; les outils et les indicateurs après.</p>\n", "markdown": "## L’ingénieur et le territoire inconnu (la colonie)\n\nAu milieu du 19ème siècle c’était le temps des colonies, les empires étaient dans une période de grande expansion ; ils découvraient des territoires inconnus, de nouvelles cultures qui fallait civiliser :\n\n> La question coloniale, c’est, pour les pays voués par la nature même de leur industrie à une grande exportation, comme la nôtre, la question même des débouchés. [….] Au temps où nous sommes et dans la crise que traversent toutes les industries européennes, la fondation d'une colonie, c'est la création d'un débouché. [...] \n**Jules Ferry**\n\n\nÀ qui a-t-on donner le rôle de civiliser ces territoires ? À des ingénieurs de Pont-et-Chaussées. Avec tout le succès qu'on connaît en terme d’organisation sociale et d’affirmation des peuples à disposer d’eux même.\n\n> C’est aux ingénieurs des ponts et chaussées et du génie militaire qu’il s’en remet pour jeter les bases du futur développement de la colonie. Le vaste programme d’aménagement du territoire et de travaux d’équipement qu’il leur assigne ne va pas sans céder un peu à la manie arithmétique chère aux utopistes. \n[Progrès technique et utopies coloniales - cairn.info](https://www.cairn.info/aux-sources-du-roman-colonial-1863-1914--9782811139292-page-337.htm)\n\nLa comparaison est un peu tirée par les cheveux, mais quand il a s’agit de coloniser le nouveau territoire numérique (Internet) afin de \"développer des débouchés\", à qui confie-t-on la mission ? \n=> **Réponse** : des ingénieurs.\n\nNous avons appliqué la même logique que pendant le courant du 19ème siècle avec le même succès de développement de la citoyenneté ainsi qu’un des plus haut respect de la nature et de l'environnement.\n\nEt quand on se rend compte que le numérique pèse trop sur les éco-systèmes que cherche-t-on comme solution pour répondre au problème ? \n=> **Réponse** : Une solution technique (parce qu'on pense que ça va marcher mais aussi parce qu’on n’imagine pas d’autres manières de faire, on est formé dans les écoles supérieures pour ça).\n\n## L’ingénieur et la mesure\n\nJe vous conseille de lire ce long article de Paul Jorion [\"la transmission des savoirs\"](https://www.pauljorion.com/blog/2020/11/28/la-transmission-des-savoirs/). Je ne vais pas le résumer ce serait trop long, mais il explique que la ré-exploitation des marais salants (à partir de 1977), n’a pas pu se faire en appliquant la méthode scientifique (d’ingénierie coloniale).\n\n> Et ces scientifiques sont arrivés, et ils ont dit : \"Chers amis paludiers, votre métier va se simplifier de manière drastique parce qu’aujourd’hui nous vous apportons l’instrument qui vous dira s’il y a assez de sel dissout dans l’eau. Rien qu’en lisant la jauge ou le cadran\".\n\nAnnonce à laquelle ont répondu les paludiers par :\n\n> \"Ce pèse-sel, ça ne sert absolument à rien !\".\n\nEt effectivement l’article explique que la spécificité de l’exploitation de chaque \"carré\" qui, étant soumis aux vents, à la faune, aux algues […] ne peut se faire avec une méthode dite scientifique mais uniquement par l’expérience et la pratique quotidienne du milieu ; transmise de génération en génération.\n\n## L’éco-conception et la mesure\n\n### L’offre\n\nQu'est-ce que le \"numérique responsable\" et \"l’éco-conception\" ?\n\nIl ne faut pas se leurrer ça reste des concepts de communication introduits par des personnes réellement désireuses de changer la donne et de se faire entendre dans un milieu sourd à leurs arguments.\n\nCependant, la récupération \"marketing\" est un phénomène classique du marché qui corrompt le sens des mots et l’applique à des offres de services ou à des produits afin de rester compétitif sur un marché qui évolue.\n\nÀ quoi assiste-t-on sur les Internet ? À la multiplication des offres par des organismes qui ne souciaient pas du sujet 2 mois auparavant : \n\n * \"Vous voulez un site plus GREEN ?\" ;\n * \"Soyez écolos en scalant Worldwide mais en respectant les fleurs\" ;\n * \"Avec notre offre 360 C° évitez le coup de chaud\".\n\nQue propose-t-on ? Évidemment un super processus, version Pont-et-Chaussées, mais surtout de la mesure. Avec des beaux indicateurs tout verts qui garantissent un résultat plus green que green.\n\n### La transformation\n\nEt donc le marché s’adaptant, les directions & les équipes adoptent les éléments de langages et se verdissent. Mais en passant à côté du cœur du problème.\n\nEn effet, les chiffres concernant la consommation énergétique du numérique ne révèlent pas que le numérique consomme trop ; que le feu (indicateur température) sur la marmite est un peu trop élevé et, qu'en conséquence (application d’une boucle de rétroaction), il faut contrôler cette température et mettre en place une correction (permettant une transition énergétique douce théorique qui ne vient pas et ne viendra jamais).\n\nNon, les chiffres sur le réchauffement climatique de manière générale disent que la marmite va exploser !!!! Car les indicateurs réchauffement ne sont pas des mesures de chiffres instantanés mais le résultat d’un cumul sur plusieurs décennies. (ça vous quelque chose Tchernobyl ?)\n\nCe qui signifie que la gestion des flux et leur optimisation sont inopérants sur le global. Que la gestion par le simple chiffre (dans laquelle la connaissance fine du milieu est une option) ne permet pas de gérer la situation d’urgence.\n\n## Conclusion\n\nSi vous pensez avoir des pratiques \"numérique responsable\" ou \"d’éco-conception\" parce que vous faites de l'optimisation de flux sachez que vous vous méprenez (selon moi).\n\nBien entendu, chaque petite optimisation est bonne à prendre : c'est mieux. Mais comme pour le marais salant, il est faux de croire que l'instrument de mesure ainsi qu’une expertise ingénieure est indispensable.\n\nNon, le niveau de connaissance partagé (par un groupe) concernant le milieu est bien plus important. En \"éco-conception\", il n'y a pas besoin d’être développeur pour savoir qu’une image sur une page web est lourde à charger (et si on l’affiche ou pas). Il n'est pas nécessaire de sortir d’une école pour voir que personne de se sert d’un service numérisé et que le service physique est plus performant.\n\nOn pense global, on pense le numérique en interaction avec le milieu entier.\n\nL’éco-conception n’est pas de l’optimisation mais bien une réflexion d’ordre stratégique sur l’outillage d’une organisation. C'est une manière de procéder qui de tente permettre aux structures de s’adapter à cette situation d’urgence (climatique).\n\nLe partage des connaissances, les choix, les décisions viennent d’abord ; les outils et les indicateurs après.\n" }