{ "id": "/2019/06/18/HTML-est-le-web", "title": "HTML est le web", "url": "https://bertrandkeller.info/2019/06/18/HTML-est-le-web/", "date": 1560808800, "html": "<p>HTML ? Mais qu’est ce que ce sigle ? Que désigne-t-il ? HyperText Markup Language ou Langage de balisage hypertexte. On considère sa maîtrise souvent comme acquise ; pourtant c’est loin d’être le cas. Ses 116 balises sont comme les 26 lettres de l’alphabet, la base de notre communication sur le web. Ce n‘est pas pour cette raison que les équipes y apportent un intérêt particulier.</p>\n\n<h2 id=\"structure-de-documents\">Structure de documents</h2>\n\n<p>Le HTML est le langage à la base du web. Celui interprété par le navigateur. Il permet de rendre un contenu lisible : par des humains, des robots…</p>\n\n<p>Il dit ceci est un titre, ceci est un paragraphe, ceci est une citation… ceci est important, ceci est un contenu connexe…</p>\n\n<p>C’est l’intonation, celle qui permet de hiérarchiser l’information afin d’échanger des pensées complexes à travers un écran.</p>\n\n<blockquote>\n <p>Une page Web est un document. Les documents ont une structure. Sur le Web, il ne s’agit pas uniquement des éléments visuels ou de l’architecture fournie par votre infrastructure, il s’agit de choisir des éléments sémantiquement corrects. Les titres doivent être des titres, les listes doivent être des listes, les boutons doivent être des boutons et les tableaux doivent être des tableaux.</p>\n</blockquote>\n\n<h2 id=\"experts-du-sens\">Experts du sens</h2>\n\n<p>Comme pour la grammaire, la publication de livre, il existe des spécialistes de la structure des pages web.</p>\n\n<blockquote>\n <p>Je suis un type de type «frontend of the frontend». Mon expertise est en HTML et en CSS, alors je peux facilement expliquer pourquoi tout le monde devrait apprendre ce que je sais déjà. Mon travail n’est pas plus important que le vôtre. Si vous écrivez du code qui rend les choses dans un navigateur, c’est votre travail.</p>\n</blockquote>\n\n<p>Si pour le papier ce métier est reconnu… pour le web pas tellement. On passe par des disciplines comme l’accessibilité pour valoriser cette pratique ; mais sinon, il n’y a aucune offre d’embaûche spécifique en tant que : correcteur de structure documentaire des interfaces, documentaliste de site web,…</p>\n\n<p>Peut-être designer UI me dirait vous, mais celà ne relève pas spécifiquement du sens mais plutôt d’un rôle technique particulier.</p>\n\n<p>Une personne chargée de tout cela n’est pas nécessaire car la compétence peut-être partagée dans l’équipe. La discussion se fera à travers la réalisation d‘un “design system”. Si tout le monde sait lire et écrire du HTML pas de soucis.</p>\n\n<p>Le problème est que l’expérience montre que savoir lire et écrire du HTML n’est pas acquis. Si vous voulez des sites de qualité, il vous faut cette compétence.</p>\n\n<p>Lire <a href=\"https://www.petelambert.com/journal/html-is-the-web/\">HTML is the Web</a> de Pete Lambert qui explique pourquoi HTML est le web.</p>\n\n", "markdown": "HTML ? Mais qu'est ce que ce sigle ? Que désigne-t-il ? HyperText Markup Language ou Langage de balisage hypertexte. On considère sa maîtrise souvent comme acquise ; pourtant c’est loin d’être le cas. Ses 116 balises sont comme les 26 lettres de l’alphabet, la base de notre communication sur le web. Ce n‘est pas pour cette raison que les équipes y apportent un intérêt particulier.\n\n## Structure de documents\n\nLe HTML est le langage à la base du web. Celui interprété par le navigateur. Il permet de rendre un contenu lisible : par des humains, des robots…\n\nIl dit ceci est un titre, ceci est un paragraphe, ceci est une citation… ceci est important, ceci est un contenu connexe…\n\nC'est l’intonation, celle qui permet de hiérarchiser l’information afin d'échanger des pensées complexes à travers un écran.\n\n > Une page Web est un document. Les documents ont une structure. Sur le Web, il ne s’agit pas uniquement des éléments visuels ou de l’architecture fournie par votre infrastructure, il s’agit de choisir des éléments sémantiquement corrects. Les titres doivent être des titres, les listes doivent être des listes, les boutons doivent être des boutons et les tableaux doivent être des tableaux.\n\n## Experts du sens\n\n Comme pour la grammaire, la publication de livre, il existe des spécialistes de la structure des pages web.\n\n > Je suis un type de type «frontend of the frontend». Mon expertise est en HTML et en CSS, alors je peux facilement expliquer pourquoi tout le monde devrait apprendre ce que je sais déjà. Mon travail n’est pas plus important que le vôtre. Si vous écrivez du code qui rend les choses dans un navigateur, c’est votre travail.\n\nSi pour le papier ce métier est reconnu… pour le web pas tellement. On passe par des disciplines comme l’accessibilité pour valoriser cette pratique ; mais sinon, il n’y a aucune offre d’embaûche spécifique en tant que : correcteur de structure documentaire des interfaces, documentaliste de site web,…\n\nPeut-être designer UI me dirait vous, mais celà ne relève pas spécifiquement du sens mais plutôt d’un rôle technique particulier.\n\nUne personne chargée de tout cela n’est pas nécessaire car la compétence peut-être partagée dans l'équipe. La discussion se fera à travers la réalisation d‘un \"design system\". Si tout le monde sait lire et écrire du HTML pas de soucis.\n\nLe problème est que l'expérience montre que savoir lire et écrire du HTML n’est pas acquis. Si vous voulez des sites de qualité, il vous faut cette compétence.\n\nLire [HTML is the Web](https://www.petelambert.com/journal/html-is-the-web/) de Pete Lambert qui explique pourquoi HTML est le web.\n\n" }