{ "id": "/2019/12/11/resilience-systeme-realite", "title": "Vulnérabilité et résilience d’un système - WordPress et l’épuisement", "url": "https://bertrandkeller.info/2019/12/11/resilience-systeme-realite/", "date": 1576018800, "html": "<h2 id=\"comparaison-de-la-rsilience-dans-mon-dernier-billet\">Comparaison de la résilience dans mon dernier billet</h2>\n\n<p><img src=\"/assets/vulnerabilite-resilience.jpg\" alt=\"Résilience site web\"/></p>\n\n<p>On peut observer que si un WordPress est soumis à des altérations alors il y aura une série d’incidences négatives. Seulement, il n’est pas rare qu’un site WordPress tombe pour plein de raisons.</p>\n\n<h2 id=\"comparaison-de-la-rsilience-plus-correcte\">Comparaison de la résilience plus correcte</h2>\n\n<p><img src=\"/assets/vulnerabilite-resilience-epuisement.jpg\" alt=\"Résilience site web\"/></p>\n\n<p>Voici, une comparaison qui pourrait donc être plus juste ; dans la mesure ou entretenir la sécurité d’un site WordPress est un investissement permanent.</p>\n\n<p>WordPress (et les systèmes avec des bases de données) demande des mises à jour permanentes. Si un faille critique est trouvée, il faut vite mettre à jour. Si le site est attaqué, on peut avoir des alertes pour signifier qu’il y a peut-être des actions à mener.</p>\n\n<p>Avec un site statique, on a des inconvénients, mais globalement, il ne peut pas tomber comme ça. Il ne demande pas d’entretien particulier.</p>\n\n<p>Il serait donc peut-être plus juste de faire un type de comparaison correspondant au deuxième schéma.</p>\n", "markdown": "## Comparaison de la résilience dans mon dernier billet\n\n![Résilience site web](/assets/vulnerabilite-resilience.jpg)\n\nOn peut observer que si un WordPress est soumis à des altérations alors il y aura une série d’incidences négatives. Seulement, il n’est pas rare qu’un site WordPress tombe pour plein de raisons.\n\n## Comparaison de la résilience plus correcte\n\n![Résilience site web](/assets/vulnerabilite-resilience-epuisement.jpg)\n\nVoici, une comparaison qui pourrait donc être plus juste ; dans la mesure ou entretenir la sécurité d’un site WordPress est un investissement permanent.\n\nWordPress (et les systèmes avec des bases de données) demande des mises à jour permanentes. Si un faille critique est trouvée, il faut vite mettre à jour. Si le site est attaqué, on peut avoir des alertes pour signifier qu'il y a peut-être des actions à mener.\n\nAvec un site statique, on a des inconvénients, mais globalement, il ne peut pas tomber comme ça. Il ne demande pas d'entretien particulier.\n\nIl serait donc peut-être plus juste de faire un type de comparaison correspondant au deuxième schéma.\n" }