{ "id": "/2019/07/01/eco-conception-web-definition", "title": "L’éco-conception Web", "url": "https://bertrandkeller.info/2019/07/01/eco-conception-web-definition/", "date": 1561932000, "html": "<p>Il y a une pratique qui se rapproche de la <a href=\"/low-tech-site-web-internet/\">Low-Tech</a>, c’est ce qu’on appelle l’éco-conception.</p>\n\n<blockquote>\n <p>L’éco-conception consiste à intégrer la protection de l’environnement dès la conception des biens ou services. Elle a pour objectif de réduire les impacts environnementaux des produits tout au long de leur cycle de vie : extraction des matières premières, production, distribution, utilisation et fin de vie.<br/>\n<a href=\"https://www.ecologique-solidaire.gouv.fr/leco-conception-des-produits\">L’éco-conception des produits</a></p>\n</blockquote>\n\n<h2 id=\"lcologie-dun-site-web-\">L’écologie d’un site web ?</h2>\n\n<p>Personnellement, je ne vois toujours pas comment un site web peut-être éco-conçu. Un site web n’extrait pas vraiment de matière première, il s’agit d’un bien immatériel.<br/>\nC’est une sorte de système d’information qui se sert de réseaux existants pour diffuser de l’information. Je pinaille, certes.</p>\n\n<p>Néanmoins, la réalisation de site web induit l’utilisation et la mise en place de matériels ; la construction de réseaux ; la consommation d’énergie…</p>\n\n<p>Dans l’idéal, il faudrait parler de la manière de réaliser des sites web de façon à rentrer dans une logique d’éco-conception (qui est plus globale).</p>\n\n<h2 id=\"la-manire-dont-cest-diffus\">La manière dont c’est diffusé</h2>\n\n<p>Actuellement, il existe un livre qui comporte de “bonnes pratiques” pour réaliser un site éco-conçus. Si vous tapez éco-conception dans un moteur de recherche, vous allez tomber dessus.</p>\n\n<blockquote>\n <p>Écoconcevoir un site web consiste, à niveau de qualité et de service constant, à réduire la quantité de moyens informatiques et télécoms nécessaires, c’est-à-dire son empreinte matérielle.<br/>\n<strong>Écoconception Web: 115 bonnes pratiques pour doper son site</strong></p>\n</blockquote>\n\n<p>On retrouve dans cette définition le principe de service constant que j’évoquais dans l’article sur la Low-Tech (dans sa comparaison avec les High-Tech). Mais on ne retrouve pas le principe éthique qui est que : si vous voulez mettre en place des services qui ne servent à rien, vous pouvez y aller autant que vous voulez.</p>\n\n<p>Ceci dit ce livre propose une bonne approche en passant en revu l’ensemble des choses qu’on peut faire pour limiter la consommation des machines. C’est assez instructif pour aborder le sujet.</p>\n\n<p>Après c’est quand même plus de la conception économique que de la conception écologique.</p>\n\n<h2 id=\"co-conception-web-un-point-de-vu-trop-technique\">Éco-conception web un point de vu trop technique</h2>\n\n<p>En effet, on peut lire des choses intéressantes sur la manière de concevoir un site (dans ce genre de bouquin). Personnellement, ce sont des choses que j’applique depuis que j’ai appris à coder. Pas forcément pour amour pour des micro planctons mais parce que le code est plus facile à gérer et que les pages sont plus rapides à charger (et on sait que c’est quand même vachement plus agréable pour un utilisateur quand le site poutre sa race).</p>\n\n<p>Quand on aime et qu’on connaît son travail d’intégrateur web, on fait parfois de l’éco-conception sans vraiment le savoir.</p>\n\n<p>Mais du coup, ces problématiques techniques, mon client, les usagers… ils en ont rien à faire ; ils ne comprennent pas grands choses à la manière de minifier un CSS et de gzipper une page.</p>\n\n<p>Si je devais parler d’éco-conception à un client, je crois que je lui dirais que la partie technique ne pose pas de souci, mais c’est plutôt la partie définition du produit qui pèche.</p>\n\n<h2 id=\"co-conception-une-vision-plus-large\">Éco-conception une vision plus large</h2>\n\n<p>J’ai trouvé une petit citation qui me semble pratique pour développer ma pensée.</p>\n\n<blockquote>\n <p>Une remise en question des environnements logiciels peut améliorer l’efficacité de certains systèmes et en même temps engendrer des réductions de coûts substantielles.<br/>\n<a href=\"https://deligraph.com/eco-conception-notre-agence-web-passe-au-vert/\">Eco-conception, notre agence web passe au vert !</a></p>\n</blockquote>\n\n<p>La remise en question des environnements logiciels me semble bien plus importante que tout le reste, dans la mesure où mettre en ligne du contenu consiste souvent à des dizaines, des centaines, voire de milliers de manipulations ; de textes, photos, vidéos, éditeurs, correcteurs,…</p>\n\n<p>Si vous voulez faire baisser votre impact écologique et apporter une meilleure efficience à votre organisation, c’est au niveau des méthodologies de travail et dans votre capacité à mettre en place des outils pour la manipulation et la transformation des données que cela se joue.</p>\n\n<p>Je pense que la web est moyen de faire cette transformation à faible coût en donnant une autonomie maximum à ses partenaires.</p>\n\n<p>L’éco-conception d’un site serait ainsi la transcription de tout ce travail de sobriété traduit dans des pages web efficientes.</p>\n\n<p>Il faut penser global.</p>\n", "markdown": "Il y a une pratique qui se rapproche de la [Low-Tech](/low-tech-site-web-internet/), c'est ce qu'on appelle l’éco-conception.\n\n> L’éco-conception consiste à intégrer la protection de l’environnement dès la conception des biens ou services. Elle a pour objectif de réduire les impacts environnementaux des produits tout au long de leur cycle de vie : extraction des matières premières, production, distribution, utilisation et fin de vie. \n[L’éco-conception des produits](https://www.ecologique-solidaire.gouv.fr/leco-conception-des-produits)\n\n## L’écologie d’un site web ?\n\nPersonnellement, je ne vois toujours pas comment un site web peut-être éco-conçu. Un site web n’extrait pas vraiment de matière première, il s'agit d’un bien immatériel. \nC'est une sorte de système d’information qui se sert de réseaux existants pour diffuser de l’information. Je pinaille, certes.\n\nNéanmoins, la réalisation de site web induit l’utilisation et la mise en place de matériels ; la construction de réseaux ; la consommation d’énergie…\n\nDans l’idéal, il faudrait parler de la manière de réaliser des sites web de façon à rentrer dans une logique d’éco-conception (qui est plus globale).\n\n## La manière dont c’est diffusé\n\nActuellement, il existe un livre qui comporte de \"bonnes pratiques\" pour réaliser un site éco-conçus. Si vous tapez éco-conception dans un moteur de recherche, vous allez tomber dessus.\n\n> Écoconcevoir un site web consiste, à niveau de qualité et de service constant, à réduire la quantité de moyens informatiques et télécoms nécessaires, c’est-à-dire son empreinte matérielle. \n**Écoconception Web: 115 bonnes pratiques pour doper son site**\n\nOn retrouve dans cette définition le principe de service constant que j'évoquais dans l’article sur la Low-Tech (dans sa comparaison avec les High-Tech). Mais on ne retrouve pas le principe éthique qui est que : si vous voulez mettre en place des services qui ne servent à rien, vous pouvez y aller autant que vous voulez.\n\nCeci dit ce livre propose une bonne approche en passant en revu l’ensemble des choses qu’on peut faire pour limiter la consommation des machines. C'est assez instructif pour aborder le sujet.\n\nAprès c’est quand même plus de la conception économique que de la conception écologique.\n\n## Éco-conception web un point de vu trop technique\n\nEn effet, on peut lire des choses intéressantes sur la manière de concevoir un site (dans ce genre de bouquin). Personnellement, ce sont des choses que j'applique depuis que j'ai appris à coder. Pas forcément pour amour pour des micro planctons mais parce que le code est plus facile à gérer et que les pages sont plus rapides à charger (et on sait que c'est quand même vachement plus agréable pour un utilisateur quand le site poutre sa race).\n\nQuand on aime et qu'on connaît son travail d’intégrateur web, on fait parfois de l'éco-conception sans vraiment le savoir.\n\nMais du coup, ces problématiques techniques, mon client, les usagers… ils en ont rien à faire ; ils ne comprennent pas grands choses à la manière de minifier un CSS et de gzipper une page.\n\nSi je devais parler d’éco-conception à un client, je crois que je lui dirais que la partie technique ne pose pas de souci, mais c'est plutôt la partie définition du produit qui pèche.\n\n## Éco-conception une vision plus large\n\nJ'ai trouvé une petit citation qui me semble pratique pour développer ma pensée.\n\n> Une remise en question des environnements logiciels peut améliorer l’efficacité de certains systèmes et en même temps engendrer des réductions de coûts substantielles. \n[Eco-conception, notre agence web passe au vert !](https://deligraph.com/eco-conception-notre-agence-web-passe-au-vert/)\n\nLa remise en question des environnements logiciels me semble bien plus importante que tout le reste, dans la mesure où mettre en ligne du contenu consiste souvent à des dizaines, des centaines, voire de milliers de manipulations ; de textes, photos, vidéos, éditeurs, correcteurs,…\n\nSi vous voulez faire baisser votre impact écologique et apporter une meilleure efficience à votre organisation, c’est au niveau des méthodologies de travail et dans votre capacité à mettre en place des outils pour la manipulation et la transformation des données que cela se joue.\n\nJe pense que la web est moyen de faire cette transformation à faible coût en donnant une autonomie maximum à ses partenaires.\n\nL’éco-conception d’un site serait ainsi la transcription de tout ce travail de sobriété traduit dans des pages web efficientes.\n\nIl faut penser global.\n" }