{ "id": "/2019/06/25/low-tech-concept-positif", "title": "La Low-Tech, concept positif", "url": "https://bertrandkeller.info/2019/06/25/low-tech-concept-positif/", "date": 1561413600, "html": "<p>Dans le précédent billet, nous avons discuté de ce qui pouvait se cacher derrière le terme de Low-Tech (<a href=\"/2019/06/24/table-low-tech/\">Les tables de la Low (Tech)</a>). Essayons de creuser un peu pour savoir si on peut dégager un sens commun au terme.</p>\n\n<p>Je suis en train de veiller de manière attentive l’utilisation du mot Low-Tech. Il semble que nous avons un mouvement de plus en plus important de personnes qui se lancent dans une démarche d’urgence (climatique). Le terme remonte fréquemment mais n’est pas forcément utilisé par tous pour désigner la même chose.</p>\n\n<h2 id=\"la-low-tech-comme-technologie-dgrade\">La Low-Tech comme technologie dégradée</h2>\n\n<p>La manière la plus commune de l’utiliser est de dire : j’avais un tableau avec des tâches sur un logiciel en ligne ; j’ai utilisé des post-its sur un tableau blanc =&gt; #lowtech.</p>\n\n<p>C’est-à-dire, je réalise la même activité mais en utilisant un moyen qui ne fait pas appel au numérique (schématiquement).</p>\n\n<p>Sauf que dans ce cas, si le tableau permet à des personnes de partager ces mêmes tâches en ligne parce que les membres de l’équipe travaillent à distance. C’est Low-Tech, Ok ; mais on perd un usage qui est de partager les tâches à distance. Bien évidemment, si toutes les personnes travaillent dans le même bureau, l’utilisation de Post-its est moins lourde en consommation de matière et d’énergie que le tableau de tâches en ligne.</p>\n\n<p>Mais on perd un usage. Le concept de Low-Tech est réalisé avec l’utilisation d’une technologie dégradée mais avec aussi l’acceptation d’une perte d’usage (qui pour le coup est potentiellement fondamentale au groupe).</p>\n\n<h2 id=\"lhomme-est-la-nature\">L’homme est la nature</h2>\n\n<p>Dans l’article (<a href=\"/2019/06/24/table-low-tech/\">Les tables de la Low (Tech)</a>), j’ai repris la définition donnée par le <a href=\"https://lowtechlab.org\">Low-Tech Lab</a>, pour la questionner. Je n’ai pas vu dans la définition, de notion de perte d’usage. On parle d’utilité, d’accessibilité, de durabilité ; c’est-à-dire un concept de but mais pas de perte d’usage sous prétexte que ça consomme moins d’énergie.</p>\n\n<p>Si je prends le temps de développer tout cela, c’est parce qu’il y a toujours moyen de dire qu’une technologie consomme trop ; qu’il y a plus Low-Tech que la Low-Tech (la Low-Low-Tech ou la Slow-Low-Tech peut-être). Il y a toujours moyen d’avoir encore moins d’impact.</p>\n\n<p>Sauf que l’homme transforme la nature de par son existence. Il n’y a pas moyen d’avoir un impact nul sur la nature et de ne faire souffrir aucun être vivant. Donc ce petit jeu n’a pas de sens.</p>\n\n<p>Je dis ça parce que je discute de la notion de Low-Tech appliquée au web, alors que quand on réfléchit, le meilleur moyen de préserver l’environnement est de ne pas faire de site web. Il convient de dérouler la pelote, mais globalement un disque dur ou un circuit imprimé, c’est pas cool pour les petits poissons.</p>\n\n<h2 id=\"high-tech-vs-low-tech\">High-Tech Vs Low-Tech</h2>\n\n<p>Qu’est-ce qu’on doit donc comprendre ? Et bien, qu’on utilise aussi le terme Low-Tech en opposition à la High Tech.</p>\n\n<h3 id=\"high-tech\">High-Tech</h3>\n\n<blockquote>\n <p>Les techniques de pointe aussi connues sous l’anglicisme high-tech, sont des techniques considérées comme les plus avancées à une époque donnée. Faiblement employé avant les années 1970, l’usage de cette notion est partiale et cette définition permet aujourd‘hui aux départements marketing de décrire tous les nouveaux produits comme de la high-tech.\n<strong><a href=\"https://fr.wikipedia.org/wiki/Techniques_de_pointe\">Techniques de pointe</a></strong></p>\n</blockquote>\n\n<p>Whaouh. Wikipédia pose déjà que le Low-Tech est un contre concept marketing pour contrer le concept marketing de High-Tech.</p>\n\n<p>La High-Tech en étant une technique de pointe est considérée comme transformant (potentiellement) un domaine ou même la société dans son ensemble (c’est souvent son objectif). On parle pour être cool de disruption. Sauf que, ce qu’on remarque c‘est qu’en créant de nouveaux usages, on en détruit d’autres. Et que pendant que ça change, on découvre au fil du temps les méfaits (inhérents à toutes les nouvelles techniques de pointe).</p>\n\n<p>La High-Tech provoque un état instable de nos sociétés. Même si elle fait espérer du mieux dans un futur plus ou moins lointain, elle provoque de la destruction.</p>\n\n<p>C‘est cette destruction qui rend nos sociétés folles.</p>\n\n<h3 id=\"low-tech\">Low-Tech</h3>\n\n<p>Low-Tech n’est pas censée désigner des technologies simplistes ou non numériques, mais plutôt des technologies qui ne détruisent pas les structures sociales et qui préservent les hommes et l’environnement des hommes.</p>\n\n<blockquote>\n <p>les techniques de pointe - en particulier les technologies dites « vertes » - sont souvent présentées comme pouvant générer facilement de la croissance et être de la sorte une solution à la crise, alors qu’elles possèdent - selon eux - des inconvénients notables, comme la consommation de ressources rares.\n<strong><a href=\"https://fr.wikipedia.org/wiki/Techniques_de_pointe\">Techniques de pointe</a></strong></p>\n</blockquote>\n\n<p>Elles sont donc en opposition avec les High-Tech qui nous promettent des lendemains qui chantent en pillant les ressources. Les Low-Tech posent la question de la soutenabilité et vont même encore plus loin car elles se soucient de questions politiques en favorisant une plus grande autonomie des populations, ainsi qu’une meilleure répartition de la valeur travail.</p>\n\n<h2 id=\"pour-le-bien-\">Pour le bien ?</h2>\n\n<p>L’utilisation du terme Low-Tech sur ce blog englobera ce principe de “préservation” selon les Tables de la Low définies par le <a href=\"https://lowtechlab.org\">Low-Tech Lab</a>.</p>\n\n<p>Certaines personnes attendent, peut-être, que je liste des solutions techniques qu’on pourrait appeler Low-Tech ; je peux le faire ; mais ce n’est mon objectif unique. Je ne cherche pas à répondre à la logique du moindre mal.</p>\n\n<p>Si les Low-Tech sont prises dans le sens d’utilité/accessibilité/durabilité, si je parle de web et de solutions techniques, je dois essayer de voir comment elles peuvent garantir une sorte de bien et/ou éviter le mal (non nécessaire) que nous apportent les High-Tech.</p>\n", "markdown": "Dans le précédent billet, nous avons discuté de ce qui pouvait se cacher derrière le terme de Low-Tech ([Les tables de la Low (Tech)](/2019/06/24/table-low-tech/)). Essayons de creuser un peu pour savoir si on peut dégager un sens commun au terme.\n\nJe suis en train de veiller de manière attentive l’utilisation du mot Low-Tech. Il semble que nous avons un mouvement de plus en plus important de personnes qui se lancent dans une démarche d’urgence (climatique). Le terme remonte fréquemment mais n’est pas forcément utilisé par tous pour désigner la même chose.\n\n## La Low-Tech comme technologie dégradée\n\nLa manière la plus commune de l’utiliser est de dire : j'avais un tableau avec des tâches sur un logiciel en ligne ; j’ai utilisé des post-its sur un tableau blanc=> #lowtech.\n\nC'est-à-dire, je réalise la même activité mais en utilisant un moyen qui ne fait pas appel au numérique (schématiquement).\n\nSauf que dans ce cas, si le tableau permet à des personnes de partager ces mêmes tâches en ligne parce que les membres de l'équipe travaillent à distance. C’est Low-Tech, Ok ; mais on perd un usage qui est de partager les tâches à distance. Bien évidemment, si toutes les personnes travaillent dans le même bureau, l’utilisation de Post-its est moins lourde en consommation de matière et d’énergie que le tableau de tâches en ligne.\n\nMais on perd un usage. Le concept de Low-Tech est réalisé avec l’utilisation d’une technologie dégradée mais avec aussi l’acceptation d’une perte d’usage (qui pour le coup est potentiellement fondamentale au groupe).\n\n## L’homme est la nature\n\nDans l’article ([Les tables de la Low (Tech)](/2019/06/24/table-low-tech/)), j’ai repris la définition donnée par le [Low-Tech Lab](https://lowtechlab.org), pour la questionner. Je n’ai pas vu dans la définition, de notion de perte d’usage. On parle d’utilité, d’accessibilité, de durabilité ; c'est-à-dire un concept de but mais pas de perte d’usage sous prétexte que ça consomme moins d’énergie.\n\nSi je prends le temps de développer tout cela, c'est parce qu’il y a toujours moyen de dire qu’une technologie consomme trop ; qu’il y a plus Low-Tech que la Low-Tech (la Low-Low-Tech ou la Slow-Low-Tech peut-être). Il y a toujours moyen d’avoir encore moins d’impact.\n\nSauf que l’homme transforme la nature de par son existence. Il n'y a pas moyen d'avoir un impact nul sur la nature et de ne faire souffrir aucun être vivant. Donc ce petit jeu n’a pas de sens.\n\nJe dis ça parce que je discute de la notion de Low-Tech appliquée au web, alors que quand on réfléchit, le meilleur moyen de préserver l’environnement est de ne pas faire de site web. Il convient de dérouler la pelote, mais globalement un disque dur ou un circuit imprimé, c’est pas cool pour les petits poissons.\n\n## High-Tech Vs Low-Tech\n\nQu'est-ce qu'on doit donc comprendre ? Et bien, qu’on utilise aussi le terme Low-Tech en opposition à la High Tech.\n\n### High-Tech\n\n> Les techniques de pointe aussi connues sous l'anglicisme high-tech, sont des techniques considérées comme les plus avancées à une époque donnée. Faiblement employé avant les années 1970, l’usage de cette notion est partiale et cette définition permet aujourd‘hui aux départements marketing de décrire tous les nouveaux produits comme de la high-tech.\n> **[Techniques de pointe](https://fr.wikipedia.org/wiki/Techniques_de_pointe)**\n\nWhaouh. Wikipédia pose déjà que le Low-Tech est un contre concept marketing pour contrer le concept marketing de High-Tech.\n\nLa High-Tech en étant une technique de pointe est considérée comme transformant (potentiellement) un domaine ou même la société dans son ensemble (c’est souvent son objectif). On parle pour être cool de disruption. Sauf que, ce qu'on remarque c‘est qu’en créant de nouveaux usages, on en détruit d’autres. Et que pendant que ça change, on découvre au fil du temps les méfaits (inhérents à toutes les nouvelles techniques de pointe).\n\nLa High-Tech provoque un état instable de nos sociétés. Même si elle fait espérer du mieux dans un futur plus ou moins lointain, elle provoque de la destruction.\n\nC‘est cette destruction qui rend nos sociétés folles.\n\n### Low-Tech\n\nLow-Tech n’est pas censée désigner des technologies simplistes ou non numériques, mais plutôt des technologies qui ne détruisent pas les structures sociales et qui préservent les hommes et l’environnement des hommes.\n\n> les techniques de pointe - en particulier les technologies dites « vertes » - sont souvent présentées comme pouvant générer facilement de la croissance et être de la sorte une solution à la crise, alors qu'elles possèdent - selon eux - des inconvénients notables, comme la consommation de ressources rares.\n> **[Techniques de pointe](https://fr.wikipedia.org/wiki/Techniques_de_pointe)**\n\nElles sont donc en opposition avec les High-Tech qui nous promettent des lendemains qui chantent en pillant les ressources. Les Low-Tech posent la question de la soutenabilité et vont même encore plus loin car elles se soucient de questions politiques en favorisant une plus grande autonomie des populations, ainsi qu'une meilleure répartition de la valeur travail.\n\n## Pour le bien ?\n\nL’utilisation du terme Low-Tech sur ce blog englobera ce principe de \"préservation\" selon les Tables de la Low définies par le [Low-Tech Lab](https://lowtechlab.org).\n\nCertaines personnes attendent, peut-être, que je liste des solutions techniques qu’on pourrait appeler Low-Tech ; je peux le faire ; mais ce n’est mon objectif unique. Je ne cherche pas à répondre à la logique du moindre mal.\n\nSi les Low-Tech sont prises dans le sens d’utilité/accessibilité/durabilité, si je parle de web et de solutions techniques, je dois essayer de voir comment elles peuvent garantir une sorte de bien et/ou éviter le mal (non nécessaire) que nous apportent les High-Tech.\n" }