{ "id": "/2019/04/04/la-site-conference-plus-rapide-monde", "title": "Sud Web - Le site de conférence le plus rapide du monde", "url": "https://bertrandkeller.info/2019/04/04/la-site-conference-plus-rapide-monde/", "date": 1554328800, "html": "<p>Peut-être avez-vous vu ce billet de Malte Ubl : <a href=\"https://2019.jsconf.eu/news/how-we-built-the-fastest-conference-website-in-the-world/\">How we built the fastest conference website in the world</a> (comment mettre en ligne le site le plus rapide du monde) ? Le texte est très intéressant mais le titre est mensongé car <a href=\"https://2019.jsconf.eu\">https://2019.jsconf.eu</a> n’est pas le site le plus rapide du monde.</p>\n\n<p><em>Malte Ubl thinks he produced the fastest conference website in the world in the world, but he doesn’t the Sud Web conference</em></p>\n\n<p>Je tenais à faire ce billet ; j’organise la conférence Sud Web et on entend parfois (de loin) des railleries disant que Sud Web n’est pas une conférence technique. C’est vrai quand on regarde le programme (et encore quand on le survole), on ne présente pas de sujets en mode “c’est moi qui ai la plus grosse” (comme aux states).</p>\n\n<p>Et pourtant, ceux qui sont venus et viendront à Sud Web savent que nos orateurs et notre public sont constitués de gens doués. Personnellement, je ne sais pas si je suis doué, mais c’est bien moi ai la plus grosse.</p>\n\n<h2 id=\"the-fastest\">The fastest</h2>\n\n<p><img src=\"/assets/performance-sudweb-jsconf.png\" alt=\"Le site de conférence le plus rapide du monde\"/></p>\n\n<p>Si nous comparons la courbe de rafraichissement des 2 sites, pour un test réalisé avec des serveurs hébergés en France, le site de Sud Web éclate grave le site de le JSConf.</p>\n\n<p><em>The test was made from France (server ip test) with <a href=\"https://www.dareboost.com/en/comparison\">Dareboost compare tools</a>. Sud Web website is not the real fastest website in the world because we decided to keep a french hosting with our Friends of <a href=\"https://www.alwaysdata.com/\">Alwaysdata</a>.</em></p>\n\n<h3 id=\"loadtime\">LoadTime</h3>\n\n<p><img src=\"/assets/performance-sudweb-jsconf-loadtime.png\" alt=\"Le site de conférence le plus rapide du monde\"/></p>\n\n<p>Notre hébergement n’est pas le meilleur, mais en ce qui concerne le chargement, je crois que les courbes parlent d’elles même. A 750 ms, Sud Web est chargé à 100% ; alors que JSConf charge encore pas mal d’images grand format.</p>\n\n<h3 id=\"weight-by-resources-type\">Weight by resources type</h3>\n\n<p><img src=\"/assets/perfomance-sudweb-jsconf-weight.png\" alt=\"Le site de conférence le plus rapide du monde\"/></p>\n\n<p>Où se situe la différence ? Pour écrire cet article et me la péter, j’ai appliqué du lazyloading sans mettre d’image par défaut dans ma balise <code>&lt;img&gt;</code>. C’est pas très correct, mais l’image n’est qu’une illustration, elle n’est pas indispensable. Néanmoins, elles sont plus légères, suffisamment grandes pour une bonne compréhension de la page.</p>\n\n<p>Mais si on enlève les images, j’ai moins de scripts, moins de CSS et un peu de “other” avec un bon gros SVG. (Merci Matthieu Bué alias @twikito).</p>\n\n<h3 id=\"and-the-winner-is\">And the winner is</h3>\n\n<p>Pour consulter le rapport complet : <a href=\"https://www.dareboost.com/en/comparison/d_5ca60429e967904c6f32e56c/d_5ca60429e967904c6f32e56e/\">Web Quality and Performance Comparison : JSConf Vs Sud Web</a>.</p>\n\n<p>Vous aurez la preuve que Sud Web est une conférence qui promeut des valeurs pour un web respectueux, certes, mais qui est en capacité de faire de la mise en pratique.</p>\n\n<p>Cet article est évidemment ridicule, il n’a pas pour fonction d’affirmer qui serait le meilleur pour le chargement d’une page web car cela dépend de beaucoup de paramètres. En revanche, il essaye de montrer que le plus rapide n’est pas qui veut.</p>\n\n<p>Que le monde du web est submergé de Framework JS, de nouveautés JS… que chacun essaye de suivre ce mouvement. Mais que l’efficience se construit ailleurs que dans les outils, elle tient parfois à d’autres choses.</p>\n\n<p>Mais avez-vous envie de les développer ?</p>\n\n", "markdown": "Peut-être avez-vous vu ce billet de Malte Ubl : [How we built the fastest conference website in the world](https://2019.jsconf.eu/news/how-we-built-the-fastest-conference-website-in-the-world/) (comment mettre en ligne le site le plus rapide du monde) ? Le texte est très intéressant mais le titre est mensongé car [https://2019.jsconf.eu](https://2019.jsconf.eu) n’est pas le site le plus rapide du monde.\n\n*Malte Ubl thinks he produced the fastest conference website in the world in the world, but he doesn't the Sud Web conference*\n\nJe tenais à faire ce billet ; j'organise la conférence Sud Web et on entend parfois (de loin) des railleries disant que Sud Web n'est pas une conférence technique. C’est vrai quand on regarde le programme (et encore quand on le survole), on ne présente pas de sujets en mode \"c’est moi qui ai la plus grosse\" (comme aux states).\n\nEt pourtant, ceux qui sont venus et viendront à Sud Web savent que nos orateurs et notre public sont constitués de gens doués. Personnellement, je ne sais pas si je suis doué, mais c'est bien moi ai la plus grosse.\n\n## The fastest\n\n![Le site de conférence le plus rapide du monde](/assets/performance-sudweb-jsconf.png)\n\nSi nous comparons la courbe de rafraichissement des 2 sites, pour un test réalisé avec des serveurs hébergés en France, le site de Sud Web éclate grave le site de le JSConf.\n\n*The test was made from France (server ip test) with [Dareboost compare tools](https://www.dareboost.com/en/comparison). Sud Web website is not the real fastest website in the world because we decided to keep a french hosting with our Friends of [Alwaysdata](https://www.alwaysdata.com/).*\n\n### LoadTime\n\n![Le site de conférence le plus rapide du monde](/assets/performance-sudweb-jsconf-loadtime.png)\n\nNotre hébergement n’est pas le meilleur, mais en ce qui concerne le chargement, je crois que les courbes parlent d’elles même. A 750 ms, Sud Web est chargé à 100% ; alors que JSConf charge encore pas mal d’images grand format.\n\n### Weight by resources type\n\n![Le site de conférence le plus rapide du monde](/assets/perfomance-sudweb-jsconf-weight.png)\n\nOù se situe la différence ? Pour écrire cet article et me la péter, j'ai appliqué du lazyloading sans mettre d’image par défaut dans ma balise `<img>`. C'est pas très correct, mais l’image n'est qu'une illustration, elle n'est pas indispensable. Néanmoins, elles sont plus légères, suffisamment grandes pour une bonne compréhension de la page.\n\nMais si on enlève les images, j’ai moins de scripts, moins de CSS et un peu de \"other\" avec un bon gros SVG. (Merci Matthieu Bué alias @twikito).\n\n### And the winner is \n\nPour consulter le rapport complet : [Web Quality and Performance Comparison : JSConf Vs Sud Web](https://www.dareboost.com/en/comparison/d_5ca60429e967904c6f32e56c/d_5ca60429e967904c6f32e56e/).\n\nVous aurez la preuve que Sud Web est une conférence qui promeut des valeurs pour un web respectueux, certes, mais qui est en capacité de faire de la mise en pratique.\n\nCet article est évidemment ridicule, il n'a pas pour fonction d'affirmer qui serait le meilleur pour le chargement d’une page web car cela dépend de beaucoup de paramètres. En revanche, il essaye de montrer que le plus rapide n’est pas qui veut.\n\nQue le monde du web est submergé de Framework JS, de nouveautés JS… que chacun essaye de suivre ce mouvement. Mais que l’efficience se construit ailleurs que dans les outils, elle tient parfois à d'autres choses.\n\nMais avez-vous envie de les développer ?\n\n\n" }