{ "id": "/2017/12/14/la-lubie-securitaire", "title": "La lubie sécuritaire", "url": "https://bertrandkeller.info/2017/12/14/la-lubie-securitaire/", "date": 1513206000, "html": "<p>Présent à une conférence sur la sécurité, <a href=\"https://www.netsecure-day.fr/\">Netsecure Day</a>, à Rouen. Je fais le tour des hackers adeptes des <a href=\"https://fr.wikipedia.org/wiki/Bug_bounty\">bugs bounties</a>, solutions d’identification et description de la RGPD.</p>\n\n<h2 id=\"les-failles\">Les failles</h2>\n\n<p>Le sujet est très intéressant car il y a de grand enjeux sur la sécurité. En tant qu’utilisateurs, nous sommes nombreux à nous connecter à divers services au quotidien.</p>\n\n<p>On ne s’en doute pas toujours, mais beaucoup d’entre nous utilisent des mots de passe similaires sur différents sites. Imaginons qu’un de ces sites se fasse hacker, alors il sera possible de tester votre “login/mot de passe” sur un autre site (bancaire par exemple).</p>\n\n<h2 id=\"la-scurit\">La sécurité</h2>\n\n<p>Imaginons maintenant qu’une personne utilise un mot de passe similaire sur un service grand public et un simple blog avec base de données, installé sur un serveur de votre entreprise (WordPress par exemple).</p>\n\n<p>Les cas sont multiples, mais on peut imaginer que suite à la récupération des codes sur le site grand public, l’intrusion sur ce blog entreprise avec connexion est possible. Et donc qu’une personne puisse se servir de ce blog pour pirater des données de l’entreprise. <em>D’ailleurs, j’ai découvert aujourd’hui que les éditeurs de texte possédaient des <a href=\"https://github.com/tinymce/tinymce/issues/3118\">faille XSS</a></em>.</p>\n\n<h2 id=\"se-protger\">Se protéger</h2>\n\n<p>Dans les conférences sur la sécurité, on va vous aiguiller vers des solutions pour protéger les connexions ; vous évoquer les plans à mettre en place pour former l’ensemble de vos collaborateurs…</p>\n\n<p>Le problème c’est que vous n’avez pas forcément les épaules, les temps, la taille critique et les compétences pour traiter ce problème de front.</p>\n\n<p>Il existe pourtant une solution simple pour éviter d’être exposé aux problèmes de sécurité : utiliser <a href=\"/generateur-site-statique/\">générateurs de site statique</a>. Vous pouvez le faire quelque soit la taille de vos organisations.</p>\n\n<p>En effet, utiliser des pages statiques pour servir un site web limite énormément les possibilités d’intrusion de votre service. De plus, utiliser cette technologie baisse le temps et donc le coût de gestion de ces pages.</p>\n\n<p>Ainsi, à l’heure des possibilités de pertes de données à grande échelle, d’exposition à des malwares et autres arnaques. L’utilisation de sites statiques est la solution.</p>\n", "markdown": "Présent à une conférence sur la sécurité, [Netsecure Day](https://www.netsecure-day.fr/), à Rouen. Je fais le tour des hackers adeptes des [bugs bounties](https://fr.wikipedia.org/wiki/Bug_bounty), solutions d'identification et description de la RGPD.\n\n## Les failles\n\nLe sujet est très intéressant car il y a de grand enjeux sur la sécurité. En tant qu'utilisateurs, nous sommes nombreux à nous connecter à divers services au quotidien.\n\nOn ne s'en doute pas toujours, mais beaucoup d'entre nous utilisent des mots de passe similaires sur différents sites. Imaginons qu'un de ces sites se fasse hacker, alors il sera possible de tester votre \"login/mot de passe\" sur un autre site (bancaire par exemple).\n\n## La sécurité\n\nImaginons maintenant qu'une personne utilise un mot de passe similaire sur un service grand public et un simple blog avec base de données, installé sur un serveur de votre entreprise (WordPress par exemple).\n\nLes cas sont multiples, mais on peut imaginer que suite à la récupération des codes sur le site grand public, l'intrusion sur ce blog entreprise avec connexion est possible. Et donc qu'une personne puisse se servir de ce blog pour pirater des données de l’entreprise. *D'ailleurs, j'ai découvert aujourd'hui que les éditeurs de texte possédaient des [faille XSS](https://github.com/tinymce/tinymce/issues/3118)*.\n\n## Se protéger\n\nDans les conférences sur la sécurité, on va vous aiguiller vers des solutions pour protéger les connexions ; vous évoquer les plans à mettre en place pour former l'ensemble de vos collaborateurs…\n\nLe problème c'est que vous n'avez pas forcément les épaules, les temps, la taille critique et les compétences pour traiter ce problème de front.\n\nIl existe pourtant une solution simple pour éviter d'être exposé aux problèmes de sécurité : utiliser [générateurs de site statique](/generateur-site-statique/). Vous pouvez le faire quelque soit la taille de vos organisations.\n\nEn effet, utiliser des pages statiques pour servir un site web limite énormément les possibilités d'intrusion de votre service. De plus, utiliser cette technologie baisse le temps et donc le coût de gestion de ces pages.\n\nAinsi, à l'heure des possibilités de pertes de données à grande échelle, d'exposition à des malwares et autres arnaques. L'utilisation de sites statiques est la solution.\n" }