{ "id": "/2016/06/29/programme-jacques-ellul", "title": "Le programme de Jacques Ellul", "url": "https://bertrandkeller.info/2016/06/29/programme-jacques-ellul/", "date": 1467151200, "html": "<p>Pour Ellul la technique n’obéit à aucune finalité.</p>\n\n<blockquote>\n <p>La technique ne poursuit pas un but, avoué ou non, mais elle évolue de façon purement causale : la combinaison des éléments précédents fournit les nouveaux éléments techniques. Aucune vue, aucun plan ne se réalisent progressivement.</p>\n</blockquote>\n\n<p>En d’autres termes, on navigue à vue. Notre vie tourne autour du maintien, de l’évolution de la technique et pas autour de l’humain.</p>\n\n<p>Pour sortir de cette sacralisation de la technique, Jacques Ellul propose un programme en 5 points :</p>\n\n<ol>\n <li>Une reconversion totale de la puissance productive du monde occidentale par une aide massive et inconditionnelle au Tiers-Monde ;</li>\n <li>le choix délibéré de la non-puissance, bien évidemment dans sa composante militaire mais également par “la suppression radicale de l’État centralisé bureaucratique” ;</li>\n <li>“l’éclatement et la diversification” dans tous les domaines, les modes d’action sociale, les unités administratives, agricoles et industrielles, les moyens d’information et de communication, la création culturelle ;</li>\n <li>“la réduction drastique du temps de travail”;</li>\n <li>la construction d’un système socio-économique dual (rf André Gorz)</li>\n</ol>\n\n<p>Je vous laisse méditer ces propositions.</p>\n", "markdown": "Pour Ellul la technique n'obéit à aucune finalité.\n\n> La technique ne poursuit pas un but, avoué ou non, mais elle évolue de façon purement causale : la combinaison des éléments précédents fournit les nouveaux éléments techniques. Aucune vue, aucun plan ne se réalisent progressivement.\n\nEn d'autres termes, on navigue à vue. Notre vie tourne autour du maintien, de l'évolution de la technique et pas autour de l'humain.\n\nPour sortir de cette sacralisation de la technique, Jacques Ellul propose un programme en 5 points :\n\n 1. Une reconversion totale de la puissance productive du monde occidentale par une aide massive et inconditionnelle au Tiers-Monde ;\n 2. le choix délibéré de la non-puissance, bien évidemment dans sa composante militaire mais également par \"la suppression radicale de l'État centralisé bureaucratique\" ;\n 3. \"l'éclatement et la diversification\" dans tous les domaines, les modes d'action sociale, les unités administratives, agricoles et industrielles, les moyens d'information et de communication, la création culturelle ;\n 4. \"la réduction drastique du temps de travail\";\n 5. la construction d'un système socio-économique dual (rf André Gorz)\n \n Je vous laisse méditer ces propositions.\n" }