{ "id": "/2019/05/15/web-responsabilite", "title": "Ce que nous détruisons, notre responsabilité ?", "url": "https://bertrandkeller.info/2019/05/15/web-responsabilite/", "date": 1557871200, "html": "<p>Cette question de notre responsabilité de mettre en place des sites dit de qualité n’est pas nouvelle. Des conférences comme Paris-Web a réuni et continue de réunir un public de personnes soucieuses qu‘un site respecte des principes d’accessibilité, de lisibilité, de performance… Pourtant, malgré ces initiatives, la tendance semble encore aller de plus en plus vers la destruction de cet espace de partage.</p>\n\n<h2 id=\"tu-nas-certainement-pas-besoin-de-ce-framework--la-mode\">Tu n’as certainement pas besoin de ce Framework à la mode</h2>\n\n<p>Dans cet article écrite par Owen Williams, <a href=\"https://char.gd/blog/2019/you-dont-need-that-hipster-web-framework\">You probably don’t need that hip web framework</a>, on peut lire :</p>\n\n<blockquote>\n <p>J’ai expérimenté Vue, React, GraphQL, Docker, et d’autres différents outils. Au lieu de devenir plus productif, je me suis retrouvé dans une boucle d’apprentissage sans fin couplée à l’enfer de la dépendance.</p>\n</blockquote>\n\n<p>Ce n’est pas faux, ces différents outils sont bien pratiques. Ils évitent de recoder des fonctions à partir de rien et permettent de profiter d’une certaine stabilité tout en ayant du code “morderne”. Cependant, une fois qu’on a investit dans un outil, il est difficile d’en sortir.</p>\n\n<blockquote>\n <p>Dans notre quête de quelque chose de plus moderne, nous avons créé un fouillis d’outils pour les développeurs et gâché l’expérience de galérer sur une nouvelle idée.</p>\n</blockquote>\n\n<p>En gros, on passe plus de temps à maintenir un outil, qu’à se soucier vraiment de savoir à quoi il peut nous servir ou ce qu’on veut en faire.</p>\n\n<h2 id=\"nous-dtruisons-activement-le-web\">Nous détruisons activement le Web</h2>\n\n<p>Dans cet article écrite par Chris Ferdinandi, <a href=\"https://gomakethings.com/we-are-actively-destroying-the-web/\">We are actively destroying the web </a>, nous trouvons une citation d’Ethan Marcotte :</p>\n\n<blockquote>\n <p>Les pages contenant des frameworks JavaScript populaires étaient plus susceptibles d’avoir des erreurs d’accessibilité que celles qui n’utilisaient pas ces frameworks.</p>\n</blockquote>\n\n<p>Mince alors, en fait quand il y avait une division du travail entre les développeurs et les intégrateurs ; c’est-à-dire quand on laissez les spécialistes du code HTML s’en occuper ; on avait du code pas trop mauvais (Ça s’est une supposition de ma part).</p>\n\n<p>Mais à partir du moment où on a filé la responsabilité du code HTML à des développeurs JavaScript c’est encore un peu plus parti en sucette. Non pas que ces personnes soient de mauvais codeurs, mais surtout qu’elles doivent passer plus de temps à maintenir leur base de code que de se soucier de l’accessibilité de leurs pages.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Sommes-nous en train de détruire le web ? Ou plutôt sommes-nous en train de détruire notre monde tout simplement ?</p>\n\n<p>Quel est le problème soulevé ? Que le modèle Start-up, qui essaye d’obtenir un monopole le plus rapidement possible pour pouvoir taxer les gens de manière exagérée, n’est pas terrible mais en plus ne fonctionne plus vraiment.</p>\n\n<p>Dans cette course effrénée, on continue de vouloir construire des systèmes (armes ?) plus complètes, plus performantes que son voisin. La question du bien social, de l’accessibilité n’est pas éludée, elle est complètement secondaire.</p>\n\n<p>Les développeurs même avec la plus grande volonté vont suivre cette course, car, comme certains le disent : sinon je perds mon travail.</p>\n\n<p>Nous allons parfois au plus simple, au plus évident, mais à quel prix ?</p>\n\n<p>Est-ce là notre volonté ?</p>\n", "markdown": "Cette question de notre responsabilité de mettre en place des sites dit de qualité n’est pas nouvelle. Des conférences comme Paris-Web a réuni et continue de réunir un public de personnes soucieuses qu‘un site respecte des principes d’accessibilité, de lisibilité, de performance… Pourtant, malgré ces initiatives, la tendance semble encore aller de plus en plus vers la destruction de cet espace de partage.\n\n## Tu n’as certainement pas besoin de ce Framework à la mode\n\nDans cet article écrite par Owen Williams, [You probably don't need that hip web framework](https://char.gd/blog/2019/you-dont-need-that-hipster-web-framework), on peut lire : \n\n> J’ai expérimenté Vue, React, GraphQL, Docker, et d’autres différents outils. Au lieu de devenir plus productif, je me suis retrouvé dans une boucle d'apprentissage sans fin couplée à l'enfer de la dépendance.\n\nCe n’est pas faux, ces différents outils sont bien pratiques. Ils évitent de recoder des fonctions à partir de rien et permettent de profiter d’une certaine stabilité tout en ayant du code \"morderne\". Cependant, une fois qu’on a investit dans un outil, il est difficile d’en sortir.\n\n> Dans notre quête de quelque chose de plus moderne, nous avons créé un fouillis d’outils pour les développeurs et gâché l’expérience de galérer sur une nouvelle idée.\n\nEn gros, on passe plus de temps à maintenir un outil, qu’à se soucier vraiment de savoir à quoi il peut nous servir ou ce qu'on veut en faire.\n\n## Nous détruisons activement le Web\n\nDans cet article écrite par Chris Ferdinandi, [We are actively destroying the web ](https://gomakethings.com/we-are-actively-destroying-the-web/), nous trouvons une citation d’Ethan Marcotte : \n\n> Les pages contenant des frameworks JavaScript populaires étaient plus susceptibles d’avoir des erreurs d’accessibilité que celles qui n’utilisaient pas ces frameworks.\n\nMince alors, en fait quand il y avait une division du travail entre les développeurs et les intégrateurs ; c’est-à-dire quand on laissez les spécialistes du code HTML s'en occuper ; on avait du code pas trop mauvais (Ça s’est une supposition de ma part).\n\nMais à partir du moment où on a filé la responsabilité du code HTML à des développeurs JavaScript c’est encore un peu plus parti en sucette. Non pas que ces personnes soient de mauvais codeurs, mais surtout qu’elles doivent passer plus de temps à maintenir leur base de code que de se soucier de l’accessibilité de leurs pages.\n\n## Conclusion\n\nSommes-nous en train de détruire le web ? Ou plutôt sommes-nous en train de détruire notre monde tout simplement ?\n\nQuel est le problème soulevé ? Que le modèle Start-up, qui essaye d’obtenir un monopole le plus rapidement possible pour pouvoir taxer les gens de manière exagérée, n’est pas terrible mais en plus ne fonctionne plus vraiment.\n\nDans cette course effrénée, on continue de vouloir construire des systèmes (armes ?) plus complètes, plus performantes que son voisin. La question du bien social, de l'accessibilité n’est pas éludée, elle est complètement secondaire.\n\nLes développeurs même avec la plus grande volonté vont suivre cette course, car, comme certains le disent : sinon je perds mon travail.\n\nNous allons parfois au plus simple, au plus évident, mais à quel prix ?\n\nEst-ce là notre volonté ?\n" }