{ "id": "/2017/10/13/git-based-api-driven-cms", "title": "Git-based ou API-driven CMS", "url": "https://bertrandkeller.info/2017/10/13/git-based-api-driven-cms/", "date": 1507845600, "html": "<p>Conférence de Chris Macrae de <a href=\"http://forestry.io\">forestry.io</a> qui tente bien de vendre le principe des <a href=\"/generateur-site-statique/\">générateurs de site statique</a> afin de valoriser son produit.</p>\n\n<div class=\"aspectratio\" data-ratio=\"16/9\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/KX4G49ZrvY0?rel=0\" frameborder=\"0\" allowfullscreen=\"\"></iframe></div>\n\n<h2 id=\"forestry\">Forestry</h2>\n\n<p>Chris Macrae est cofondateur de <a href=\"http://forestry.io\">forestry.io</a>. Forestry.io est un système édition de Markdown. Il est d’ailleurs le seul à se connecter à Gitlab et Github et à permettre l’édition de Jekyll et de Hugo (Ils sont forts).</p>\n\n<p>Pour le moment Forestry.io souffre encore de pêchés de jeunesse, mais l’interface s’améliore grandement. Depuis un an, un grand chemin a été parcouru.</p>\n\n<p>Il est désormais possible de définir des gabarits par type de contenu. Ces gabarits définissent l’interface disponible pour les rédacteurs, c’est-à-dire qu’il présente ce qu’on peut éditer comme champs pour chaque type de contenu.</p>\n\n<p>On apprend que l’éditeur Markdown, qui est encore très limite, va être modifié ; Forestry monte en maturité au fils des mois.</p>\n\n<p>On pourra reparler de Forestry plus tard, ce n’est pas le sujet principal.</p>\n\n<h2 id=\"le-contenu\">Le contenu</h2>\n\n<p>L’objectif de l’entreprise Forestry est simple : montrer que les sites statiques sont bien plus adaptés à la publication de contenu que des CMS avec base de données.</p>\n\n<p>Etant données que Forestry.io gère déjà 2 types d’architecture de contenu différentes (Jekyll et Hugo). Si jamais il y avait un mouvement général d’utilisation des <a href=\"/generateur-site-statique/\">générateurs de site statique</a>, forestry pourrait en tirer de grand bénéfices. Car leur solution pourrait correspondre à bien des usages.</p>\n\n<p>Je vous laisse donc admirer la qualité de cette présentation qui montre combien les sites statiques sont bien plus adaptés aujourd’hui à de l’édition web (dans la majeur partie des cas) ; mais aussi pourquoi tant d’entreprise lancent des services dans ce domaine.</p>\n\n", "markdown": "Conférence de Chris Macrae de [forestry.io](http://forestry.io) qui tente bien de vendre le principe des [générateurs de site statique](/generateur-site-statique/) afin de valoriser son produit.\n\n<div class=\"aspectratio\" data-ratio=\"16/9\"><iframe width=\"560\" height=\"315\" src=\"https://www.youtube-nocookie.com/embed/KX4G49ZrvY0?rel=0\" frameborder=\"0\" allowfullscreen></iframe></div>\n\n## Forestry\n\nChris Macrae est cofondateur de [forestry.io](http://forestry.io). Forestry.io est un système édition de Markdown. Il est d'ailleurs le seul à se connecter à Gitlab et Github et à permettre l’édition de Jekyll et de Hugo (Ils sont forts).\n\nPour le moment Forestry.io souffre encore de pêchés de jeunesse, mais l’interface s'améliore grandement. Depuis un an, un grand chemin a été parcouru.\n\nIl est désormais possible de définir des gabarits par type de contenu. Ces gabarits définissent l'interface disponible pour les rédacteurs, c'est-à-dire qu'il présente ce qu'on peut éditer comme champs pour chaque type de contenu.\n\nOn apprend que l'éditeur Markdown, qui est encore très limite, va être modifié ; Forestry monte en maturité au fils des mois.\n\nOn pourra reparler de Forestry plus tard, ce n'est pas le sujet principal.\n\n## Le contenu\n\nL'objectif de l'entreprise Forestry est simple : montrer que les sites statiques sont bien plus adaptés à la publication de contenu que des CMS avec base de données.\n\nEtant données que Forestry.io gère déjà 2 types d'architecture de contenu différentes (Jekyll et Hugo). Si jamais il y avait un mouvement général d'utilisation des [générateurs de site statique](/generateur-site-statique/), forestry pourrait en tirer de grand bénéfices. Car leur solution pourrait correspondre à bien des usages.\n\nJe vous laisse donc admirer la qualité de cette présentation qui montre combien les sites statiques sont bien plus adaptés aujourd'hui à de l'édition web (dans la majeur partie des cas) ; mais aussi pourquoi tant d'entreprise lancent des services dans ce domaine.\n\n\n" }