{ "id": "/2020/05/14/expertise-developpeur-front-end-eco-responsable", "title": "Une expertise éco-responsable est nécessaire dans les projets d’applications web", "url": "https://bertrandkeller.info/2020/05/14/expertise-developpeur-front-end-eco-responsable/", "date": 1589407200, "html": "<p>Je vous relais cet article rédigé par Alice Rocheman de SQLI : <a href=\"https://www.lemagit.fr/tribune/Une-expertise-front-end-est-necessaire-dans-les-projets-dapplication-web\">Une expertise front-end est nécessaire dans les projets d’applications web</a>.</p>\n\n<p>À propos des compétences d’un responsable interface, un intégrateur, spécialiste de la lecture de document des usages variés des utilisateurs d’interfaces :</p>\n\n<blockquote>\n <p>Ces pratiques sont encore méconnues et négligées par de nombreux responsables de projets de développement, bien que les technologies et compétences front-end ne cessent de se multiplier et de se complexifier.</p>\n</blockquote>\n\n<p>On fabrique plein d’interfaces au quotidien en mobilisant des dizaines de personnes, des milliers d’euros, mais les pratiques des utilisateurs sur des interfaces web sont méconnues ?</p>\n\n<p>Ça laisse réfléchir, c’est un peu comme si on construisait des trains sans se dire qu’il existe des gens avec des fauteuils roulant, des gens avec des vélos, des gens qui ont besoin de prises de courant, de tablettes pour manger, de toilettes… du personnel humain pour aider/informer les usagers ?</p>\n\n<p>Sommes nous vraiment en train d’équiper notre pays avec des outils non adaptés ?</p>\n\n<blockquote>\n <p>Qui plus est, une interface utilisateur sera censée s’afficher et fonctionner correctement sur différents appareils, depuis d’anciens modèles de smartphones jusqu’aux grands écrans. La création d’une application « responsive » nécessite de fait une excellente maîtrise des langages CSS et HTML. Une raison de plus qui devrait dissuader les décideurs de donner le travail front-end de leur application à des développeurs spécialisés back-end.</p>\n</blockquote>\n\n<p>Je dirais évidemment que je suis tout à fait d’accord, je passe mes journées à lire des articles sur les usages du web, sur des techniques hypra-compliquées pour afficher un tableau de données sur 18 périphériques différents tout en étant accessible.</p>\n\n<p>Mais je me suis engagé un peu plus loin en essayant de devenir un développeur eco-responsable utilisant, si possible, des outils <a href=\"/low-tech-site-web-internet/\">Low-Tech</a> afin de rendre les sites durables et performants.</p>\n\n<p>Donc, je dirais que oui la nécessité d’un tel profil dans une équipe est important mais si l’impact énergétique du numérique vous importe, il faut aller un petit peu plus loin et prendre en considération la sobriété et la performance : quel impact énergétique du chargement d’une page, dans tel pays, si telle bande passante, si tel type de périphérique….</p>\n\n<p>Ce qui importe c’est aussi une personne qui ne réfléchisse pas en terme de comportement (seulement) technique d’une interface mais en terme de comportement humain ; ce qui est rare. Une réflexion sur comment se comporte une page pour une personne dans telle condition, avec tel problème, telle maîtrise des outils…</p>\n\n<p>Ce qui importe c’est une personne qui sache traduire techniquement des besoins UX dans une interface.</p>\n\n", "markdown": "Je vous relais cet article rédigé par Alice Rocheman de SQLI : [Une expertise front-end est nécessaire dans les projets d’applications web](https://www.lemagit.fr/tribune/Une-expertise-front-end-est-necessaire-dans-les-projets-dapplication-web).\n\nÀ propos des compétences d’un responsable interface, un intégrateur, spécialiste de la lecture de document des usages variés des utilisateurs d'interfaces :\n\n > Ces pratiques sont encore méconnues et négligées par de nombreux responsables de projets de développement, bien que les technologies et compétences front-end ne cessent de se multiplier et de se complexifier.\n\nOn fabrique plein d'interfaces au quotidien en mobilisant des dizaines de personnes, des milliers d’euros, mais les pratiques des utilisateurs sur des interfaces web sont méconnues ?\n\nÇa laisse réfléchir, c'est un peu comme si on construisait des trains sans se dire qu’il existe des gens avec des fauteuils roulant, des gens avec des vélos, des gens qui ont besoin de prises de courant, de tablettes pour manger, de toilettes… du personnel humain pour aider/informer les usagers ?\n\nSommes nous vraiment en train d’équiper notre pays avec des outils non adaptés ?\n\n > Qui plus est, une interface utilisateur sera censée s’afficher et fonctionner correctement sur différents appareils, depuis d’anciens modèles de smartphones jusqu’aux grands écrans. La création d’une application « responsive » nécessite de fait une excellente maîtrise des langages CSS et HTML. Une raison de plus qui devrait dissuader les décideurs de donner le travail front-end de leur application à des développeurs spécialisés back-end.\n\nJe dirais évidemment que je suis tout à fait d’accord, je passe mes journées à lire des articles sur les usages du web, sur des techniques hypra-compliquées pour afficher un tableau de données sur 18 périphériques différents tout en étant accessible.\n\nMais je me suis engagé un peu plus loin en essayant de devenir un développeur eco-responsable utilisant, si possible, des outils [Low-Tech](/low-tech-site-web-internet/) afin de rendre les sites durables et performants.\n\nDonc, je dirais que oui la nécessité d'un tel profil dans une équipe est important mais si l’impact énergétique du numérique vous importe, il faut aller un petit peu plus loin et prendre en considération la sobriété et la performance : quel impact énergétique du chargement d’une page, dans tel pays, si telle bande passante, si tel type de périphérique….\n\nCe qui importe c’est aussi une personne qui ne réfléchisse pas en terme de comportement (seulement) technique d’une interface mais en terme de comportement humain ; ce qui est rare. Une réflexion sur comment se comporte une page pour une personne dans telle condition, avec tel problème, telle maîtrise des outils…\n\nCe qui importe c’est une personne qui sache traduire techniquement des besoins UX dans une interface.\n\n" }