{ "id": "/2020/07/06/grand-patron-fossoyeur-de-la-planete", "title": "Grands patrons, Stéphane Richard, fossoyeurs de la planète", "url": "https://bertrandkeller.info/2020/07/06/grand-patron-fossoyeur-de-la-planete/", "date": 1593986400, "html": "<p>Stéphane richard est intervenu sur France Info pour <a href=\"https://www.francetvinfo.fr/economie/telecom/5g-on-ne-va-pas-forcer-les-francais-a-accepter-quelque-chose-dont-ils-ne-veulent-pas-assure-le-pdg-dorange_4030863.html\">une interview sur la 5G</a>. Il prononce ces mots :</p>\n\n<blockquote>\n <p>On a 40% d’augmentation d’usage chaque année. Il faut qu’on ait des réseaux qui permettent de les écouler et on a besoin de la 5G d’abord pour cette raison. Et puis, c’est peut-être le plus important, la 5G, par rapport au défi climatique, par rapport au dérèglement climatique, c’est beaucoup plus une solution qu’un problème.</p>\n</blockquote>\n\n<p>Pourquoi peut-on dire que Stéphane est celui qui participe depuis sa position à lancer des mauvais chantiers technologiques pour notre pays et pour ses habitants ?</p>\n\n<h2 id=\"que-disent-les-tudes-\">Que disent les études ?</h2>\n\n<p>Étude GreenIT de novembre 2019 :</p>\n\n<blockquote>\n <p>La fabrication et la distribution (la “phase amont”) des terminaux utilisés en France sont responsables de 70 % de l’empreinte carbone totale du numérique en France, alors que cette proportion est de 40 % au niveau mondial.</p>\n</blockquote>\n\n<p>Ce qui veut dire que si on veut contenir nos émissions de carbone, il faut réduire nos achats en périphériques et les faire durer plus longtemps.</p>\n\n<p>Dans ce cadre c’est ce qu’on décidé les élus de notre démocraties ; engagement du sénat français : <a href=\"http://www.senat.fr/presse/cp20200624b.html\">Pour une transition numérique écologique : le Sénat propose une feuille de route</a>.</p>\n\n<p>En effet, au delà, des émissions de carbones, les interfaces High-Tech nous rendent dépendant à des matières premières et technologies maîtrisées par la Chine (par exemple), mais aussi consomment de l’eau et détruisent des sols exploités pour leur ressources.</p>\n\n<h2 id=\"les-consquences-de-la-5g\">Les conséquences de la 5G</h2>\n\n<p>On peut débattre sur les bien faits, les méfaits de la 5G. Bon, mauvais, pour la santé, considération dogmatiques des écolos, volonté de suivre la course mondiale pour ne pas se faire dépasser par nos concurrents ?</p>\n\n<p>Mais la 5G est un nouveau moyen de communiquer pour les appareils avec un débit sans précédent jusqu’alors. Si on peut effectivement penser que de nouveaux usages super géniaux pourraient arriver, il faut aussi considérer qu’il va falloir pour ça changer ou créer des milliers de nouveaux appareils connectés.</p>\n\n<p>Je le répète, il faudra produire ces appareils (consommer de la matière première, émettre du carbone, puiser de l’eau au détriment des cultures…), mais aussi fournir l’énergie pour ces appareils sensés évidemment rester allumés en continue (et je ne parle pas du recyclage).</p>\n\n<h2 id=\"clap-de-fin-pour-le-climat\">Clap de fin pour le climat</h2>\n\n<p>Si on regarde le respect des engagements de la Cop21 : <a href=\"https://www.francetvinfo.fr/meteo/climat/cop21/a-vrai-dire-climat-les-engagements-de-l-accord-de-paris-sont-ils-tenus_3077685.html\">À vrai dire. Climat : les engagements de l’accord de Paris sont-ils tenus ?</a> :</p>\n\n<blockquote>\n <p>Seulement 58 pays ont adopté des lois destinées à réduire leurs émissions de gaz à effet de serre.</p>\n</blockquote>\n\n<p>La France fait même partie des mauvais élèves : <a href=\"https://lexpansion.lexpress.fr/actualite-economique/climat-la-france-mauvaise-eleve-de-la-lutte-contre-le-rechauffement_2067083.html\">Climat : la France, mauvaise élève de la lutte contre le réchauffement</a></p>\n\n<blockquote>\n <p>Pour y parvenir, “il faudrait multiplier par 4 le rythme annuel d’amélioration de l’efficacité énergétique”, c‘est-à-dire des économies d’énergie. Ce qui semble tout à fait improbable.</p>\n</blockquote>\n\n<p>On répète, la France est dans un <strong>scénario improbable</strong> de réduction des émissions de gaz à effet de serre par rapport à ses engagements.</p>\n\n<h2 id=\"un-scnario-improbable\">UN SCÉNARIO IMPROBABLE</h2>\n\n<p>Les instances démocratiques de notre pays se sont engagées dans un processus sensé “sauver l’humanité” ; les objectifs de ce processus dans lequel nous sommes tous parties prenantes, nous n’arrivons pas à les tenir. Il est nécessaire de prendre des mesures bien plus importantes et de réduire de manière plus conséquente l’empreinte de notre pays.</p>\n\n<p>Dans cette situation délicate, les patrons et lobbies obtiennent des tribunes pour nous dire que la solution pour réduire nos émissions est de consommer plus (non, l’IA n’optimisera pas notre consommation, on observe justement le contraire, ça explose).</p>\n\n<p>Les patrons et lobbies ont les études entre leur mains, ils ont les chiffres. Il savent. Ils utilisent un subterfuge comptable d’objectifs zéro carbone, car ils savent que la majorité de la consommation est réalisée par les terminaux finaux (vous et moi). Ils peuvent ainsi, dire : <em>et c’est pas nous, nous sommes vertueux, ce sont les usagers qui consomment mal, on n’y est pour rien</em>.</p>\n\n<p>Ils décident sciemment que les profits de leurs entreprises sont plus importants que les objectifs de notre pays. Ils décident de pousser des politiques qui font que quoiqu’on fasse, quoiqu’on pense, les objectifs de réduction de notre empreinte, c’est fini, c’est mort.</p>\n\n<p>Et que ce n’est pas à vous de décider. Ils savent mieux que vous.</p>\n\n", "markdown": "Stéphane richard est intervenu sur France Info pour [une interview sur la 5G](https://www.francetvinfo.fr/economie/telecom/5g-on-ne-va-pas-forcer-les-francais-a-accepter-quelque-chose-dont-ils-ne-veulent-pas-assure-le-pdg-dorange_4030863.html). Il prononce ces mots :\n\n> On a 40% d'augmentation d'usage chaque année. Il faut qu'on ait des réseaux qui permettent de les écouler et on a besoin de la 5G d'abord pour cette raison. Et puis, c’est peut-être le plus important, la 5G, par rapport au défi climatique, par rapport au dérèglement climatique, c'est beaucoup plus une solution qu'un problème.\n\nPourquoi peut-on dire que Stéphane est celui qui participe depuis sa position à lancer des mauvais chantiers technologiques pour notre pays et pour ses habitants ?\n\n## Que disent les études ?\n\nÉtude GreenIT de novembre 2019 :\n\n> La fabrication et la distribution (la \"phase amont\") des terminaux utilisés en France sont responsables de 70 % de l’empreinte carbone totale du numérique en France, alors que cette proportion est de 40 % au niveau mondial.\n\nCe qui veut dire que si on veut contenir nos émissions de carbone, il faut réduire nos achats en périphériques et les faire durer plus longtemps.\n\nDans ce cadre c’est ce qu'on décidé les élus de notre démocraties ; engagement du sénat français : [Pour une transition numérique écologique : le Sénat propose une feuille de route](http://www.senat.fr/presse/cp20200624b.html).\n\nEn effet, au delà, des émissions de carbones, les interfaces High-Tech nous rendent dépendant à des matières premières et technologies maîtrisées par la Chine (par exemple), mais aussi consomment de l’eau et détruisent des sols exploités pour leur ressources.\n\n## Les conséquences de la 5G\n\nOn peut débattre sur les bien faits, les méfaits de la 5G. Bon, mauvais, pour la santé, considération dogmatiques des écolos, volonté de suivre la course mondiale pour ne pas se faire dépasser par nos concurrents ?\n\nMais la 5G est un nouveau moyen de communiquer pour les appareils avec un débit sans précédent jusqu’alors. Si on peut effectivement penser que de nouveaux usages super géniaux pourraient arriver, il faut aussi considérer qu'il va falloir pour ça changer ou créer des milliers de nouveaux appareils connectés.\n\nJe le répète, il faudra produire ces appareils (consommer de la matière première, émettre du carbone, puiser de l'eau au détriment des cultures…), mais aussi fournir l'énergie pour ces appareils sensés évidemment rester allumés en continue (et je ne parle pas du recyclage).\n\n## Clap de fin pour le climat\n\nSi on regarde le respect des engagements de la Cop21 : [À vrai dire. Climat : les engagements de l'accord de Paris sont-ils tenus ?](https://www.francetvinfo.fr/meteo/climat/cop21/a-vrai-dire-climat-les-engagements-de-l-accord-de-paris-sont-ils-tenus_3077685.html) :\n\n> Seulement 58 pays ont adopté des lois destinées à réduire leurs émissions de gaz à effet de serre.\n\nLa France fait même partie des mauvais élèves : [Climat : la France, mauvaise élève de la lutte contre le réchauffement](https://lexpansion.lexpress.fr/actualite-economique/climat-la-france-mauvaise-eleve-de-la-lutte-contre-le-rechauffement_2067083.html)\n\n> Pour y parvenir, \"il faudrait multiplier par 4 le rythme annuel d’amélioration de l’efficacité énergétique\", c‘est-à-dire des économies d’énergie. Ce qui semble tout à fait improbable.\n\nOn répète, la France est dans un **scénario improbable** de réduction des émissions de gaz à effet de serre par rapport à ses engagements.\n\n## UN SCÉNARIO IMPROBABLE\n\nLes instances démocratiques de notre pays se sont engagées dans un processus sensé \"sauver l’humanité\" ; les objectifs de ce processus dans lequel nous sommes tous parties prenantes, nous n'arrivons pas à les tenir. Il est nécessaire de prendre des mesures bien plus importantes et de réduire de manière plus conséquente l’empreinte de notre pays.\n\nDans cette situation délicate, les patrons et lobbies obtiennent des tribunes pour nous dire que la solution pour réduire nos émissions est de consommer plus (non, l’IA n’optimisera pas notre consommation, on observe justement le contraire, ça explose).\n\nLes patrons et lobbies ont les études entre leur mains, ils ont les chiffres. Il savent. Ils utilisent un subterfuge comptable d’objectifs zéro carbone, car ils savent que la majorité de la consommation est réalisée par les terminaux finaux (vous et moi). Ils peuvent ainsi, dire : *et c'est pas nous, nous sommes vertueux, ce sont les usagers qui consomment mal, on n’y est pour rien*.\n\nIls décident sciemment que les profits de leurs entreprises sont plus importants que les objectifs de notre pays. Ils décident de pousser des politiques qui font que quoiqu’on fasse, quoiqu’on pense, les objectifs de réduction de notre empreinte, c’est fini, c’est mort.\n\nEt que ce n’est pas à vous de décider. Ils savent mieux que vous.\n\n" }