{ "id": "/2017/11/09/sites-statiques-sans-graphisme", "title": "Les sites sans mise en page font leur grand retour", "url": "https://bertrandkeller.info/2017/11/09/sites-statiques-sans-graphisme/", "date": 1510182000, "html": "<p>Rappelez vous la citation de mon dernier article à propos de l’<a href=\"/2017/11/06/netflix-react-generateur-site-statique/\">abandon de React.js par Netflix pour leurs landing pages</a>.</p>\n\n<blockquote>\n <p>By getting rid of React and moving to plain JavaScript, we saw a 50% reduction in our Time to interactive metric.</p>\n</blockquote>\n\n<p>D’accord, ils obtiennent 50% de réduction d’un de leur temps de chargement de pages, mais 50% par rapport à quoi ? Hé bien, par rapport à leur page précédemment en ligne.</p>\n\n<p>Mais dans le cas, où leurs pages étaient déjà rapides à charger, on peut dire que le résultat est plutôt intéressant ; mais dans le cas où leurs pages étaient assez lentes à charger, même avec 50% d’amélioration les pages peuvent rester, encore et toujours, plutôt lentes à charger (par rapport à ce qu’un utilisateur ressent comme rapide).</p>\n\n<h2 id=\"le-ressenti-utilisateur\">Le ressenti utilisateur</h2>\n\n<p>Lorsque l’ont parle de ressenti utilisateur dans les conférences de web, on aura plutôt tendance à vous le présenter sous une forme visuelle. Sur l’illustration ci-dessous, on insère une sorte de faux contenu en lieu et place des zones de contenus en attendant que le vrai contenu se charge.</p>\n\n<div class=\"center\">\n <p>&lt;img src/assets/place-holder-content.gif alt=”faux contenu HTML” /&gt;</p>\n</div>\n\n<p>L’utilisateur observant cette animation aura moins la sensation d’attendre, donc un meilleur ressenti de rapidité de chargement. Personnellement, je vois cet effet sur nombre d’interfaces JS lentes à charger et j’ai tendance à haïr les services car je préférais qu’ils optimisent leurs pages plutôt que de me faire charger un élément inutile qui me trompe.</p>\n\n<p>Je suis peut-être un étrange utilisateur, intéressé par le texte, le rédactionnel, mais ce qui m’importe c’est que le contenu s’affiche quelque soit la mise en forme.</p>\n\n<p>Apparemment, je ne suis pas le seul.</p>\n\n<h2 id=\"les-sites-prsentant-du-texte-et-seulement-du-texte\">Les sites présentant du texte et seulement du texte.</h2>\n\n<p>Je vous conseille la lecture de cet article : <a href=\"https://www.poynter.org/news/text-only-news-sites-are-slowly-making-comeback-heres-why\">Text-only news sites are slowly making a comeback. Here’s why.</a>.</p>\n\n<blockquote>\n <p>Has anyone researched news sites capability to provide low-bandwidth communication of critical info during crisis situations?</p>\n</blockquote>\n\n<p>Vous pourrez découvrir cette histoire écrite par Melody Kramer dans laquelle CNN créa un site en version text-only (texte seulement - pas d’images, pas de vidéos, pas de publicités ou de tracking) après le passage de l’ouragan Irma : <a href=\"http://lite.cnn.io/en\">CNN - Breaking News, Latest News and Videos</a>.</p>\n\n<p>Les sites présentant seulement du texte ne sont pas récents, on avait déjà vu l’expérience se concrétiser lors du 11 septembre 2001 ; époque à laquelle le réseau (général) n’était pas aussi rapide qu’aujourd’hui. Ce qui change c’est qu’après une grande période de consultation sur écrans de bureau et mobiles en ville. Des utilisateurs consultent des pages web avec des mobiles dans des zones avec un faible réseau et que cela représente une grande partie de leur relation avec le monde.</p>\n\n<p>Ces pages peuvent sembler rudimentaires, mais dans l’article que je cite, <a href=\"https://twitter.com/jalbertbowdenii\">Albert Bowden</a> ne manque pas d’énumérer plusieurs avantages :</p>\n\n<ol>\n <li>Couverture de tous les problèmes d’accessibilité (robots, lecteurs d’écrans…)</li>\n <li>Lecture par tous les périphériques possibles</li>\n <li>Marche dans le métro</li>\n <li>Préserve le porte-monnaie.</li>\n</ol>\n\n<h2 id=\"que-cela-doit-il-vous-inspirer-\">Que cela doit-il vous inspirer ?</h2>\n\n<p>Le contenu est une des raisons principales pour lesquels les utilisateurs consultent des pages web. Cela peut-être du contenu vidéo ou image bien entendu, mais ceux-ci étant assez lourd en terme de poids, il faut toujours penser à l’alternative texte dans le cas d’un faible débit de données. Les utilisateurs peuvent se contenter d’une mise en forme légère, si le contenu est là.</p>\n\n<p>Si les utilisateurs peuvent se contenter de pages ne contenant que du texte. Si cela vous coûte peu cher à mettre en place et à maintenir au niveau technique ; alors la logique de sites text-only pourrait être l’objectif de base de votre stratégie d’édition sur le web.</p>\n\n<p>Pour clarifier ma pensée, je dirai que l’investissement sur un système technique lourd et contraignant devrait être délaissée (stop CMS) et consacré à la partie rédactionnelle (métier) celle qui est nécessaire pour le lecteur.</p>\n\n<p>En gros, si vous êtes une structure (ou sous structure d’une organisation) qui publie du contenu, vous n’avez pas à vous mettre le boulet d’un système de rédaction techniquement lourd à maintenir et dépendant qu’une DSI. Vous devez vous concentrer sur votre stratégie éditoriale.</p>\n\n<p>Je pense que les <a href=\"/generateur-site-statique/\">générateur de site statique</a> répondent à ce besoin et que les groupes qui passeront le cap de leur maîtrise pour imaginer des formes de sites innovantes et correspondants à des besoins à venir.</p>\n\n", "markdown": "Rappelez vous la citation de mon dernier article à propos de l'[abandon de React.js par Netflix pour leurs landing pages](/2017/11/06/netflix-react-generateur-site-statique/).\n\n> By getting rid of React and moving to plain JavaScript, we saw a 50% reduction in our Time to interactive metric.\n\nD'accord, ils obtiennent 50% de réduction d'un de leur temps de chargement de pages, mais 50% par rapport à quoi ? Hé bien, par rapport à leur page précédemment en ligne.\n\nMais dans le cas, où leurs pages étaient déjà rapides à charger, on peut dire que le résultat est plutôt intéressant ; mais dans le cas où leurs pages étaient assez lentes à charger, même avec 50% d'amélioration les pages peuvent rester, encore et toujours, plutôt lentes à charger (par rapport à ce qu'un utilisateur ressent comme rapide).\n\n## Le ressenti utilisateur\n\nLorsque l’ont parle de ressenti utilisateur dans les conférences de web, on aura plutôt tendance à vous le présenter sous une forme visuelle. Sur l'illustration ci-dessous, on insère une sorte de faux contenu en lieu et place des zones de contenus en attendant que le vrai contenu se charge.\n\n<div class=\"center\" markdown=\"1\">\n<img src/assets/place-holder-content.gif alt=\"faux contenu HTML\"/>\n</div>\n\nL'utilisateur observant cette animation aura moins la sensation d'attendre, donc un meilleur ressenti de rapidité de chargement. Personnellement, je vois cet effet sur nombre d'interfaces JS lentes à charger et j'ai tendance à haïr les services car je préférais qu'ils optimisent leurs pages plutôt que de me faire charger un élément inutile qui me trompe.\n\nJe suis peut-être un étrange utilisateur, intéressé par le texte, le rédactionnel, mais ce qui m'importe c'est que le contenu s'affiche quelque soit la mise en forme.\n\nApparemment, je ne suis pas le seul.\n\n## Les sites présentant du texte et seulement du texte.\n\nJe vous conseille la lecture de cet article : [Text-only news sites are slowly making a comeback. Here's why.](https://www.poynter.org/news/text-only-news-sites-are-slowly-making-comeback-heres-why).\n\n> Has anyone researched news sites capability to provide low-bandwidth communication of critical info during crisis situations?\n\nVous pourrez découvrir cette histoire écrite par Melody Kramer dans laquelle CNN créa un site en version text-only (texte seulement - pas d'images, pas de vidéos, pas de publicités ou de tracking) après le passage de l'ouragan Irma : [CNN - Breaking News, Latest News and Videos](http://lite.cnn.io/en). \n\nLes sites présentant seulement du texte ne sont pas récents, on avait déjà vu l'expérience se concrétiser lors du 11 septembre 2001 ; époque à laquelle le réseau (général) n'était pas aussi rapide qu'aujourd’hui. Ce qui change c'est qu'après une grande période de consultation sur écrans de bureau et mobiles en ville. Des utilisateurs consultent des pages web avec des mobiles dans des zones avec un faible réseau et que cela représente une grande partie de leur relation avec le monde.\n\nCes pages peuvent sembler rudimentaires, mais dans l'article que je cite, [Albert Bowden](https://twitter.com/jalbertbowdenii) ne manque pas d'énumérer plusieurs avantages :\n\n1. Couverture de tous les problèmes d'accessibilité (robots, lecteurs d'écrans…)\n2. Lecture par tous les périphériques possibles\n3. Marche dans le métro\n4. Préserve le porte-monnaie.\n\n## Que cela doit-il vous inspirer ?\n\nLe contenu est une des raisons principales pour lesquels les utilisateurs consultent des pages web. Cela peut-être du contenu vidéo ou image bien entendu, mais ceux-ci étant assez lourd en terme de poids, il faut toujours penser à l'alternative texte dans le cas d'un faible débit de données. Les utilisateurs peuvent se contenter d'une mise en forme légère, si le contenu est là.\n\nSi les utilisateurs peuvent se contenter de pages ne contenant que du texte. Si cela vous coûte peu cher à mettre en place et à maintenir au niveau technique ; alors la logique de sites text-only pourrait être l'objectif de base de votre stratégie d'édition sur le web.\n\nPour clarifier ma pensée, je dirai que l'investissement sur un système technique lourd et contraignant devrait être délaissée (stop CMS) et consacré à la partie rédactionnelle (métier) celle qui est nécessaire pour le lecteur.\n\nEn gros, si vous êtes une structure (ou sous structure d'une organisation) qui publie du contenu, vous n'avez pas à vous mettre le boulet d'un système de rédaction techniquement lourd à maintenir et dépendant qu'une DSI. Vous devez vous concentrer sur votre stratégie éditoriale. \n\nJe pense que les [générateur de site statique](/generateur-site-statique/) répondent à ce besoin et que les groupes qui passeront le cap de leur maîtrise pour imaginer des formes de sites innovantes et correspondants à des besoins à venir.\n\n" }