{ "id": "/2018/01/18/cout-de-javascript", "title": "Le coût de JavaScript", "url": "https://bertrandkeller.info/2018/01/18/cout-de-javascript/", "date": 1516230000, "html": "<h2>Je veux un site qui claque</h2>\n\n<p>Selon Yehuda Katz le JavaScript serait plus important en terme de chargement qu’une image. Depuis quelques années déjà, les développeurs d’expérience, comme moi, suivons invariablement le poids de pages augmenter sans cesse.</p>\n\n<blockquote>\n <p>Le code JavaScript est beaucoup plus lourd, octet par octet, qu’une image, à cause du temps passé à l’analyser et à le compiler.</p>\n</blockquote>\n\n<p>Il y a 10 ans, les décorations de nos sites web étaient le fruit d’un découpage minutieux de maquettes Photoshop réalisées au pixel. La méthode fait sourire aujourd’hui puisque nous avions pour mission de réaliser des sites identiques dans des navigateurs qui interprétaient le code de manières différentes.</p>\n\n<p>L’arrivé de CSS3 fut comme une sorte d’aubaine. Nous allions enfin supprimer toutes ces requêtes inutiles et pouvoir baisser le drastiquement le poids de nos CSS. Les décorations seraient définies en CSS.</p>\n\n<div class=\"center\">\n\t{% twitter https://twitter.com/wycats/status/942908325775077376 %}\n</div>\n\n<p>C’était sans compter sur les polices Web et les héros images (grande images d’entête) intégrées de manière amateure. Le poids moyen des sites augmente encore et encore jusqu’à atteindre celui d’un jeu comme Doom (2Mb).</p>\n\n<h2>JavaScript the evil !</h2>\n\n<p>Mais le chargement d’une page est-il directement proportionnel au poids d’une page ? Est-ce que plus d’éléments se chargent et plus ma page met du temps à s’afficher ?</p>\n\n<p>La réponse est non ! Le poids d’une ressource influe effectivement sur le temps de chargement ; mais toutes des ressources n’ont pas un impact égal. Il reste aussi possible de différer ou de rendre optionnelle certains chargements.</p>\n\n<p>A ce jeu là, c’est JavaScript qui est mis en cause en 2018. La réalisation d’applications web permet mettre en ligne du code plutôt léger, seulement le code présente des temps d’exécution qui peuvent se révéler trop long et ainsi pénaliser l’utilisateur.</p>\n\n<div class=\"center\">\n\t<br/>\n\t<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Lx1cYJAVnzA\" frameborder=\"0\" allowfullscreen=\"\" class=\"yt-embed\"></iframe>\n</div>\n\n<p>Je vous laisse lire cet article très complet :\n<a href=\"https://infrequently.org/2017/10/can-you-afford-it-real-world-web-performance-budgets/\">Can You Afford It?: Real-world Web Performance Budgets</a></p>\n\n<h2>Ma préférence à moi</h2>\n\n<p>Si on évoque le chargement dans le vrai monde (<a href=\"https://building.calibreapp.com/beyond-the-bubble-real-world-performance-9c991dcd5342\">Beyond the Bubble: Real world performance</a>), on voit que le chargement d’une page web est bien différent en fonction des pays, mais aussi en fonction du processeur de votre mobile (le mien n’est même pas listé).</p>\n\n<p>{% cloudinary /assets/temps-chargement-type-mobile.jpeg alt=”Temps de chargement selon le type de mobile” %}</p>\n\n<p>JavaScript a un coût (<a href=\"https://medium.com/dev-channel/the-cost-of-javascript-84009f51e99e\">The Cost Of JavaScript</a>). Je continue de préférer, tel un vieux développeur que je suis, à construire des coquilles.</p>\n\n<p>Je ne dénigre pas le JavaScript ou les applications, mais quand on code un site qui va être chargé par tous types d’utilisateurs, il est important de prendre en compte les cas de faibles connexions.</p>\n\n<p>Depuis 10 ans, le poids des pages augmente, aussi, parce que la complexité du web augmente. Les équipes de développement connaissent beaucoup de choses mais ne prennent pas assez en compte cette notion. Les objectifs sont souvent business.</p>\n\n<p>Ainsi, je préconise avant tout de réfléchir sur ses méthodes de développement : de rester humble et mesuré.</p>\n\n<p>Je continue d’utiliser des <a href=\"/generateur-site-statique/\">générateurs de site statique</a> parce que pour servir du contenu statique je garde une complexité la plus basse possible.</p>\n", "markdown": "<h2>Je veux un site qui claque</h2>\n\nSelon Yehuda Katz le JavaScript serait plus important en terme de chargement qu'une image. Depuis quelques années déjà, les développeurs d'expérience, comme moi, suivons invariablement le poids de pages augmenter sans cesse.\n\n> Le code JavaScript est beaucoup plus lourd, octet par octet, qu'une image, à cause du temps passé à l'analyser et à le compiler.\n\nIl y a 10 ans, les décorations de nos sites web étaient le fruit d'un découpage minutieux de maquettes Photoshop réalisées au pixel. La méthode fait sourire aujourd’hui puisque nous avions pour mission de réaliser des sites identiques dans des navigateurs qui interprétaient le code de manières différentes.\n\nL'arrivé de CSS3 fut comme une sorte d'aubaine. Nous allions enfin supprimer toutes ces requêtes inutiles et pouvoir baisser le drastiquement le poids de nos CSS. Les décorations seraient définies en CSS.\n\n<div class=\"center\">\n\t{% twitter https://twitter.com/wycats/status/942908325775077376 %}\n</div>\n\nC'était sans compter sur les polices Web et les héros images (grande images d'entête) intégrées de manière amateure. Le poids moyen des sites augmente encore et encore jusqu'à atteindre celui d'un jeu comme Doom (2Mb).\n\n<h2>JavaScript the evil !</h2>\n\nMais le chargement d'une page est-il directement proportionnel au poids d’une page ? Est-ce que plus d'éléments se chargent et plus ma page met du temps à s’afficher ?\n\nLa réponse est non ! Le poids d'une ressource influe effectivement sur le temps de chargement ; mais toutes des ressources n'ont pas un impact égal. Il reste aussi possible de différer ou de rendre optionnelle certains chargements.\n\nA ce jeu là, c'est JavaScript qui est mis en cause en 2018. La réalisation d'applications web permet mettre en ligne du code plutôt léger, seulement le code présente des temps d'exécution qui peuvent se révéler trop long et ainsi pénaliser l’utilisateur.\n\n<div class=\"center\">\n\t<br>\n\t<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/Lx1cYJAVnzA\" frameborder=\"0\" allowfullscreen class=\"yt-embed\"></iframe>\n</div>\n\nJe vous laisse lire cet article très complet :\n[Can You Afford It?: Real-world Web Performance Budgets](https://infrequently.org/2017/10/can-you-afford-it-real-world-web-performance-budgets/)\n\n<h2>Ma préférence à moi</h2>\n\nSi on évoque le chargement dans le vrai monde ([Beyond the Bubble: Real world performance](https://building.calibreapp.com/beyond-the-bubble-real-world-performance-9c991dcd5342)), on voit que le chargement d’une page web est bien différent en fonction des pays, mais aussi en fonction du processeur de votre mobile (le mien n'est même pas listé).\n\n{% cloudinary /assets/temps-chargement-type-mobile.jpeg alt=\"Temps de chargement selon le type de mobile\" %}\n\nJavaScript a un coût ([The Cost Of JavaScript](https://medium.com/dev-channel/the-cost-of-javascript-84009f51e99e)). Je continue de préférer, tel un vieux développeur que je suis, à construire des coquilles.\n\nJe ne dénigre pas le JavaScript ou les applications, mais quand on code un site qui va être chargé par tous types d’utilisateurs, il est important de prendre en compte les cas de faibles connexions.\n\nDepuis 10 ans, le poids des pages augmente, aussi, parce que la complexité du web augmente. Les équipes de développement connaissent beaucoup de choses mais ne prennent pas assez en compte cette notion. Les objectifs sont souvent business.\n\nAinsi, je préconise avant tout de réfléchir sur ses méthodes de développement : de rester humble et mesuré.\n\nJe continue d'utiliser des [générateurs de site statique](/generateur-site-statique/) parce que pour servir du contenu statique je garde une complexité la plus basse possible.\n" }