{ "id": "/2018/01/30/contentful-pas-un-cms", "title": "Contenful n'est pas un CMS", "url": "https://bertrandkeller.info/2018/01/30/contentful-pas-un-cms/", "date": 1517266800, "html": "<p>Contentful est une solution d’édition de contenu disponible à partir d’une API. Lorsque vous mettez en place des <a href=\"/generateur-site-statique/\">générateurs de site statique</a> le contenu peut être hébergé à différents endroits.</p>\n\n<ul>\n <li>En local :: dans le répertoire du projet ;</li>\n <li>Dans CMS Headless :: à distance, requêtable à l’aide d’une API ;</li>\n <li>N’importe où : à distance, traiter à l’aide d’une procédure spécifique.</li>\n</ul>\n\n<p>L’avantage du statique est que vous pouvez mixer du contenus à volonté sans avoir à tordre en vous servant de fonctionnalités natives très faciles à manipuler.</p>\n\n<h2 id=\"ne-pas-appeler-contentful-cms-mais-plutt-infrastructure-de-contenu\">Ne pas appeler Contentful «CMS» mais plutôt infrastructure de contenu.</h2>\n\n<p>Le directeur du marketing de Contentful, Chris Schagen pense que les architectures modulaires basées sur le cloud sont devenues la norme - les composants réutilisables permettent aux équipes de s’adapter sans effort, de développer facilement de nouveaux canaux et de parcourir plus rapidement que jamais de nouveaux produits. de nombreuses entreprises rencontrent un obstacle majeur sue la route vers l’avenir numérique : <strong>contenu</strong>.</p>\n\n<blockquote>\n <p>La manière dont nous travaillons maintenant, dont le logiciel est construit, a radicalement changé.</p>\n</blockquote>\n\n<p>Chris est un bon directeur marketing, il doit bien vendre son produit, mais on doit bien dire que je le rejoins sur ce terrain. Le contenu reste un parent pauvre du web ; les possibilités qu’on se donne pour le manipuler sont assez faibles.</p>\n\n<p>En dehors de l’aspect technique de déclinaison de sites, les <a href=\"/generateur-site-statique/\">générateurs de site statique</a> sont une aubaine pour ajouter, modifier, raturer… le contenu. Les régressions éventuelles sont bien plus faciles à corriger qu’avec d’autres technologies.</p>\n\n<p>C’est ce qui constitue le cœur de mon travail aujourd’hui de construire des dépôt de contenu fiables, complets et évolutifs.</p>\n\n<h2 id=\"lenfer-du-cms\">L’enfer du CMS</h2>\n\n<p>Chris son créneau est donc de dire que les CMS c’est bien has been. Les développeurs exècreraient très souvent ce type de solution pour leur fonctionnement spécifique qui limite souvent la manipulation du contenu.</p>\n\n<p>Contenful permettraient de manipuler du contenu selon ses propres désirs sans dépendre d’un schéma relationnel déjà préétabli.<br/>\nLe démarche statique quoi : aller prendre du contenu, le structurer à sa sauce et réaliser des interfaces qui correspondent au besoin.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Ainsi donc la manière de faire des interfaces aurait évoluée. La logique de pages uniques serait en train d’évoluer.</p>\n\n<p>Le gestion du contenu pour ces interfaces ne pourrait plus se faire uniquement à l’aide de CMS orientés dans leur structuration.</p>\n\n<p>Lire <a href=\"https://thenewstack.io/dont-call-contentfuls-content-infrastructure-cms/\">Don’t Call Contentful’s Content Infrastructure a ‘CMS’</a>.</p>\n", "markdown": "Contentful est une solution d'édition de contenu disponible à partir d'une API. Lorsque vous mettez en place des [générateurs de site statique](/generateur-site-statique/) le contenu peut être hébergé à différents endroits.\n\n * En local :: dans le répertoire du projet ;\n * Dans CMS Headless :: à distance, requêtable à l'aide d'une API ;\n * N’importe où : à distance, traiter à l'aide d'une procédure spécifique.\n\nL'avantage du statique est que vous pouvez mixer du contenus à volonté sans avoir à tordre en vous servant de fonctionnalités natives très faciles à manipuler.\n\n## Ne pas appeler Contentful «CMS» mais plutôt infrastructure de contenu.\n\nLe directeur du marketing de Contentful, Chris Schagen pense que les architectures modulaires basées sur le cloud sont devenues la norme - les composants réutilisables permettent aux équipes de s'adapter sans effort, de développer facilement de nouveaux canaux et de parcourir plus rapidement que jamais de nouveaux produits. de nombreuses entreprises rencontrent un obstacle majeur sue la route vers l'avenir numérique : **contenu**.\n\n> La manière dont nous travaillons maintenant, dont le logiciel est construit, a radicalement changé.\n\nChris est un bon directeur marketing, il doit bien vendre son produit, mais on doit bien dire que je le rejoins sur ce terrain. Le contenu reste un parent pauvre du web ; les possibilités qu'on se donne pour le manipuler sont assez faibles.\n\nEn dehors de l'aspect technique de déclinaison de sites, les [générateurs de site statique](/generateur-site-statique/) sont une aubaine pour ajouter, modifier, raturer… le contenu. Les régressions éventuelles sont bien plus faciles à corriger qu'avec d'autres technologies.\n\nC'est ce qui constitue le cœur de mon travail aujourd'hui de construire des dépôt de contenu fiables, complets et évolutifs.\n\n## L’enfer du CMS\n\nChris son créneau est donc de dire que les CMS c'est bien has been. Les développeurs exècreraient très souvent ce type de solution pour leur fonctionnement spécifique qui limite souvent la manipulation du contenu.\n\nContenful permettraient de manipuler du contenu selon ses propres désirs sans dépendre d’un schéma relationnel déjà préétabli. \nLe démarche statique quoi : aller prendre du contenu, le structurer à sa sauce et réaliser des interfaces qui correspondent au besoin.\n\n## Conclusion\n\nAinsi donc la manière de faire des interfaces aurait évoluée. La logique de pages uniques serait en train d'évoluer.\n\nLe gestion du contenu pour ces interfaces ne pourrait plus se faire uniquement à l'aide de CMS orientés dans leur structuration.\n\n\nLire [Don’t Call Contentful’s Content Infrastructure a ‘CMS’](https://thenewstack.io/dont-call-contentfuls-content-infrastructure-cms/).\n" }