{ "id": "/2020/12/10/eco-conception-chef-de-projet", "title": "L’éco-conception et les chefs de projets", "url": "https://bertrandkeller.info/2020/12/10/eco-conception-chef-de-projet/", "date": 1607554800, "html": "<p>Les habitués de ce blog savent que j’ai l’habitude de développer des thèses mélangeant pragmatisme et idéalisme. Notamment sur la mise en place d’équipes projets autonomes sans “chefs de projets” (<a href=\"http://localhost:4000/2008/07/17/lentreprise-collaborative/\">qui marche en théorie</a>) ; d’ailleurs est-ce que “chefs de projets” et “éco-conception” sont compatibles ?</p>\n\n<h2 id=\"la-catastrophe-managriale\">La catastrophe managériale</h2>\n\n<p>Le sociologue François Dupuy vient de publier un nouveau livre intitulé : “La faillite de la pensée managériale”. Il développe ce concept :</p>\n\n<blockquote>\n <p>A l’origine du phénomène, il y a la formation des managers encadrants. Un technicien qui a réussi dans sa fonction est nommé manager mais personne ne pense à le former, alors qu’il va avoir une tâche relativement complexe à réaliser, gérer des Hommes. Du côté des dirigeants, la pensée financière a tué toutes les autres formes de pensée.<br/>\nIl y a une forme de paresse intellectuelle terrifiante. On ne raisonne plus, on applique des recettes.<br/>\n<strong>François Dupuy</strong></p>\n</blockquote>\n\n<p>Ce principe on connaît (<a href=\"http://www.christian-faure.net/2013/01/16/sur-le-mode-projet/\">Sur le mode “projet par Christian Fauré</a>), rien de nouveau, on parle d’une uniformisation de la pensée au profit du profit (justement). Mais continuons sur sa pensée.</p>\n\n<blockquote>\n <p>Ce qui est pour moi la catastrophe managériale majeure, c’est : la multiplication des chefs de projet, le fonctionnement “en mode projet”. On prend un brave type ou une brave fille et on lui dit “tu vas faire travailler ensemble des gens venant de services différents” et en général on ne lui donne aucun moyen pour le faire.<br/>\n<strong>François Dupuy</strong></p>\n</blockquote>\n\n<h2 id=\"le-chef-de-projet-co-conu-\">Le chef de projet éco-conçu ?</h2>\n\n<p>Mais alors si le fonctionnement d’une équipe, par l’existence de “chef de projets”, est compromis. Si le “chef de projets” est un frein au changement et à l’engagement (désiré tant par les entreprises que par les employés) ; est-ce que garder une organisation avec des « chef de projets » peut favoriser la transformation d‘une entreprise sur un mode « éco-responsable » ?</p>\n\n<p>Probablement pas. La mise en place d’une pratique « éco-responsable » demande de gérer de la complexité. Les études sur le climat, les pollutions, le fonctionnement du numérique, la prise en compte des problématiques humaines (RSE) sont complexes. On ne peut pas les aborder de manière linéaire.</p>\n\n<blockquote>\n <p>Je crois qu’on privilégie trop la pensée linéaire et pas assez la pensée complexe. On développe une pensée segmentée où l’on traite une question à la fois, une pensée séquentielle où l’on s’attache à travailler problème par problème.<br/>\n<strong>François Dupuy</strong></p>\n</blockquote>\n\n<p>Dans certains référentiels, on parle de nomination d‘un référent “numérique responsable” ; et non de la nomination de “chef de projets” formés à l’éco-conception. Donc une personne qui connaît la complexité du sujet et qui va guider les personnes à créer leurs chemins de pensées permettant la résolution de problèmes.</p>\n\n<h2 id=\"la-grande-transformation\">La grande transformation</h2>\n\n<p>Évidemment étant un adepte de la pensée complexe, formé et auto-formé à cette autonomie intrinsèque à la réalisation de projets numériques, les propos de François Dupuy me parlent.</p>\n\n<p>Cependant, je vous invite à vous questionner sur les manières de s’organiser et peut-être admettre qu’à partir du moment où une structure ne permet pas d’aborder les problèmes complexes (afin de les simplifier), elle ne peut pas se qualifier d’organisation “éco-responsable”.</p>\n\n<p>C’est certainement pour cette raison que la majeure partie des (grosses) entreprises qui sont adaptées au modèle existant (business as usual) passent par la compensation carbone pour ne pas avoir à remettre en cause leur organigramme. Elles ne veulent pas que les choses changent pour garder leur avantage concurrentiel.</p>\n\n<p>Mais si vous voulez de votre côté vous engager dans l’éco-responsabilité (la vraie). Il va falloir accepter de vous lancer dans une transformation radicale qui comporte de très très grandes incertitudes. Passer sur un autre mode d’organisation où la confiance est “a priori” et où la pyramide est écrasée.</p>\n\n<p>Un fonctionnement fait de partenariats durables, seuls à même de répondre à nos engagements de réduction de nos émissions et consommations en tout genre.</p>\n\n<p>Lire <a href=\"https://www.usinenouvelle.com/article/la-multiplication-des-chefs-de-projet-est-une-catastrophe-manageriale-majeure-affirme-le-sociologue-francois-dupuy.N307730\">La multiplication des chefs de projet est une catastrophe managériale majeure</a>.</p>\n", "markdown": "Les habitués de ce blog savent que j’ai l'habitude de développer des thèses mélangeant pragmatisme et idéalisme. Notamment sur la mise en place d'équipes projets autonomes sans \"chefs de projets\" ([qui marche en théorie](http://localhost:4000/2008/07/17/lentreprise-collaborative/)) ; d’ailleurs est-ce que \"chefs de projets\" et \"éco-conception\" sont compatibles ?\n\n## La catastrophe managériale\n\n\nLe sociologue François Dupuy vient de publier un nouveau livre intitulé : \"La faillite de la pensée managériale\". Il développe ce concept :\n\n> A l'origine du phénomène, il y a la formation des managers encadrants. Un technicien qui a réussi dans sa fonction est nommé manager mais personne ne pense à le former, alors qu'il va avoir une tâche relativement complexe à réaliser, gérer des Hommes. Du côté des dirigeants, la pensée financière a tué toutes les autres formes de pensée. \n> Il y a une forme de paresse intellectuelle terrifiante. On ne raisonne plus, on applique des recettes. \n**François Dupuy**\n\nCe principe on connaît ([Sur le mode “projet par Christian Fauré](http://www.christian-faure.net/2013/01/16/sur-le-mode-projet/)), rien de nouveau, on parle d’une uniformisation de la pensée au profit du profit (justement). Mais continuons sur sa pensée.\n\n> Ce qui est pour moi la catastrophe managériale majeure, c'est : la multiplication des chefs de projet, le fonctionnement \"en mode projet\". On prend un brave type ou une brave fille et on lui dit \"tu vas faire travailler ensemble des gens venant de services différents\" et en général on ne lui donne aucun moyen pour le faire. \n**François Dupuy**\n\n## Le chef de projet éco-conçu ?\n\nMais alors si le fonctionnement d'une équipe, par l’existence de \"chef de projets\", est compromis. Si le \"chef de projets\" est un frein au changement et à l’engagement (désiré tant par les entreprises que par les employés) ; est-ce que garder une organisation avec des « chef de projets » peut favoriser la transformation d‘une entreprise sur un mode « éco-responsable » ?\n\nProbablement pas. La mise en place d'une pratique « éco-responsable » demande de gérer de la complexité. Les études sur le climat, les pollutions, le fonctionnement du numérique, la prise en compte des problématiques humaines (RSE) sont complexes. On ne peut pas les aborder de manière linéaire.\n\n> Je crois qu'on privilégie trop la pensée linéaire et pas assez la pensée complexe. On développe une pensée segmentée où l'on traite une question à la fois, une pensée séquentielle où l'on s'attache à travailler problème par problème. \n**François Dupuy**\n\nDans certains référentiels, on parle de nomination d‘un référent \"numérique responsable\" ; et non de la nomination de \"chef de projets\" formés à l’éco-conception. Donc une personne qui connaît la complexité du sujet et qui va guider les personnes à créer leurs chemins de pensées permettant la résolution de problèmes.\n\n## La grande transformation\n\nÉvidemment étant un adepte de la pensée complexe, formé et auto-formé à cette autonomie intrinsèque à la réalisation de projets numériques, les propos de François Dupuy me parlent.\n\nCependant, je vous invite à vous questionner sur les manières de s’organiser et peut-être admettre qu’à partir du moment où une structure ne permet pas d’aborder les problèmes complexes (afin de les simplifier), elle ne peut pas se qualifier d’organisation \"éco-responsable\".\n\nC'est certainement pour cette raison que la majeure partie des (grosses) entreprises qui sont adaptées au modèle existant (business as usual) passent par la compensation carbone pour ne pas avoir à remettre en cause leur organigramme. Elles ne veulent pas que les choses changent pour garder leur avantage concurrentiel.\n\nMais si vous voulez de votre côté vous engager dans l’éco-responsabilité (la vraie). Il va falloir accepter de vous lancer dans une transformation radicale qui comporte de très très grandes incertitudes. Passer sur un autre mode d’organisation où la confiance est \"a priori\" et où la pyramide est écrasée.\n\nUn fonctionnement fait de partenariats durables, seuls à même de répondre à nos engagements de réduction de nos émissions et consommations en tout genre.\n\nLire [La multiplication des chefs de projet est une catastrophe managériale majeure](https://www.usinenouvelle.com/article/la-multiplication-des-chefs-de-projet-est-une-catastrophe-manageriale-majeure-affirme-le-sociologue-francois-dupuy.N307730).\n" }