{ "id": "/2017/07/26/jekyll-theme-artisan", "title": "Jekyll - Un thème pour artisans", "url": "https://bertrandkeller.info/2017/07/26/jekyll-theme-artisan/", "date": 1501020000, "html": "<p>Travailler avec des sites statiques, c’est apprendre à se désolidariser de la notion d’administration ; apprendre à éditer le contenu au plus près. Je vous présente ici un thème que j’ai développé pour un artisan céramiste.</p>\n\n<h2 id=\"prsentation-du-thme\">Présentation du thème</h2>\n\n<p>Le thème que j’ai développé reste à améliorer car il est difficilement utilisable tel quel. Il faudrait que je simplifie certaines choses et que je complète la notice.\nVous pouvez néanmoins essayer de l’installer pour corriger ce premier jet.</p>\n\n<h2 id=\"dcouverte-du-thme\">Découverte du thème</h2>\n\n<p>Le thème est consultable à l’adresse : <a href=\"https://github.com/bertrandkeller/jekyll-for-craftman\">https://github.com/bertrandkeller/jekyll-for-craftman</a></p>\n\n<h2 id=\"le-principe-du-thme\">Le principe du thème</h2>\n\n<p>L’édition ne se fait qu’à partir de fichiers de contenus dans le répertoire “gallery”. L’idée est de créer des pages à partir d’images et d’afficher ces images (en fonction des informations contenus dans leur nom).</p>\n\n<p>Le rédacteur gère ses pièces ou la présentation de son activité en ajoutant simplement des images dans un répertoire.</p>\n\n<p>Plus d’explication à la fin de l’été.</p>\n", "markdown": "Travailler avec des sites statiques, c'est apprendre à se désolidariser de la notion d'administration ; apprendre à éditer le contenu au plus près. Je vous présente ici un thème que j'ai développé pour un artisan céramiste.\n\n## Présentation du thème\n\nLe thème que j'ai développé reste à améliorer car il est difficilement utilisable tel quel. Il faudrait que je simplifie certaines choses et que je complète la notice.\nVous pouvez néanmoins essayer de l'installer pour corriger ce premier jet.\n\n## Découverte du thème\n\nLe thème est consultable à l'adresse : [https://github.com/bertrandkeller/jekyll-for-craftman](https://github.com/bertrandkeller/jekyll-for-craftman)\n\n## Le principe du thème\n\nL'édition ne se fait qu'à partir de fichiers de contenus dans le répertoire \"gallery\". L'idée est de créer des pages à partir d'images et d'afficher ces images (en fonction des informations contenus dans leur nom).\n\nLe rédacteur gère ses pièces ou la présentation de son activité en ajoutant simplement des images dans un répertoire.\n\nPlus d'explication à la fin de l'été.\n" }