{ "id": "/2019/10/03/audit-agence-web-eco-conception", "title": "Audit de l’impact énergie des agences web de sites éco-conçus", "url": "https://bertrandkeller.info/2019/10/03/audit-agence-web-eco-conception/", "date": 1570053600, "html": "<div class=\"btn-link\">\n<a href=\"https://lowtus.fr/audits/agences-web-eco-conception/\">Classement des agences web de sites éco-conçus</a>.\n</div>\n\n<h2 id=\"la-situation\">La situation</h2>\n\n<p>Actuellement, beaucoup de personnes et d’organisations se posent des questions sur la cohérence leur activité. Ceux qui se sont lancés dans une démarche éthique et responsable souhaitent voir leur(s) site(s) web respecter leur engagement en ayant une empreinte énergétique minimale.</p>\n\n<p>Dans des conférences/discussions concernant la réduction de la consommation d’énergie, on entend parler de sites qui ont été éco-conçus.</p>\n\n<p>Mais par qui ? Comment ? Qui sont ces agences ? Que valent leur sites ? Sont-ils (vraiment) éco-conçus ?</p>\n\n<h2 id=\"la-dmarche\">La démarche</h2>\n\n<p>J’ai fait une recherche sur le web des sites qui remontaient à la requête “agence web eco-conception”.</p>\n\n<p>J’ai ajouté ces sites à une liste. Cette liste m’a permis de lancer des tests automatisés pour déterminer des indicateurs concernant la réalisation de leur site d’agence.</p>\n\n<p><em>Si vous estimez que j’ai oublié votre site, faites moi signe je peux l’ajouter à la liste.</em></p>\n\n<h2 id=\"les-indicateurs\">Les indicateurs</h2>\n\n<p>Le classement dans la partie supérieure est basé sur un indicateur de consommation d’énergie. Il est largement inspiré de l’<a href=\"https://ecoindex.fr\">écoindex</a>. Mais je l’ai un peu modifié.</p>\n\n<p>L’indicateur énergétique est une échelle ouverte (on peut avoir plus de 100 et moins de zéro). Les bornes sont définies selon mon bon vouloir et à partir des données <a href=\"https://httparchive.org/reports/state-of-the-web\">httparchive - State of the web</a>.</p>\n\n<p><em>Il y a peut-être des indicateurs incohérents dans les temps de chargement, il faut que je corrige.</em></p>\n\n<h2 id=\"quindique-le-classement-\">Qu’indique le classement ?</h2>\n\n<p>Sur 13 agences, on trouve 6 agences qui ont vraiment un bon score ; je dirais 6 agences qui ont essayé d’avoir un bon classement à l’ecoindex (ce qui est normale pour celles qui ont suivi la formation).</p>\n\n<h3 id=\"laspect\">L’aspect</h3>\n\n<p>À partir de la 7ème place, les agences semblent avoir choisi de faire des sites plus fournis dans leur présentation et ceci au détriment du poids de la page. C’est évidemment courant de succomber aux sirènes du Design pour impressionner les clients potentiels ; il est compliqué de penser qu’on va pouvoir convaincre avec 3 blocs et 2 images ; ça peut faire pauvre.</p>\n\n<p>Pourtant les 2 premiers sites sont très plaisants et ont un message très clair. Donc on peut faire bien avec peu.</p>\n\n<h3 id=\"la-qualit\">La qualité</h3>\n\n<p>Concernant les sites classés premiers, je dirais qu’on a une très grande maîtrise de la logique d’éco-conception.</p>\n\n<p>Seulement, j’observe que quasiment aucun n’a mis en place de règles CSP (sécurité).</p>\n\n<p>Mon avis tout personnel (avec mon analyse du code de ces sites) est que le monde des agences de sites web eco-conçus est occupé en majeure partie par des petites agences ou des indépendants. Des développeurs certes responsables mais qui ne sont pas au taquet sur des règles qualités un peu high level.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Je dirais donc que sur le positionnement <strong>agence web eco-conception</strong> sur des moteurs de recherche, les clients potentiels vont trouver principalement des acteurs pour des sites vitrines (souvent en Wordpress, c’est pour dire) ; mais pas des partenaires pour une réflexion de fond sur un outillage numérique éco-conçu de leur structure.</p>\n\n<p>Le secteur d’activité est donc heureusement tout petit, ce qui permet de rencontrer des gens investis et passionnés, mais malheureusement pas forcément suffisamment mature pour répondre aux problématiques d’économie d’énergie qui se fait urgente.</p>\n\n<h2 id=\"choisir-un-partenaire\">Choisir un partenaire</h2>\n\n<p>Je vous conseille de faire appel à une de ces agences, quelque soit leur classement. Il y a parfois des questions de proximité et de feeling qui font qu’on va mener à bien ses objectifs.</p>\n\n<p>Elles sont engagées dans l’éco-conception et c’est très bien. Intéressés vous à leurs équipes et leurs forces pour faire votre choix.</p>\n\n<p><em>Je ne me suis pas mis dans le classement, mais je suis disponible pour vos questions</em></p>\n\n<p>Visiter le <a href=\"https://lowtus.fr/audits/agences-web-eco-conception/\">Classement des agences web de sites éco-conçus</a>.</p>\n", "markdown": "<div class=\"btn-link\">\n<a href=\"https://lowtus.fr/audits/agences-web-eco-conception/\">Classement des agences web de sites éco-conçus</a>.\n</div>\n\n## La situation\n\nActuellement, beaucoup de personnes et d’organisations se posent des questions sur la cohérence leur activité. Ceux qui se sont lancés dans une démarche éthique et responsable souhaitent voir leur(s) site(s) web respecter leur engagement en ayant une empreinte énergétique minimale.\n\nDans des conférences/discussions concernant la réduction de la consommation d’énergie, on entend parler de sites qui ont été éco-conçus.\n\nMais par qui ? Comment ? Qui sont ces agences ? Que valent leur sites ? Sont-ils (vraiment) éco-conçus ?\n\n## La démarche\n\nJ'ai fait une recherche sur le web des sites qui remontaient à la requête \"agence web eco-conception\".\n\nJ'ai ajouté ces sites à une liste. Cette liste m’a permis de lancer des tests automatisés pour déterminer des indicateurs concernant la réalisation de leur site d’agence.\n\n*Si vous estimez que j'ai oublié votre site, faites moi signe je peux l'ajouter à la liste.*\n\n## Les indicateurs\n\nLe classement dans la partie supérieure est basé sur un indicateur de consommation d’énergie. Il est largement inspiré de l’[écoindex](https://ecoindex.fr). Mais je l'ai un peu modifié.\n\nL’indicateur énergétique est une échelle ouverte (on peut avoir plus de 100 et moins de zéro). Les bornes sont définies selon mon bon vouloir et à partir des données [httparchive - State of the web](https://httparchive.org/reports/state-of-the-web).\n\n*Il y a peut-être des indicateurs incohérents dans les temps de chargement, il faut que je corrige.*\n\n## Qu'indique le classement ?\n\nSur 13 agences, on trouve 6 agences qui ont vraiment un bon score ; je dirais 6 agences qui ont essayé d’avoir un bon classement à l'ecoindex (ce qui est normale pour celles qui ont suivi la formation).\n\n### L’aspect\n\nÀ partir de la 7ème place, les agences semblent avoir choisi de faire des sites plus fournis dans leur présentation et ceci au détriment du poids de la page. C’est évidemment courant de succomber aux sirènes du Design pour impressionner les clients potentiels ; il est compliqué de penser qu’on va pouvoir convaincre avec 3 blocs et 2 images ; ça peut faire pauvre.\n\nPourtant les 2 premiers sites sont très plaisants et ont un message très clair. Donc on peut faire bien avec peu.\n\n### La qualité\n\nConcernant les sites classés premiers, je dirais qu’on a une très grande maîtrise de la logique d’éco-conception.\n\nSeulement, j’observe que quasiment aucun n’a mis en place de règles CSP (sécurité).\n\nMon avis tout personnel (avec mon analyse du code de ces sites) est que le monde des agences de sites web eco-conçus est occupé en majeure partie par des petites agences ou des indépendants. Des développeurs certes responsables mais qui ne sont pas au taquet sur des règles qualités un peu high level.\n\n## Conclusion\n\nJe dirais donc que sur le positionnement **agence web eco-conception** sur des moteurs de recherche, les clients potentiels vont trouver principalement des acteurs pour des sites vitrines (souvent en Wordpress, c’est pour dire) ; mais pas des partenaires pour une réflexion de fond sur un outillage numérique éco-conçu de leur structure.\n\nLe secteur d’activité est donc heureusement tout petit, ce qui permet de rencontrer des gens investis et passionnés, mais malheureusement pas forcément suffisamment mature pour répondre aux problématiques d’économie d’énergie qui se fait urgente.\n\n## Choisir un partenaire\n\nJe vous conseille de faire appel à une de ces agences, quelque soit leur classement. Il y a parfois des questions de proximité et de feeling qui font qu'on va mener à bien ses objectifs.\n\nElles sont engagées dans l'éco-conception et c’est très bien. Intéressés vous à leurs équipes et leurs forces pour faire votre choix.\n\n*Je ne me suis pas mis dans le classement, mais je suis disponible pour vos questions*\n\nVisiter le <a href=\"https://lowtus.fr/audits/agences-web-eco-conception/\">Classement des agences web de sites éco-conçus</a>.\n" }