{ "id": "/2019/12/18/netsecure-day-surface-attaque", "title": "Conférence NetSecureDay 2019 - surface d’attaque et complexité", "url": "https://bertrandkeller.info/2019/12/18/netsecure-day-surface-attaque/", "date": 1576623600, "html": "<h2 id=\"confrence-netsecureday\">Conférence NetSecureDay</h2>\n\n<p>La conférence NetSecureDay est organisée tous les ans à Rouen, elle réunie un groupe de personnes aux activités hétérogènes qui parlent plus ou moins de sécurité.</p>\n\n<p>C’est en tant que développeur de site web que je suis venu présenter mon point de vue sur la sécurité.</p>\n\n<h2 id=\"la-scurit\">La sécurité</h2>\n\n<p>Je ne connais pas très précisément le domaine de la sécurité, chaque année j’en découvre un peu plus. Dans la sécurité, on fonctionne beaucoup par scénario de test, scénario d’intrusion.</p>\n\n<p>On essaye de casser le système et on voit s’il tient. On rédige des procédures, on essaye de faire d’un côté de la prévention (éviter que ça arrive) et de la protection (éviter que ça se propage).</p>\n\n<p>Je suis intervenu avec une idée sur la prévention, qui consiste grosso-modo à faire du code moins complexe pour éviter les ouvertures pour des attaques possibles.</p>\n\n<h2 id=\"sites-critiques-vs-non-critiques\">Sites critiques Vs non critiques</h2>\n\n<p>J’ai fait le parti pris de parler non pas des sites dit <strong>critiques</strong> (applications complexes à forte valeur économique, le truc noble), mais des sites considérés comme <strong>non critique</strong> (le truc pour les non dev) mais qui, s’ils tombent, peuvent nuire à l’image de l’entreprise (par exemple)..</p>\n\n<p>Pour moi un site <strong>non critique</strong> va être ce site WordPress laissé à la Comm parce qu’elle connaît bien l’outil. La vision sécurité, (essayer de minimiser le risque) ne comprends pas ce principe car les WordPress mis en place sont des sources de dépense d’énergie.</p>\n\n<p>Pourquoi on laisse les WordPress ? Pour la bonne et simple raison que la Comm ou n’importe quel autre service a quand même le droit d’être autonome sur ses outils. Et que si on rentre sur ce terrain de discussion, la Comm ne voudra jamais perdre cet avantage ; et elle a raison.</p>\n\n<h2 id=\"tout-le-monde-gagnant-\">Tout le monde gagnant ?</h2>\n\n<p>On peut gagner sur tous les tableaux en supprimant cette pratique d’un autre âge (pour le coup, on peut dire ça je pense) en passant sur des (gestionnaires de) sites statiques.</p>\n\n<p>Les sites statiques font quasiment tout ce que peux faire un site dynamique. Ce qu’il ne fait n’est que très peu utilisé par les utilisateurs des sites dynamiques.</p>\n\n<p>Les gens pensent qu’un site statique doit être édité à la main par un développeur. Euh… en fait non, on a déjà de très belles interfaces magnifiques qui font la taf.</p>\n\n<p>Mais bon c’est vrai le changement culturel ne s’opère pas, seuls certains dev sont convaincus, y a encore du taf. Faut peut-être arrêter de prendre les gens de la Comm pour des neuneus et répondre à leurs besoins tech.</p>\n\n<p>(En plus les sites statiques sont réplicables et rendent indépendant d’un service IT, les services Comm travaillent souvent sur des landing pages, les gestionnaires de sites statiques pourraient tellement améliorer leur processus.)</p>\n\n<h2 id=\"se-poser-les-bonnes-questions\">Se poser les bonnes questions</h2>\n\n<p>Pour la baisse de complexité des outils, une moins grande dépendance technique, une meilleur durabilité un moins grande exposition aux attaques : posez vous les bonnes questions.</p>\n\n<p>Si vous avez besoin de pages statiques, générez directement des pages statiques. Cela aura un effet immédiat sur votre marge brut.</p>\n\n<p>Voir les slides de la conférence : <a href=\"https://bertrandkeller.github.io/conference-netsecure-day-surface-attaque-site-low-tech/\">Construire un site Low-Tech</a>.</p>\n", "markdown": "## Conférence NetSecureDay\n\nLa conférence NetSecureDay est organisée tous les ans à Rouen, elle réunie un groupe de personnes aux activités hétérogènes qui parlent plus ou moins de sécurité.\n\nC’est en tant que développeur de site web que je suis venu présenter mon point de vue sur la sécurité.\n\n## La sécurité\n\nJe ne connais pas très précisément le domaine de la sécurité, chaque année j'en découvre un peu plus. Dans la sécurité, on fonctionne beaucoup par scénario de test, scénario d’intrusion.\n\nOn essaye de casser le système et on voit s’il tient. On rédige des procédures, on essaye de faire d’un côté de la prévention (éviter que ça arrive) et de la protection (éviter que ça se propage).\n\nJe suis intervenu avec une idée sur la prévention, qui consiste grosso-modo à faire du code moins complexe pour éviter les ouvertures pour des attaques possibles.\n\n## Sites critiques Vs non critiques\n\nJ’ai fait le parti pris de parler non pas des sites dit **critiques** (applications complexes à forte valeur économique, le truc noble), mais des sites considérés comme **non critique** (le truc pour les non dev) mais qui, s'ils tombent, peuvent nuire à l’image de l'entreprise (par exemple)..\n\nPour moi un site **non critique** va être ce site WordPress laissé à la Comm parce qu'elle connaît bien l’outil. La vision sécurité, (essayer de minimiser le risque) ne comprends pas ce principe car les WordPress mis en place sont des sources de dépense d’énergie.\n\nPourquoi on laisse les WordPress ? Pour la bonne et simple raison que la Comm ou n'importe quel autre service a quand même le droit d’être autonome sur ses outils. Et que si on rentre sur ce terrain de discussion, la Comm ne voudra jamais perdre cet avantage ; et elle a raison.\n\n## Tout le monde gagnant ?\n\nOn peut gagner sur tous les tableaux en supprimant cette pratique d’un autre âge (pour le coup, on peut dire ça je pense) en passant sur des (gestionnaires de) sites statiques.\n\nLes sites statiques font quasiment tout ce que peux faire un site dynamique. Ce qu'il ne fait n’est que très peu utilisé par les utilisateurs des sites dynamiques.\n\nLes gens pensent qu'un site statique doit être édité à la main par un développeur. Euh… en fait non, on a déjà de très belles interfaces magnifiques qui font la taf.\n\nMais bon c'est vrai le changement culturel ne s’opère pas, seuls certains dev sont convaincus, y a encore du taf. Faut peut-être arrêter de prendre les gens de la Comm pour des neuneus et répondre à leurs besoins tech.\n\n(En plus les sites statiques sont réplicables et rendent indépendant d’un service IT, les services Comm travaillent souvent sur des landing pages, les gestionnaires de sites statiques pourraient tellement améliorer leur processus.)\n\n## Se poser les bonnes questions\n\nPour la baisse de complexité des outils, une moins grande dépendance technique, une meilleur durabilité un moins grande exposition aux attaques : posez vous les bonnes questions.\n\nSi vous avez besoin de pages statiques, générez directement des pages statiques. Cela aura un effet immédiat sur votre marge brut.\n\nVoir les slides de la conférence : [Construire un site Low-Tech](https://bertrandkeller.github.io/conference-netsecure-day-surface-attaque-site-low-tech/).\n" }