{ "id": "/2017/09/22/page-generateur-site-statique", "title": "Liste de mes articles sur les générateurs de site statique", "url": "https://bertrandkeller.info/2017/09/22/page-generateur-site-statique/", "date": 1506031200, "html": "<p>Je devrais certainement écrire plus d’articles sur les générateurs de site statique, faire des liens vers plus de ressources ou présenter quelques petits articles de démonstration.</p>\n\n<p>Ce n’est pas chose évidente tant les utilisations sont disparates. Mais, il doit être possible de mieux faire.</p>\n\n<p>Néanmoins, je serais présent à Paris Web 2017 pour un petit atelier <a href=\"https://www.paris-web.fr/2017/ateliers/decliner-des-sites-statiques-performants-avec-un-gss-jekyll-hugo.php\">Décliner des sites statiques performants avec un GSS (Jekyll, Hugo…)</a> durant lequel j’essayerai de faire un petit parcours de la mise en place d’un site tout simple avec Jekyll.</p>\n\n<p>De plus, vous pouvez aussi consulter la page qui liste une série d’articles que j’ai écris depuis maintenant 4 ans sur le sujet des <a href=\"/generateur-site-statique/\">générateurs de site statique</a>.</p>\n\n", "markdown": "Je devrais certainement écrire plus d'articles sur les générateurs de site statique, faire des liens vers plus de ressources ou présenter quelques petits articles de démonstration.\n\nCe n'est pas chose évidente tant les utilisations sont disparates. Mais, il doit être possible de mieux faire.\n\nNéanmoins, je serais présent à Paris Web 2017 pour un petit atelier [Décliner des sites statiques performants avec un GSS (Jekyll, Hugo…)](https://www.paris-web.fr/2017/ateliers/decliner-des-sites-statiques-performants-avec-un-gss-jekyll-hugo.php) durant lequel j'essayerai de faire un petit parcours de la mise en place d'un site tout simple avec Jekyll.\n\nDe plus, vous pouvez aussi consulter la page qui liste une série d'articles que j'ai écris depuis maintenant 4 ans sur le sujet des [générateurs de site statique](/generateur-site-statique/).\n\n" }