{ "id": "/2017/11/06/netflix-react-generateur-site-statique", "title": "Netflix abandonne React.js pour ses landing pages", "url": "https://bertrandkeller.info/2017/11/06/netflix-react-generateur-site-statique/", "date": 1509922800, "html": "<blockquote>\n <p>By getting rid of React and moving to plain JavaScript, we saw a 50% reduction in our Time to interactive metric.</p>\n</blockquote>\n\n<p>Jake Archibald nous propose un petit article sur la démarche : <a href=\"https://jakearchibald.com/2017/netflix-and-react/\">Netflix functions without client-side React, and it’s a good thing</a>.</p>\n\n<p><strong>Charger :</strong></p>\n\n<ul>\n <li>Charger le HTML &amp; CSS en parallèle.</li>\n <li>Attendre la fin du chargement CSS et les exécuter.</li>\n <li>Afficher, et continuer le rendu en tant que HTML.</li>\n</ul>\n\n<p><strong>… est toujours plus rapide que de :</strong></p>\n\n<ul>\n <li>Charger le HTML (très léger).</li>\n <li>Charger le CSS &amp; JS en parallèle.</li>\n <li>Attendre la fin du chargement CSS et les exécuter.</li>\n <li>Attendre la fin du chargement JS et les exécuter.<br/>\n(Dans la plupart des cas, les SPAs attendent jusqu’à ce point pour commencer le chargement des données).</li>\n <li>Mettre à jour le DOM et afficher.</li>\n</ul>\n\n<p>Ainsi Netflix est passé de la seconde option à la première. C’est-à-dire que plutôt qu’afficher le contenu en passant par du JS, ils ont simplement préféré afficher de simples pages HTML (pages statiques).</p>\n\n<h2 id=\"le-fonctionnement\">Le fonctionnement</h2>\n\n<p>Les technologies web permettent d’afficher des pages selon différentes manières. Vous pouvez tout aussi bien proposer un chemin de chargement de pages très compliqué et tordu pour les navigateurs web ou alors essayer d’optimiser ce chemin de chargement pour qu’il soit le plus simple possible.</p>\n\n<p>Aujourd’hui avec la multiplicité des FrameWorks JS (React.js, Angular.js, Vue.js…), les développeurs ont tendance à les utiliser pour tous les types d’interfaces. Malheureusement pour des simples pages de contenus (certainement 90 % ou 95 % des pages du web), le chemin de chargement (option 2 ci-dessus) reste trop compliqué.</p>\n\n<blockquote>\n <p>Netflix uses React on the client and server, but they identified that the client-side portion wasn’t needed for the first interaction, so they leaned on what the browser can already do, and deferred client-side React.</p>\n</blockquote>\n\n<h2 id=\"prise-de-conscience\">Prise de conscience</h2>\n\n<p>C’est assez risible pour des intégrateurs comme moi qui militons depuis des années pour une optimisation des pages sans JS inutiles de voir les développeurs de Netflix faire ce revirement.</p>\n\n<p>Depuis plusieurs années, les offres d’embauches de développeurs Front “à tout faire” sont pléthore ; les entreprises donnent la réalisation des interfaces à des développeurs JS qui souvent (mais pas tout le temps) utilisent une techno parce qu’on leur demande alors qu’elle n’est pas forcément justifiée.</p>\n\n<p>La volonté d’utiliser des technologies à la mode a détourné certaines équipes de ce que les utilisateurs avaient vraiment besoin.</p>\n\n<h2 id=\"les-gnrateurs-de-site-statique\">Les générateurs de site statique</h2>\n\n<p>Encore et toujours je reviens sur les <a href=\"/generateur-site-statique/\">générateurs de site statique</a> ; pendant que certains se concentrent sur la maintenance de leur plateforme propulsée par du JavaScript d’autres se sont penchés sur des technologies plus simples.</p>\n\n<p>Utiliser du Markdown, c’est dégagé du temps de réflexion sur les processus d’édition et le développement d’interfaces. Le développement d’applications et la publication de pages web sont 2 métiers différents et complémentaires.</p>\n\n<p>Pour des interfaces performantes, ne pas négliger la présence dans une équipe d’un intégrateur aguerri qui aura à cœur de prendre soin de la stratégie éditoriale de pages web.</p>\n", "markdown": "> By getting rid of React and moving to plain JavaScript, we saw a 50% reduction in our Time to interactive metric.\n\nJake Archibald nous propose un petit article sur la démarche : [Netflix functions without client-side React, and it's a good thing](https://jakearchibald.com/2017/netflix-and-react/).\n\n**Charger :**\n\n* Charger le HTML & CSS en parallèle.\n* Attendre la fin du chargement CSS et les exécuter.\n* Afficher, et continuer le rendu en tant que HTML.\n\n**… est toujours plus rapide que de :**\n\n* Charger le HTML (très léger).\n* Charger le CSS & JS en parallèle.\n* Attendre la fin du chargement CSS et les exécuter.\n* Attendre la fin du chargement JS et les exécuter. \n(Dans la plupart des cas, les SPAs attendent jusqu'à ce point pour commencer le chargement des données).\n* Mettre à jour le DOM et afficher.\n\nAinsi Netflix est passé de la seconde option à la première. C'est-à-dire que plutôt qu'afficher le contenu en passant par du JS, ils ont simplement préféré afficher de simples pages HTML (pages statiques).\n\n## Le fonctionnement\n\nLes technologies web permettent d'afficher des pages selon différentes manières. Vous pouvez tout aussi bien proposer un chemin de chargement de pages très compliqué et tordu pour les navigateurs web ou alors essayer d'optimiser ce chemin de chargement pour qu'il soit le plus simple possible.\n\nAujourd'hui avec la multiplicité des FrameWorks JS (React.js, Angular.js, Vue.js…), les développeurs ont tendance à les utiliser pour tous les types d'interfaces. Malheureusement pour des simples pages de contenus (certainement 90&#8239;% ou 95&#8239;% des pages du web), le chemin de chargement (option 2 ci-dessus) reste trop compliqué.\n\n> Netflix uses React on the client and server, but they identified that the client-side portion wasn't needed for the first interaction, so they leaned on what the browser can already do, and deferred client-side React.\n\n## Prise de conscience\n\nC'est assez risible pour des intégrateurs comme moi qui militons depuis des années pour une optimisation des pages sans JS inutiles de voir les développeurs de Netflix faire ce revirement.\n\nDepuis plusieurs années, les offres d'embauches de développeurs Front \"à tout faire\" sont pléthore ; les entreprises donnent la réalisation des interfaces à des développeurs JS qui souvent (mais pas tout le temps) utilisent une techno parce qu'on leur demande alors qu'elle n'est pas forcément justifiée.\n\nLa volonté d'utiliser des technologies à la mode a détourné certaines équipes de ce que les utilisateurs avaient vraiment besoin.\n\n## Les générateurs de site statique\n\nEncore et toujours je reviens sur les [générateurs de site statique](/generateur-site-statique/) ; pendant que certains se concentrent sur la maintenance de leur plateforme propulsée par du JavaScript d'autres se sont penchés sur des technologies plus simples.\n\nUtiliser du Markdown, c'est dégagé du temps de réflexion sur les processus d'édition et le développement d'interfaces. Le développement d'applications et la publication de pages web sont 2 métiers différents et complémentaires.\n\nPour des interfaces performantes, ne pas négliger la présence dans une équipe d'un intégrateur aguerri qui aura à cœur de prendre soin de la stratégie éditoriale de pages web.\n" }