{ "id": "/2016/07/01/entreprise-inversee-contrat", "title": "L'entreprise inversée - le contrat", "url": "https://bertrandkeller.info/2016/07/01/entreprise-inversee-contrat/", "date": 1467324000, "html": "<h2 id=\"la-socit-productiviste\">La société productiviste</h2>\n\n<p>Dans la société productiviste, l’employé est lié par un contrat de travail dans lequel il vend sa force de travail. En retour l’entreprise par laquelle il est employé doit lui donner des tâches à réaliser. Par ce contrat, l’entreprise est en droit d’exiger la réalisation d’un travail et l’employé de ne se limiter à faire que se qui est indiqué dans les conditions du dit contrat (le poste).</p>\n\n<p>Le contrat est essentiel pour gérer le rapport de force entre les différentes parties, mais cette relation dominante/dominée reste très infantilisante ; surtout dans un droit ou l’employeur possède les moyens de production (l’employeur a tous les droits).</p>\n\n<p>Elle l’est d’autant plus lorsque le temps de travail est important car une personne qui passe la majeure partie de son temps dans une entreprise n’exerce son droit de citoyens qu’à travers cette entreprise donc dans une situation de dominée.\nCe qui explique que quand les dominés sont mécontents, ils s’expriment dans une relation de force par rapport à leur dominant c’est-à-dire par la grève.</p>\n\n<h2 id=\"lentreprise-inverse\">L’entreprise inversée</h2>\n\n<p>Il serait bien entendu plus logique que, pour avoir une relation égalitaire dans l’entreprise, la suppression de la propriété commerciale serait un bon début (<a href=\"http://www.anarchie.be/AL/15/chiant.htm\">Anarchie et propriété</a>).</p>\n\n<p>Mais avant que la société n’entame de vraies révolutions. Intéressons nous aux moyens de production.</p>\n\n<p>La politique de la cité (Polis) est une discussion entre citoyens libres et autonomes, dans un espace physique au sein d’un État souverain.</p>\n\n<p>Dans l’entreprise inversée pas besoin de potasser l’holacratie ou la sociocratie, ce ne sont que des moyens. Les collaborateurs partent juste du principe que les personnes présentes sont les bonnes personnes et que leur objectif est de gérer un espace et des machines au sein d’une structure étatique plus large.</p>\n\n<p>C’est-à-dire que quelque soit la structure de l’entreprise, les relations entre les personnes sont définies par l’exercice de la qualité de citoyen de chacun.</p>\n\n<p>Quand on se parle, on demande si chacun des participants a des soucis à régler sans sa propre vie (si oui, on cherche à l’aider), si des outils de travail ont besoin d’attention (si oui, on cherche à l’entretenir), si des partenaires ont difficultés à résoudre ou objectifs à atteindre (si oui, on cherche à le conseiller), si le territoire avoisinant a évolué (si oui, on cherche à savoir en quoi)…</p>\n\n<p>L’équipe évolue en fonction du besoin de remettre en cause un écosystème et non pas de le maîtriser.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Ce qui distingue l’entreprise inversée de tout autre système comme l’holacratie, l’entreprise libérée…, c’est l’acte de pouvoir exercer son rôle de citoyen au sein de l’entreprise.</p>\n\n<p>A partir de la prise en considération de l’intégration d’une entreprise dans le cadre de la cité, les actions des chacun au sein de cette entité “entreprise” trouve une logique qui va permettre à chacun de retrouver une raison d’être et ainsi de pouvoir trouver les raisons de la transformation de la structure.\nLe but unique est la survivance du groupe dans le temps (plus seulement de l’entité “entreprise” ou des moyens de productions).</p>\n\n<p>On retrouve ainsi le sens originale de l’action d’entreprendre ou d’entreprise hors de la vision capitaliste matérialiste.</p>\n", "markdown": "## La société productiviste\n\nDans la société productiviste, l'employé est lié par un contrat de travail dans lequel il vend sa force de travail. En retour l'entreprise par laquelle il est employé doit lui donner des tâches à réaliser. Par ce contrat, l'entreprise est en droit d'exiger la réalisation d'un travail et l'employé de ne se limiter à faire que se qui est indiqué dans les conditions du dit contrat (le poste).\n\nLe contrat est essentiel pour gérer le rapport de force entre les différentes parties, mais cette relation dominante/dominée reste très infantilisante ; surtout dans un droit ou l'employeur possède les moyens de production (l'employeur a tous les droits).\n\nElle l'est d'autant plus lorsque le temps de travail est important car une personne qui passe la majeure partie de son temps dans une entreprise n'exerce son droit de citoyens qu'à travers cette entreprise donc dans une situation de dominée.\nCe qui explique que quand les dominés sont mécontents, ils s'expriment dans une relation de force par rapport à leur dominant c'est-à-dire par la grève.\n\n## L'entreprise inversée\n\nIl serait bien entendu plus logique que, pour avoir une relation égalitaire dans l'entreprise, la suppression de la propriété commerciale serait un bon début ([Anarchie et propriété](http://www.anarchie.be/AL/15/chiant.htm)).\n\nMais avant que la société n'entame de vraies révolutions. Intéressons nous aux moyens de production.\n\nLa politique de la cité (Polis) est une discussion entre citoyens libres et autonomes, dans un espace physique au sein d'un État souverain.\n\nDans l'entreprise inversée pas besoin de potasser l'holacratie ou la sociocratie, ce ne sont que des moyens. Les collaborateurs partent juste du principe que les personnes présentes sont les bonnes personnes et que leur objectif est de gérer un espace et des machines au sein d'une structure étatique plus large.\n\nC'est-à-dire que quelque soit la structure de l'entreprise, les relations entre les personnes sont définies par l'exercice de la qualité de citoyen de chacun.\n\nQuand on se parle, on demande si chacun des participants a des soucis à régler sans sa propre vie (si oui, on cherche à l'aider), si des outils de travail ont besoin d'attention (si oui, on cherche à l'entretenir), si des partenaires ont difficultés à résoudre ou objectifs à atteindre (si oui, on cherche à le conseiller), si le territoire avoisinant a évolué (si oui, on cherche à savoir en quoi)…\n\nL'équipe évolue en fonction du besoin de remettre en cause un écosystème et non pas de le maîtriser.\n\n## Conclusion\n\nCe qui distingue l'entreprise inversée de tout autre système comme l'holacratie, l'entreprise libérée…, c'est l'acte de pouvoir exercer son rôle de citoyen au sein de l'entreprise.\n\nA partir de la prise en considération de l'intégration d'une entreprise dans le cadre de la cité, les actions des chacun au sein de cette entité \"entreprise\" trouve une logique qui va permettre à chacun de retrouver une raison d'être et ainsi de pouvoir trouver les raisons de la transformation de la structure.\nLe but unique est la survivance du groupe dans le temps (plus seulement de l'entité \"entreprise\" ou des moyens de productions).\n\nOn retrouve ainsi le sens originale de l'action d'entreprendre ou d'entreprise hors de la vision capitaliste matérialiste.\n" }