{ "id": "/2019/09/10/moins-1-pourcent-sites-accessibles", "title": "Moins de 1% des pages d'accueil de sites Web respectent les normes d’accessibilité", "url": "https://bertrandkeller.info/2019/09/10/moins-1-pourcent-sites-accessibles/", "date": 1568066400, "html": "<p>On parle du respect d’autrui, de consommer moins, de faire du web de qualité… rendez-vous compte moins de 1% des pages web testées dans cette étude respectent des standards d’accessibilité.</p>\n\n<blockquote>\n <p>Le rapport WebAIM a révélé que 97,8% des pages d’accueil présentaient des défaillances 2 AA détectées automatiquement des Directives pour l’accessibilité au contenu Web (WCAG). La norme WCAG 2 AA est utilisée comme point de départ pour les sites Web du gouvernement britannique et est considérée comme une norme générale d’accessibilité du Web.</p>\n</blockquote>\n\n<h2 id=\"la-qualit\">La qualité</h2>\n\n<p>Imaginez une batterie de développeurs payés un pont d’or dans vos équipes, codant à longueur de journées… même pas capable de respecter des règles basiques de structures de pages web. Pas capable d’avoir un test automatisé sur de l’accessibilité en place.</p>\n\n<p>De quelle manière forme-t-on, embauche-t-on des travailleurs du web pour que même pas 1% des sites web soient considérés conforme à l’accessibilité ?</p>\n\n<p>Alors oui, effectivement, je le répète la personne ou les personnes chargées de coder regardent ailleurs, elles ont d’autres préoccupations. Un site web est complexe et il est difficile de blâmer qui que ce soit.</p>\n\n<p>Mais cette étude nous montre que les personnes qui composent les équipes de développement ne considèrent pas nécessaire d’avoir une personne compétente dans le domaine de la qualité des interfaces.</p>\n\n<p>Effectivement, ça ne crée pas de “valeur” perceptible (financière) sur un projet web.</p>\n\n<h2 id=\"nos-erreurs\">Nos erreurs</h2>\n\n<h3 id=\"les-erreurs-constates\">Les erreurs constatées</h3>\n\n<p>Voilà ce qu’on constate comme type d’erreurs récurrentes sur les pages web :</p>\n\n<ul>\n <li>Faible contraste</li>\n <li>Texte alternatif manquant</li>\n <li>Liens</li>\n <li>Label de formulaire manquantes</li>\n <li>Langue de document manquante</li>\n <li>Boutons vides</li>\n</ul>\n\n<p>Du grand classique, tout cela est dû à un manque de connaissance des exigences d’accessibilité et de rigueur dans leur application. En effet, pour avoir de la qualité, il ne faut pas penser à appliquer une règle de temps en temps mais tout le temps.</p>\n\n<p>Si en plus il n’y avait que ça :</p>\n\n<blockquote>\n <p>Selon WedAIM, les outils automatisés, y compris WAVE, ne détectent que très peu de problèmes d’accessibilité : seuls 25% environ des défaillances de conformité possibles peuvent être détectées automatiquement.</p>\n</blockquote>\n\n<p>Et oui, on ne parle que de tests automatisés, on ne parle même pas de tests d’accessibilité qui ne sont pas automatisables. C’est pour vous dire si on peut améliorer les interfaces.</p>\n\n<h2 id=\"mon-ressenti\">Mon ressenti</h2>\n\n<p>Que des pages web ne soient pas conformes à certaines règles d’accessibilité, c’est bien dommage. Mais après tout est-ce si grave ? Franchement, la terre continue de tourner.</p>\n\n<p>En revanche, si jamais vous aviez envie de faire votre travail avec un peu plus d’éthique, mettre en ligne des pages plus robustes, qui vous coûte moins chères à charger ; je pense que le passage à l’état actuel de vos interfaces web à un état plus qualitatif n’est pas gagné.</p>\n\n<p>Même si dans l’immédiat, on peut corriger un grand nombre de choses facilement, la mise en place d’un modèle de conception eco-responsable n’est absolument pas gagné, cela devrait demander du temps.</p>\n\n<p>Se lancer dans la mise en place d’un site web <a href=\"/low-tech-site-web-internet/\">Low-Tech</a> ne consiste pas mettre en ligne un site minimaliste. Cela consiste à mettre en place un code le plus simple et le plus robuste pour répondre à un besoin identifié et surtout ne pas avoir à refondre (débugguer) le code de manière permanente.</p>\n\n<p>Lire <a href=\"https://abilitynet.org.uk/news-blogs/less-1-website-home-pages-are-likely-meet-accessibility-standards\">Less than 1% of website home pages are likely to meet accessibility standards </a>.</p>\n", "markdown": "On parle du respect d’autrui, de consommer moins, de faire du web de qualité… rendez-vous compte moins de 1% des pages web testées dans cette étude respectent des standards d’accessibilité.\n\n> Le rapport WebAIM a révélé que 97,8% des pages d'accueil présentaient des défaillances 2 AA détectées automatiquement des Directives pour l'accessibilité au contenu Web (WCAG). La norme WCAG 2 AA est utilisée comme point de départ pour les sites Web du gouvernement britannique et est considérée comme une norme générale d’accessibilité du Web.\n\n## La qualité\n\nImaginez une batterie de développeurs payés un pont d’or dans vos équipes, codant à longueur de journées… même pas capable de respecter des règles basiques de structures de pages web. Pas capable d’avoir un test automatisé sur de l’accessibilité en place.\n\nDe quelle manière forme-t-on, embauche-t-on des travailleurs du web pour que même pas 1% des sites web soient considérés conforme à l’accessibilité ?\n\nAlors oui, effectivement, je le répète la personne ou les personnes chargées de coder regardent ailleurs, elles ont d’autres préoccupations. Un site web est complexe et il est difficile de blâmer qui que ce soit.\n\nMais cette étude nous montre que les personnes qui composent les équipes de développement ne considèrent pas nécessaire d’avoir une personne compétente dans le domaine de la qualité des interfaces.\n\nEffectivement, ça ne crée pas de \"valeur\" perceptible (financière) sur un projet web.\n\n## Nos erreurs\n\n### Les erreurs constatées\n\nVoilà ce qu'on constate comme type d’erreurs récurrentes sur les pages web :\n\n - Faible contraste\n - Texte alternatif manquant\n - Liens\n - Label de formulaire manquantes\n - Langue de document manquante\n - Boutons vides\n\nDu grand classique, tout cela est dû à un manque de connaissance des exigences d’accessibilité et de rigueur dans leur application. En effet, pour avoir de la qualité, il ne faut pas penser à appliquer une règle de temps en temps mais tout le temps.\n\nSi en plus il n’y avait que ça :\n\n> Selon WedAIM, les outils automatisés, y compris WAVE, ne détectent que très peu de problèmes d’accessibilité : seuls 25% environ des défaillances de conformité possibles peuvent être détectées automatiquement.\n\nEt oui, on ne parle que de tests automatisés, on ne parle même pas de tests d’accessibilité qui ne sont pas automatisables. C'est pour vous dire si on peut améliorer les interfaces.\n\n## Mon ressenti\n\nQue des pages web ne soient pas conformes à certaines règles d’accessibilité, c’est bien dommage. Mais après tout est-ce si grave ? Franchement, la terre continue de tourner.\n\nEn revanche, si jamais vous aviez envie de faire votre travail avec un peu plus d’éthique, mettre en ligne des pages plus robustes, qui vous coûte moins chères à charger ; je pense que le passage à l’état actuel de vos interfaces web à un état plus qualitatif n’est pas gagné.\n\nMême si dans l’immédiat, on peut corriger un grand nombre de choses facilement, la mise en place d’un modèle de conception eco-responsable n'est absolument pas gagné, cela devrait demander du temps.\n\nSe lancer dans la mise en place d’un site web [Low-Tech](/low-tech-site-web-internet/) ne consiste pas mettre en ligne un site minimaliste. Cela consiste à mettre en place un code le plus simple et le plus robuste pour répondre à un besoin identifié et surtout ne pas avoir à refondre (débugguer) le code de manière permanente.\n\nLire [Less than 1% of website home pages are likely to meet accessibility standards ](https://abilitynet.org.uk/news-blogs/less-1-website-home-pages-are-likely-meet-accessibility-standards).\n" }