{ "id": "/2017/07/03/jekyll-hugo-sont-bateau", "title": "Jekyll et Hugo sont dans un bateau", "url": "https://bertrandkeller.info/2017/07/03/jekyll-hugo-sont-bateau/", "date": 1499032800, "html": "<p>Les générateurs de sites statiques sont géniaux, ils font le thé et le café en étant super rapides ; mais des GSS, il y en a la dose ; se lancer dans la maîtrise d’un en particulier demande du temps. Alors, on revoit fleurir, comme pour toutes les technologies, des oppositions entre les avantages de tel ou tel GSS.</p>\n\n<h2 id=\"hugo-en-mode-turbo\">Hugo en mode Turbo</h2>\n\n<p>Actuellement le développement de Jekyll n’apporte plus de grandes fonctionnalités, il correspond aux besoins de Github (Avec github Pages) ; c’est-à-dire permettre d’éditer un site simple à partir d’un vulgaire dépôt de contenu (Chargement d’une thème avec 1 fichier de configuration).</p>\n\n<p>Grandement limité par sa vitesse d’exécution, les themers de GSS se tourne vers Hugo qui propose des performances ahurissantes (de la seconde pour Jekyll à la milliseconde pour Hugo). Le langage Go va bien plus vite que Ruby, mais c’est oublier aussi que Hugo n’a ni les même objectifs, ni la même largeur de spectre que Jekyll.</p>\n\n<h2 id=\"la-compilation-sass\">La compilation Sass</h2>\n\n<p>Sass est un preprocesseur CSS (encore utilisé par les développeurs d’un certain âge) permettant d’ajouter des règles et variables dans ses fichiers de mise en forme (CSS).</p>\n\n<h3 id=\"jekyll\">Jekyll</h3>\n<p>Jekyll inclut nativement la compilation de fichier Sass. Un simple fichier (.scss) peut appeler un thème entier et sera compilé avec le même nom de fichier en ajoutant l’extension .css.</p>\n\n<h3 id=\"hugo\">Hugo</h3>\n<p>Quand vous passez à Hugo, pas de compilation native de Sass. Que faire ? Soit passer par un software sur votre machine pour compiler, soit lancer une commande dans votre terminal (type node-sass), soit installer Gulp (Node.js).</p>\n\n<p>Ne cherchez pas, Hugo n’intègre pas et n’intégra pas la compilation de Sass car c’est un besoin spécifique qui ne sera peut-être plus nécessaire à long terme. Il est logique que cette fonctionnalité ne soit pas prise en compte par le cœur de Hugo et qu’elle soit déléguée à un autre outil.</p>\n\n<h2 id=\"les-images-responsives\">Les images responsives</h2>\n\n<p>Un site qui se veut performant se doit de permettre la mise en place d’un code pour le chargement d’images responsives (sizes ou srcset).</p>\n\n<h3 id=\"jekyll-1\">Jekyll</h3>\n<p>Jekyll propose de multiples plugins pour afficher des images responsives. Il suffit d’installer le plugin et d’intégrer les bouts de codes nécessaires pour généraliser la présence de ces images sur votre site. Le problème reste que la génération des formats d’images reste assez longue et plombe la compilation de votre site (il n’est pas facile de désactiver tout cela dans un contexte de développement).</p>\n\n<p>Le plugin le plus performant reste celui de fantastique Nicolas Hoizey (<a href=\"https://nhoizey.github.io/jekyll-cloudinary/\">Jekyll cloudinary</a>) ; son seul défaut est de devoir se créer un compte sur un service externe.</p>\n\n<h3 id=\"hugo-1\">Hugo</h3>\n<p>Hugo, lui, propose la possibilité d’insérer le code pour sizes ou srcset, mais je n’ai rien trouvé pour la génération (on-the-fly) des images aux différents formats.</p>\n\n<p>Pour le moment, j’ai ajouté le module <a href=\"https://www.npmjs.com/package/gulp-gm\">gulp-gm</a> à mon fichier Gulp général avec les règles de génération dans trois formats de mon choix. Encore une fois, Hugo délègue une tâche automatisée à un script externe.</p>\n\n<h2 id=\"le-moteur-de-recherche-algolia\">Le moteur de recherche Algolia</h2>\n\n<p>Algolia est un service externe permettant d’ajouter un moteur de recherche performant sur son site. Pour fonctionner, il nécessite de nourrir un index qui se trouve chez lui (chez Algolia). Il est donc nécessaire de pouvoir aussi mettre à jour l’index à la volée à chaque mise à jour du dépôt.</p>\n\n<h3 id=\"jekyll-2\">Jekyll</h3>\n<p>Pour Jekyll, pas de souci, un plugin existe : <a href=\"https://github.com/algolia/algoliasearch-jekyll\">algoliasearch-jekyll</a>, développé par notre dévoué Tim Carry. On suit laborieusement le fichier de configuration et, une fois mis en place, l’index sera mis à jour à chaque génération du site.</p>\n\n<h3 id=\"hugo-2\">Hugo</h3>\n<p>Pas de plugin algoliasearch-hugo. Ce serait tellement génial d’avoir ce plugin pour Hugo, comme pour Jekyll. Mais hugo étant codé en Go, cela demande pas mal de ressources à Algolia pour développer un plugin qui ne présente pas pour le moment de besoin commercial fort.</p>\n\n<p>Personnellement, je ne me suis pas embêté, j’installe le plugin Jekyll sur mon dépôt, je configure un petit hook pour modifier le chemin des collections et de la metadonnées “url” (nécessaire pour générer des liens) pour l’index Algolia et je configure mon dépôt pour la mise à jour de l’index Algolia à chaque modification du dépôt.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n<p>Les tutoriaux “hello world” semblent toujours présenter des technologies sous leur jour le plus prometteur. Jekyll et Hugo sont 2 outils très puissants mais qui n’ont pas les mêmes philosophies.</p>\n\n<p>Ainsi passer à Hugo peut présenter certaines déconvenues dans le cas où l’ont désire mettre en place des choses précises (et qu’on vient d’une autre techno qu’on maîtrisait). De plus il demande de passer par du Node.js pour le scripting, là ou Jekyll utilise Ruby c’est-à-dire le même langage avec lequel il est codé.</p>\n\n<p>Cet article montre que, parfois, il faut savoir utiliser des solutions hybrides pour avancer.</p>\n\n<p>Si Jekyll, Hugo et tous les autres étaient donc dans un bateau et bien je pense qu’il faudrait savoir donner sa chance à chacun de ces petits outils car ils peuvent répondre rapidement à des besoins simples.</p>\n", "markdown": "Les générateurs de sites statiques sont géniaux, ils font le thé et le café en étant super rapides ; mais des GSS, il y en a la dose ; se lancer dans la maîtrise d'un en particulier demande du temps. Alors, on revoit fleurir, comme pour toutes les technologies, des oppositions entre les avantages de tel ou tel GSS.\n\n## Hugo en mode Turbo\n\nActuellement le développement de Jekyll n'apporte plus de grandes fonctionnalités, il correspond aux besoins de Github (Avec github Pages) ; c'est-à-dire permettre d'éditer un site simple à partir d'un vulgaire dépôt de contenu (Chargement d'une thème avec 1 fichier de configuration).\n\nGrandement limité par sa vitesse d'exécution, les themers de GSS se tourne vers Hugo qui propose des performances ahurissantes (de la seconde pour Jekyll à la milliseconde pour Hugo). Le langage Go va bien plus vite que Ruby, mais c'est oublier aussi que Hugo n'a ni les même objectifs, ni la même largeur de spectre que Jekyll.\n\n## La compilation Sass\n\nSass est un preprocesseur CSS (encore utilisé par les développeurs d'un certain âge) permettant d'ajouter des règles et variables dans ses fichiers de mise en forme (CSS).\n\n### Jekyll\nJekyll inclut nativement la compilation de fichier Sass. Un simple fichier (.scss) peut appeler un thème entier et sera compilé avec le même nom de fichier en ajoutant l'extension .css.\n\n### Hugo\nQuand vous passez à Hugo, pas de compilation native de Sass. Que faire ? Soit passer par un software sur votre machine pour compiler, soit lancer une commande dans votre terminal (type node-sass), soit installer Gulp (Node.js).\n\nNe cherchez pas, Hugo n'intègre pas et n'intégra pas la compilation de Sass car c'est un besoin spécifique qui ne sera peut-être plus nécessaire à long terme. Il est logique que cette fonctionnalité ne soit pas prise en compte par le cœur de Hugo et qu'elle soit déléguée à un autre outil.\n\n## Les images responsives\n\nUn site qui se veut performant se doit de permettre la mise en place d'un code pour le chargement d'images responsives (sizes ou srcset).\n\n### Jekyll\nJekyll propose de multiples plugins pour afficher des images responsives. Il suffit d'installer le plugin et d'intégrer les bouts de codes nécessaires pour généraliser la présence de ces images sur votre site. Le problème reste que la génération des formats d'images reste assez longue et plombe la compilation de votre site (il n'est pas facile de désactiver tout cela dans un contexte de développement).\n\nLe plugin le plus performant reste celui de fantastique Nicolas Hoizey ([Jekyll cloudinary](https://nhoizey.github.io/jekyll-cloudinary/)) ; son seul défaut est de devoir se créer un compte sur un service externe.\n\n### Hugo\nHugo, lui, propose la possibilité d'insérer le code pour sizes ou srcset, mais je n'ai rien trouvé pour la génération (on-the-fly) des images aux différents formats. \n\nPour le moment, j'ai ajouté le module [gulp-gm](https://www.npmjs.com/package/gulp-gm) à mon fichier Gulp général avec les règles de génération dans trois formats de mon choix. Encore une fois, Hugo délègue une tâche automatisée à un script externe.\n\n## Le moteur de recherche Algolia\n\nAlgolia est un service externe permettant d'ajouter un moteur de recherche performant sur son site. Pour fonctionner, il nécessite de nourrir un index qui se trouve chez lui (chez Algolia). Il est donc nécessaire de pouvoir aussi mettre à jour l'index à la volée à chaque mise à jour du dépôt.\n\n### Jekyll\nPour Jekyll, pas de souci, un plugin existe : [algoliasearch-jekyll](https://github.com/algolia/algoliasearch-jekyll), développé par notre dévoué Tim Carry. On suit laborieusement le fichier de configuration et, une fois mis en place, l'index sera mis à jour à chaque génération du site.\n\n### Hugo\nPas de plugin algoliasearch-hugo. Ce serait tellement génial d'avoir ce plugin pour Hugo, comme pour Jekyll. Mais hugo étant codé en Go, cela demande pas mal de ressources à Algolia pour développer un plugin qui ne présente pas pour le moment de besoin commercial fort.\n\nPersonnellement, je ne me suis pas embêté, j'installe le plugin Jekyll sur mon dépôt, je configure un petit hook pour modifier le chemin des collections et de la metadonnées \"url\" (nécessaire pour générer des liens) pour l'index Algolia et je configure mon dépôt pour la mise à jour de l'index Algolia à chaque modification du dépôt.\n\n## Conclusion\nLes tutoriaux \"hello world\" semblent toujours présenter des technologies sous leur jour le plus prometteur. Jekyll et Hugo sont 2 outils très puissants mais qui n'ont pas les mêmes philosophies.\n\nAinsi passer à Hugo peut présenter certaines déconvenues dans le cas où l'ont désire mettre en place des choses précises (et qu'on vient d'une autre techno qu'on maîtrisait). De plus il demande de passer par du Node.js pour le scripting, là ou Jekyll utilise Ruby c'est-à-dire le même langage avec lequel il est codé.\n\nCet article montre que, parfois, il faut savoir utiliser des solutions hybrides pour avancer.\n\nSi Jekyll, Hugo et tous les autres étaient donc dans un bateau et bien je pense qu'il faudrait savoir donner sa chance à chacun de ces petits outils car ils peuvent répondre rapidement à des besoins simples.\n" }