{ "id": "/2020/07/03/site-low-tech-internet-coupe", "title": "L’Éthiopie coupe internet, de l’intérêt des sites Low-Tech", "url": "https://bertrandkeller.info/2020/07/03/site-low-tech-internet-coupe/", "date": 1593727200, "html": "<p>Résumons, l’idée d‘un site Low-Tech n‘est pas de faire un site bas de gamme. L’idée est d’avoir un site qui fonctionne à faible coût (ressources humaines, financières, énergétique…), mais qui est aussi robuste donc qui fonctionne en situation de crise.</p>\n\n<p>Cette semaine suite à une affaire interne qui pourrait raviver des tensions entre populations, le gouvernement éthiopien a décidé de couper les communications passant par Internet. Le pays est donc coupé du monde et sans possibilité de communiquer en interne.</p>\n\n<div class=\"center\">\n\t{% twitter https://twitter.com/wycats/status/1278937131541499904 %}\n</div>\n\n<h2 id=\"la-crise\">La crise</h2>\n\n<p>Oui, on peut penser que ça peut éviter que des informations de rébellion se répandent, mais ça coupe aussi les citoyens d’informations fiables (après ce sujet se discute).</p>\n\n<p>Néanmoins, nous avions déjà discuté de la mise en place de site nus pendant l’ouragan Katrina, lire <a href=\"https://bertrandkeller.info/2017/11/09/sites-statiques-sans-graphisme/\">Les sites sans mise en page font leur grand retour</a>. Et nous avions vu qu’un site avec une présentation très simple répond à plusieurs attentes directes des utilisateurs.</p>\n\n<ol>\n <li>Couverture de tous les problèmes d’accessibilité (robots, lecteurs d’écrans…)</li>\n <li>Lecture par tous les périphériques possibles</li>\n <li>Marche dans le métro</li>\n <li>Préserve le porte-monnaie.</li>\n</ol>\n\n<p>En situation de crise, un utilisateur veut accéder directement l’information qui l’intéresse.</p>\n\n<h2 id=\"quand-arrive-la-crise-\">Quand arrive la crise ?</h2>\n\n<p>Le sujet des bénéfices d’un site de crise est un sujet, mais la question de la fréquence des crises en est une autre. Dès qu’il n’y a plus de crise, les petits agriculteurs de proximité, les sites légers et la livraison à domicile de charges lourdes, c’est pratique. Mais dès que la crise est passée, on se détourne de ces solutions. On le voit avec la crise du COVID, les voitures ont repris leurs droits et à 150km/h, en SUV.</p>\n\n<p>Et si les crises arrivaient de manière plus fréquentes ? Car ce qu’on voit c’est que nous ne sommes pas préparés aux crises. Mais si des crises arrivent de manière succéssive ?</p>\n\n<p>Pourquoi ne pas se munir d‘outils fiables sans changer fondamentalement nos habitudes ?</p>\n\n<h2 id=\"engager-une-dmarche-low-tech\">Engager une démarche Low-Tech</h2>\n\n<p>S’engager dans le Low-Tech, c‘est effectivement se baser plus sur l’humain, moins sur les énergies fossiles, c’est consacrer un peu plus de temps à son environnement. Mais la démarche Low-Tech consiste surtout à prendre ce temps sur de la maintenance inutile, sur des systèmes complexes qui ne marchent que dans 1 cas de figurent. C’est répondre à des problèmes simples par des solutions simples.</p>\n\n<p>S’engager dans le Low-Tech, c’est s’équiper de techniques permettant d’assouvir des besoins dans le plus de cas de figure possible. Internet à débit rapide, ou lent ; périphérique performant, ou portable de rechange…</p>\n\n<p>C’est une question de mentalité. Notre esprit, notre société ne prévoit plus les crises, elles les gèrent. Il faut accepter que nous ne sommes pas prêts, pas bons, tous ensemble. Aujourd’hui, il est déjà possible de faire mieux avec moins.</p>\n", "markdown": "Résumons, l’idée d‘un site Low-Tech n‘est pas de faire un site bas de gamme. L’idée est d'avoir un site qui fonctionne à faible coût (ressources humaines, financières, énergétique…), mais qui est aussi robuste donc qui fonctionne en situation de crise.\n\nCette semaine suite à une affaire interne qui pourrait raviver des tensions entre populations, le gouvernement éthiopien a décidé de couper les communications passant par Internet. Le pays est donc coupé du monde et sans possibilité de communiquer en interne.\n\n<div class=\"center\">\n\t{% twitter https://twitter.com/wycats/status/1278937131541499904 %}\n</div>\n\n\n## La crise\n\nOui, on peut penser que ça peut éviter que des informations de rébellion se répandent, mais ça coupe aussi les citoyens d'informations fiables (après ce sujet se discute).\n\nNéanmoins, nous avions déjà discuté de la mise en place de site nus pendant l’ouragan Katrina, lire [Les sites sans mise en page font leur grand retour](https://bertrandkeller.info/2017/11/09/sites-statiques-sans-graphisme/). Et nous avions vu qu’un site avec une présentation très simple répond à plusieurs attentes directes des utilisateurs.\n\n1. Couverture de tous les problèmes d’accessibilité (robots, lecteurs d’écrans…)\n2. Lecture par tous les périphériques possibles\n3. Marche dans le métro\n4. Préserve le porte-monnaie.\n\nEn situation de crise, un utilisateur veut accéder directement l’information qui l’intéresse.\n\n## Quand arrive la crise ?\n\nLe sujet des bénéfices d’un site de crise est un sujet, mais la question de la fréquence des crises en est une autre. Dès qu’il n’y a plus de crise, les petits agriculteurs de proximité, les sites légers et la livraison à domicile de charges lourdes, c’est pratique. Mais dès que la crise est passée, on se détourne de ces solutions. On le voit avec la crise du COVID, les voitures ont repris leurs droits et à 150km/h, en SUV.\n\nEt si les crises arrivaient de manière plus fréquentes ? Car ce qu’on voit c’est que nous ne sommes pas préparés aux crises. Mais si des crises arrivent de manière succéssive ?\n\nPourquoi ne pas se munir d‘outils fiables sans changer fondamentalement nos habitudes ?\n\n## Engager une démarche Low-Tech\n\nS'engager dans le Low-Tech, c‘est effectivement se baser plus sur l’humain, moins sur les énergies fossiles, c’est consacrer un peu plus de temps à son environnement. Mais la démarche Low-Tech consiste surtout à prendre ce temps sur de la maintenance inutile, sur des systèmes complexes qui ne marchent que dans 1 cas de figurent. C'est répondre à des problèmes simples par des solutions simples.\n\nS'engager dans le Low-Tech, c’est s’équiper de techniques permettant d'assouvir des besoins dans le plus de cas de figure possible. Internet à débit rapide, ou lent ; périphérique performant, ou portable de rechange…\n\nC’est une question de mentalité. Notre esprit, notre société ne prévoit plus les crises, elles les gèrent. Il faut accepter que nous ne sommes pas prêts, pas bons, tous ensemble. Aujourd’hui, il est déjà possible de faire mieux avec moins.\n" }