{ "id": "/2017/11/10/rapport-site-nus-stites-statiques", "title": "Quel est le rapport entre les sites nus et les sites statiques", "url": "https://bertrandkeller.info/2017/11/10/rapport-site-nus-stites-statiques/", "date": 1510268400, "html": "<p>On m’a posé la question sur Twitter de savoir quel était le rapport entre les sites statiques et les sites nus. J’accorde que le rapport (que je voulais montrer) n’est pas si évident alors je vais le détailler.</p>\n\n<h2 id=\"offline-first\">Offline First</h2>\n\n<p>L’arrivée des services workers dans les navigateurs change la donne en terme de réalisation de sites web. Il est désormais possible de consulter des pages “hors ligne” ; des pages sauvegardées par votre navigateur et que vous pouvez consulter sans connexion (elles se mettent à jour à chaque connexion).</p>\n\n<p>Ces technologies sont poussées par des grands acteurs du web, surtout Google, pour inonder le marché du contenu web en très forte croissance mais avec un faible réseau et des périphériques peu puissants : Inde, Nigéria…</p>\n\n<p>Les services workers permettent de consulter des pages “hors lignes”, mais plus que cela, ils permettent de pouvoir réaliser des actions “hors lignes”, c’est-à-dire de se servir d’un site web comme d’une application.</p>\n\n<p>Le type de sites qu’on peut réaliser ne se limite donc pas à des sites de contenus mais aussi à des applications (ex: une site de vente en ligne).</p>\n\n<h2 id=\"le-rseau\">Le réseau</h2>\n\n<p>Dans mon dernier article, je montrais que lors de l’ouragan Irma, des personnes consultaient des sites nus (très légers), car ils avaient une très faible connexion à ce moment là.</p>\n\n<p>Les exemples que j’ai montré sont de grands journaux à fort trafic qui ne se situent pas sur la zone où s’est déroulée la catastrophe. Les rédacteurs n’ont a priori pas de soucis de connexion. Le site nus n’est qu’une simple visualisation sans images, vidéos ou styles.</p>\n\n<p>Imaginons maintenant que des personnes au milieu de la catastrophe veulent éditer un sites pour informer les personnes aux alentours, alors elles auront une faible connexion pour éditer leurs pages.</p>\n\n<p>Dans ce cas là, ce qui me semble le plus robuste, le plus simple et qui demande le moins de ressources réseaux, c’est d’écrire des fichiers textes (de type Markdown) et de les envoyer (ou les corriger) en réalisant un commit sur un dépôt (pas besoin d’interface CMS).</p>\n\n<h2 id=\"le-nomadisme\">Le nomadisme</h2>\n\n<p>A ce stade on pourrait dire que ce n’est pas tous les jours qu’un ouragan frappe mon village et que ces problématiques de faible réseau ne s’appliquent que très rarement sous nos tropiques.</p>\n\n<p>Les sites statiques ne sont pas qu’un outil technique pour générer des pages. Ils sont un des moyen les plus simples et les moins chers pour répondre aux nouvelles manières de naviguer sur le web.</p>\n\n<p>Les utilisateurs ne sont plus cantonnées sur leur machine puissante. Ils consultent plusieurs périphériques et sont souvent en condition de nomadisme : ascenseur, voyage, zone peu couverte… Ils désirent être connectés en permanence mais ne disposent pas tout le temps du réseau adéquate. Un utilisateur n’est pas forcément une personne bien assise dans un fauteuil, c’est aussi désormais un commercial qui parcours des zones rurales très importantes.</p>\n\n<h2 id=\"le-rapport-entre-sites-nus-et-les-sites-statiques\">Le rapport entre sites nus et les sites statiques</h2>\n\n<p>Les utilisateurs ont désormais des pratiques de consultation nomades. On voit avec les sites nus, qu’en situation ou le réseau est faible, peu importe la mise en forme et la décoration.</p>\n\n<p>Le futur du web est à des utilisateurs nomades qui sont assez fréquemments dans des situations dans lesquelles le réseau peut être coupé ou faible. Ils veulent consulter du contenu mais aussi agir dessus.</p>\n\n<p>La logique des générateurs de sites statiques (JAMStack) rentre dans cette mouvance car elle demande un coût très faible d’entrée avec une robustesse excellente.</p>\n\n", "markdown": "On m'a posé la question sur Twitter de savoir quel était le rapport entre les sites statiques et les sites nus. J'accorde que le rapport (que je voulais montrer) n'est pas si évident alors je vais le détailler.\n\n## Offline First\n\nL'arrivée des services workers dans les navigateurs change la donne en terme de réalisation de sites web. Il est désormais possible de consulter des pages \"hors ligne\" ; des pages sauvegardées par votre navigateur et que vous pouvez consulter sans connexion (elles se mettent à jour à chaque connexion).\n\nCes technologies sont poussées par des grands acteurs du web, surtout Google, pour inonder le marché du contenu web en très forte croissance mais avec un faible réseau et des périphériques peu puissants : Inde, Nigéria…\n\nLes services workers permettent de consulter des pages \"hors lignes\", mais plus que cela, ils permettent de pouvoir réaliser des actions \"hors lignes\", c'est-à-dire de se servir d'un site web comme d'une application.\n\nLe type de sites qu'on peut réaliser ne se limite donc pas à des sites de contenus mais aussi à des applications (ex: une site de vente en ligne).\n\n## Le réseau\n\nDans mon dernier article, je montrais que lors de l'ouragan Irma, des personnes consultaient des sites nus (très légers), car ils avaient une très faible connexion à ce moment là.\n\nLes exemples que j'ai montré sont de grands journaux à fort trafic qui ne se situent pas sur la zone où s'est déroulée la catastrophe. Les rédacteurs n'ont a priori pas de soucis de connexion. Le site nus n'est qu'une simple visualisation sans images, vidéos ou styles.\n\nImaginons maintenant que des personnes au milieu de la catastrophe veulent éditer un sites pour informer les personnes aux alentours, alors elles auront une faible connexion pour éditer leurs pages.\n\nDans ce cas là, ce qui me semble le plus robuste, le plus simple et qui demande le moins de ressources réseaux, c'est d'écrire des fichiers textes (de type Markdown) et de les envoyer (ou les corriger) en réalisant un commit sur un dépôt (pas besoin d'interface CMS).\n\n## Le nomadisme\n\nA ce stade on pourrait dire que ce n'est pas tous les jours qu'un ouragan frappe mon village et que ces problématiques de faible réseau ne s'appliquent que très rarement sous nos tropiques.\n\nLes sites statiques ne sont pas qu'un outil technique pour générer des pages. Ils sont un des moyen les plus simples et les moins chers pour répondre aux nouvelles manières de naviguer sur le web.\n\nLes utilisateurs ne sont plus cantonnées sur leur machine puissante. Ils consultent plusieurs périphériques et sont souvent en condition de nomadisme : ascenseur, voyage, zone peu couverte… Ils désirent être connectés en permanence mais ne disposent pas tout le temps du réseau adéquate. Un utilisateur n'est pas forcément une personne bien assise dans un fauteuil, c'est aussi désormais un commercial qui parcours des zones rurales très importantes.\n\n## Le rapport entre sites nus et les sites statiques\n\nLes utilisateurs ont désormais des pratiques de consultation nomades. On voit avec les sites nus, qu'en situation ou le réseau est faible, peu importe la mise en forme et la décoration.\n\nLe futur du web est à des utilisateurs nomades qui sont assez fréquemments dans des situations dans lesquelles le réseau peut être coupé ou faible. Ils veulent consulter du contenu mais aussi agir dessus.\n\nLa logique des générateurs de sites statiques (JAMStack) rentre dans cette mouvance car elle demande un coût très faible d'entrée avec une robustesse excellente.\n\n" }