{ "id": "/2017/06/28/economie-sites-statiques", "title": "L'économie du statique", "url": "https://bertrandkeller.info/2017/06/28/economie-sites-statiques/", "date": 1498600800, "html": "<p>Les sites statiques semblent très pratiques à l’usage, pourtant à l’usage j’éprouve quelques cafouillages dans la relation commerciale. Le changement de paradigme entre les CMS avec base de données et les <a href=\"/generateur-site-statique/\">générateurs de site statique</a> n’est pas que technique.</p>\n\n<h2 id=\"le-modle-de-donnes\">Le modèle de données</h2>\n\n<p>Le modèle de données définit à la fois les données qui définissent vos contenus mais aussi les relations que ces données ont entre elles.</p>\n\n<p>Utiliser une base de données MYSQL (par exemple), demande de traduire les données et leur relation dans une base, c’est-à-dire créer le modèle de la base de données : créer des tables et des relations entre ces tables.</p>\n\n<p>Utiliser des sites statiques, c’est partir du principe que pour une grande majorité de sites, les tables de données possèdent des relations “simples” entre elles qui ne nécessitent pas de bases de données transactionnelles comme MYSQL.</p>\n\n<h2 id=\"le-modle-cms-avec-base-de-donnes\">Le modèle CMS avec base de données</h2>\n\n<p>Lorsque vous passez/commandez un site avec un base de données, vous partez avec le schéma de base de données que vous propose votre technologie.<br/>\nSi vous partez sur Wordpress, vous allez utiliser le modèle de base de données de Wordpress qui est différents de Drupal, qui est différent de Joomla…</p>\n\n<p>Derrière ces logiques de schémas de bases de données, des philosophies se développent et des développeurs se crêpent le chignon en valorisant la supériorité de leur technologie.</p>\n\n<p>Ainsi au niveau commercial, vous vendez une boîte noire à votre client. Quand vous lui faites une proposition vous lui dites que vous allez mettre en place un système très compliqué, que ça va prendre du temps ; que vous allez le configurer et puis lui laisser les droits pour l’administrer.</p>\n\n<p>Vous justifiez donc un prix très élevé, vous livrez et si le client veut une modification vous pouvez répondre que le système ne marche que comme ça et vous lui faites une jolie facture.</p>\n\n<p>Vous fonctionnez dans la plupart des cas au forfait</p>\n\n<h2 id=\"le-modle-gnrateurs-de-site-statique\">Le modèle générateurs de site statique</h2>\n\n<p>En utilisant les générateurs de site statique, je me suis lancé dans une démarche assez logique de fonctionnement en itérations. Construction rapide d’une première mouture qu’on met en ligne et qu’on fait évoluer au fil du temps (on ne sait pas encore ce qu’on veut).</p>\n\n<p>Avec les sites statiques, le modèle de données peut sans cesse bouger évoluer sans grande difficultés techniques. C’est justement ce qui m’intéresse et que je vends au client.</p>\n\n<p>Pouvoir faire évoluer le modèle de données c’est faire évoluer votre site dans le temps et l’adapter aux besoins présents (concept d’agilité). Ce qu’on remarque avec des CMS avec base de données c’est que souvent le site se cristallise et ne subit plus aucune modification pendant des années.</p>\n\n<p>Ainsi au niveau commercial, cela reste encore assez compliqué d’inculquer cela à un client, cela doit faire partie de sa philosophie ou de ses besoins à long terme (il faut bien tomber).</p>\n\n<p>Le problème est que si ce que vous proposez à votre client un site qui répond à son besoin dès la première itération et qu’il n’arrive pas à se projeter sur d’autres interfaces qui lui serait utile ; la récolte du succès de la méthode est que vous aurez juste vendu un site moins cher.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>Les générateurs de sites statiques ont un bel avenir devant eux, seulement leur utilisation demandent une forte implication avec le client pour la définition des données.</p>\n\n<p>Même si dans les faits cela ne diffèrent pas grandement de l’utilisation d’un CMS (il s’agit tout autant de la réalisation d’un site). Comme les données et le site ne sont pas cristallisés, il est plus long de maîtriser les stratégies de mise en place.</p>\n\n<p>Ces stratégies sont encore en construction, des nouveaux outils se développent actuellement, je pense personnellement maîtriser de mieux en mieux la gestion d’un site propulsé par un générateur de site statique.</p>\n\n", "markdown": "Les sites statiques semblent très pratiques à l'usage, pourtant à l'usage j’éprouve quelques cafouillages dans la relation commerciale. Le changement de paradigme entre les CMS avec base de données et les [générateurs de site statique](/generateur-site-statique/) n'est pas que technique.\n\n## Le modèle de données\n\nLe modèle de données définit à la fois les données qui définissent vos contenus mais aussi les relations que ces données ont entre elles.\n\nUtiliser une base de données MYSQL (par exemple), demande de traduire les données et leur relation dans une base, c'est-à-dire créer le modèle de la base de données : créer des tables et des relations entre ces tables.\n\nUtiliser des sites statiques, c'est partir du principe que pour une grande majorité de sites, les tables de données possèdent des relations \"simples\" entre elles qui ne nécessitent pas de bases de données transactionnelles comme MYSQL. \n\n## Le modèle CMS avec base de données\n\nLorsque vous passez/commandez un site avec un base de données, vous partez avec le schéma de base de données que vous propose votre technologie. \nSi vous partez sur Wordpress, vous allez utiliser le modèle de base de données de Wordpress qui est différents de Drupal, qui est différent de Joomla…\n\nDerrière ces logiques de schémas de bases de données, des philosophies se développent et des développeurs se crêpent le chignon en valorisant la supériorité de leur technologie.\n\nAinsi au niveau commercial, vous vendez une boîte noire à votre client. Quand vous lui faites une proposition vous lui dites que vous allez mettre en place un système très compliqué, que ça va prendre du temps ; que vous allez le configurer et puis lui laisser les droits pour l'administrer.\n\nVous justifiez donc un prix très élevé, vous livrez et si le client veut une modification vous pouvez répondre que le système ne marche que comme ça et vous lui faites une jolie facture.\n\nVous fonctionnez dans la plupart des cas au forfait\n\n## Le modèle générateurs de site statique\n\nEn utilisant les générateurs de site statique, je me suis lancé dans une démarche assez logique de fonctionnement en itérations. Construction rapide d'une première mouture qu'on met en ligne et qu'on fait évoluer au fil du temps (on ne sait pas encore ce qu'on veut).\n\nAvec les sites statiques, le modèle de données peut sans cesse bouger évoluer sans grande difficultés techniques. C'est justement ce qui m'intéresse et que je vends au client.\n\nPouvoir faire évoluer le modèle de données c'est faire évoluer votre site dans le temps et l'adapter aux besoins présents (concept d'agilité). Ce qu'on remarque avec des CMS avec base de données c'est que souvent le site se cristallise et ne subit plus aucune modification pendant des années.\n\nAinsi au niveau commercial, cela reste encore assez compliqué d'inculquer cela à un client, cela doit faire partie de sa philosophie ou de ses besoins à long terme (il faut bien tomber).\n\nLe problème est que si ce que vous proposez à votre client un site qui répond à son besoin dès la première itération et qu'il n'arrive pas à se projeter sur d'autres interfaces qui lui serait utile ; la récolte du succès de la méthode est que vous aurez juste vendu un site moins cher.\n\n## Conclusion\n\nLes générateurs de sites statiques ont un bel avenir devant eux, seulement leur utilisation demandent une forte implication avec le client pour la définition des données.\n\nMême si dans les faits cela ne diffèrent pas grandement de l'utilisation d'un CMS (il s'agit tout autant de la réalisation d'un site). Comme les données et le site ne sont pas cristallisés, il est plus long de maîtriser les stratégies de mise en place.\n\nCes stratégies sont encore en construction, des nouveaux outils se développent actuellement, je pense personnellement maîtriser de mieux en mieux la gestion d'un site propulsé par un générateur de site statique.\n\n" }