{ "id": "/2020/07/09/liens-de-ressources-numerique-responsable", "title": "Liens vers des ressources du numérique responsable", "url": "https://bertrandkeller.info/2020/07/09/liens-de-ressources-numerique-responsable/", "date": 1594245600, "html": "<p>Le numérique responsable est en train de devenir un thème très à la mode. Si je vous demande : <code>êtes vous une personne responsable ? êtes vous une entreprise responsable ?</code> La réponse sera dans une très grande majorité des cas : <code>Oui !</code>. Mais être responsable c’est avoir conscience de la situation du climat et de l’empreinte du numérique. Pour cela quelques ressources ici : <a href=\"/liens/numeriques-responsables/\">Des liens sur le numérique responsable</a>.</p>\n\n<h2 id=\"le-numrique-responsable\">Le numérique responsable</h2>\n\n<p>Mais qu’est-ce que c’est le numérique responsable ?</p>\n\n<blockquote>\n <p>Concevoir des services numériques pour qu’ils soient plus performants d’un point de vue environnemental, économique et social.</p>\n</blockquote>\n\n<p>Concevoir des services plus performants. La définition semble pas mal, mais elle manque quand même d’un peu de précision. AirBnB est-elle une entreprise responsable ? Son service est performant, il fonctionne économiquement et aide des personnes pour loger chez des particuliers (parfois faire des rencontres).</p>\n\n<h2 id=\"la-responsabilit\">La responsabilité</h2>\n\n<p>Tout le monde peut parler de numérique responsable selon son propre prisme ou son propre point de vue. Mais le numérique responsable pour ceux qui en discutent en profondeur, c’est surtout faire que le numérique reste un outil de communication positif pour les citoyens en minimisant au maximum son impact sur notre environnement.</p>\n\n<p>Ainsi quand un ministre, grand patron ou communiquant parlent d’utiliser l’Intelligence Artificielle pour diminuer l’impact du numérique sur l’environnement, c’est un mensonge. L’amélioration de la productivité ou des transformations technologiques n’ont jamais amélioré la biodiversité à la mesure de leur destruction précédente. Quand une mine ferme, personne n’investit pour dépolluer (complétement) les alentours (et surtout pas l’exploitant).</p>\n\n<p>Être responsable, c’est prendre en compte que l’accès au réseau dépend de ses revenus, que la demande en électricité pour le numérique augmente beaucoup trop vite, que la création de nouveaux périphériques est compromise à moyen terme (il faudra faire durer l’existant).</p>\n\n<h2 id=\"mais-le-numrique-\">Mais le numérique ?</h2>\n\n<blockquote>\n <p>Le numérique m’intéresse, mais je ne perçois pas bien comment on peut ce que ça concerne concrètement et ce sur quels levies agir ?</p>\n</blockquote>\n\n<p>Et bien, le numérique, c’est fait de plein de choses entre le réseaux, les données,… les sites web. C’est pas si compliqué mais ce sont des sujets plutôt vastes.</p>\n\n<p>Alors pour ce faire un idée, je vous partage une page ou je vais mettre mes ressources sur le numérique responsable.</p>\n\n<p>Ce qu’il faudra retenir, c’est que la consommation de numérique demande d’être équipé, que l’équipement est important principalement en Europe et en Amérique du Nord. Ce sont les pays dit « riches » qui ont le plus grande empreinte. Que cette empreinte doit être réduite drastiquement. Pour cela, nous devons arrêter la course à la donnée (limiter les usages) et arrêter de renouveler notre parc de périphériques.</p>\n\n<p>Lire : <a href=\"/liens/numeriques-responsables/\">Des liens sur le numérique responsable</a>.</p>\n", "markdown": "Le numérique responsable est en train de devenir un thème très à la mode. Si je vous demande : `êtes vous une personne responsable ? êtes vous une entreprise responsable ?` La réponse sera dans une très grande majorité des cas : `Oui !`. Mais être responsable c’est avoir conscience de la situation du climat et de l’empreinte du numérique. Pour cela quelques ressources ici : [Des liens sur le numérique responsable](/liens/numeriques-responsables/).\n\n## Le numérique responsable\n\nMais qu'est-ce que c’est le numérique responsable ?\n\n> Concevoir des services numériques pour qu'ils soient plus performants d’un point de vue environnemental, économique et social.\n\nConcevoir des services plus performants. La définition semble pas mal, mais elle manque quand même d’un peu de précision. AirBnB est-elle une entreprise responsable ? Son service est performant, il fonctionne économiquement et aide des personnes pour loger chez des particuliers (parfois faire des rencontres).\n\n## La responsabilité\n\nTout le monde peut parler de numérique responsable selon son propre prisme ou son propre point de vue. Mais le numérique responsable pour ceux qui en discutent en profondeur, c’est surtout faire que le numérique reste un outil de communication positif pour les citoyens en minimisant au maximum son impact sur notre environnement.\n\nAinsi quand un ministre, grand patron ou communiquant parlent d’utiliser l’Intelligence Artificielle pour diminuer l'impact du numérique sur l’environnement, c’est un mensonge. L'amélioration de la productivité ou des transformations technologiques n’ont jamais amélioré la biodiversité à la mesure de leur destruction précédente. Quand une mine ferme, personne n’investit pour dépolluer (complétement) les alentours (et surtout pas l’exploitant).\n\nÊtre responsable, c’est prendre en compte que l’accès au réseau dépend de ses revenus, que la demande en électricité pour le numérique augmente beaucoup trop vite, que la création de nouveaux périphériques est compromise à moyen terme (il faudra faire durer l'existant).\n\n## Mais le numérique ?\n\n> Le numérique m'intéresse, mais je ne perçois pas bien comment on peut ce que ça concerne concrètement et ce sur quels levies agir ?\n\nEt bien, le numérique, c’est fait de plein de choses entre le réseaux, les données,… les sites web. C’est pas si compliqué mais ce sont des sujets plutôt vastes.\n\nAlors pour ce faire un idée, je vous partage une page ou je vais mettre mes ressources sur le numérique responsable.\n\nCe qu’il faudra retenir, c’est que la consommation de numérique demande d’être équipé, que l’équipement est important principalement en Europe et en Amérique du Nord. Ce sont les pays dit « riches » qui ont le plus grande empreinte. Que cette empreinte doit être réduite drastiquement. Pour cela, nous devons arrêter la course à la donnée (limiter les usages) et arrêter de renouveler notre parc de périphériques.\n\nLire : [Des liens sur le numérique responsable](/liens/numeriques-responsables/).\n" }