{ "id": "/2020/04/10/empreinte-environnementale-numerique-mondial", "title": "Empreinte environnementale du numérique mondial", "url": "https://bertrandkeller.info/2020/04/10/empreinte-environnementale-numerique-mondial/", "date": 1586469600, "html": "<p>Cette période de confinement nous amène à pas mal de réflexions et de prises de conscience. Au niveau professionnel, ce que j’ai remarqué, c’est que je continue de bosser pas mal, mais je continue surtout à faire de trucs gratuits comme ça pour la société. Je dois avoir du gène d’infirmier quelque part.</p>\n\n<p>En septembre dernier, étant membre de la liste de discussion sur le numérique responsable, je me suis proposé pour mettre en page le rapport qu’était en train de rédiger <a href=\"https://greenIT.fr/\">GreenIT.fr</a> (soyons bien clair, je n’ai rien écrit du tout dedans).</p>\n\n<p>Chose un peu classique que j’ai rencontré, il n’était pas prévu de faire une version HTML en ligne du rapport, juste un lien vers un PDF. Oui, en 2020, à l’air du numérique partout. On ne pense à mettre un PDF à télécharger mais pas à nourrir la bibliothèque mondiale (Mes articles sur les sites statiques manquent de lecteurs).</p>\n\n<p>Donc, je suis arrivé avec mon initiative, et j’ai pondu cette page :</p>\n\n<div class=\"btn-link\">\n<a href=\"https://www.greenit.fr/etude-empreinte-environnementale-du-numerique-mondial/\">Découvrir le rapport sur l’empreinte environnementale du numérique mondial</a>.\n</div>\n\n<p>Ça vaut ce que ça vaut, mais j’ai essayé que cette page soit <a href=\"/low-tech-site-web-internet/\">Low-Tech</a>, se charge le plus rapidement possible et soit navigable sur des petits écrans.</p>\n\n<p>Au niveau technique, j’ai donc inséré un header avec une image dithered (dégradée), un menu d’ancre avec de la navigation douce, des beaux tableaux et des graphiques dynamiques avec une bibliothèque assez légère.</p>\n\n<p>Au final une page de 441Kb, ce qui est plutôt pas mal quand on voit tout ce contenu bien illustré. On aurait pu faire plus léger.</p>\n\n<p>Mais le plus important est dans le rapport, je vous laisse le découvrir : <a href=\"https://www.greenit.fr/etude-empreinte-environnementale-du-numerique-mondial/\">rapport sur l’empreinte environnementale du numérique mondial</a>.</p>\n", "markdown": "Cette période de confinement nous amène à pas mal de réflexions et de prises de conscience. Au niveau professionnel, ce que j'ai remarqué, c’est que je continue de bosser pas mal, mais je continue surtout à faire de trucs gratuits comme ça pour la société. Je dois avoir du gène d’infirmier quelque part.\n\nEn septembre dernier, étant membre de la liste de discussion sur le numérique responsable, je me suis proposé pour mettre en page le rapport qu'était en train de rédiger [GreenIT.fr](https://greenIT.fr/) (soyons bien clair, je n’ai rien écrit du tout dedans).\n\nChose un peu classique que j'ai rencontré, il n'était pas prévu de faire une version HTML en ligne du rapport, juste un lien vers un PDF. Oui, en 2020, à l'air du numérique partout. On ne pense à mettre un PDF à télécharger mais pas à nourrir la bibliothèque mondiale (Mes articles sur les sites statiques manquent de lecteurs).\n\nDonc, je suis arrivé avec mon initiative, et j'ai pondu cette page :\n\n<div class=\"btn-link\">\n<a href=\"https://www.greenit.fr/etude-empreinte-environnementale-du-numerique-mondial/\">Découvrir le rapport sur l’empreinte environnementale du numérique mondial</a>.\n</div>\n\nÇa vaut ce que ça vaut, mais j’ai essayé que cette page soit [Low-Tech](/low-tech-site-web-internet/), se charge le plus rapidement possible et soit navigable sur des petits écrans.\n\nAu niveau technique, j’ai donc inséré un header avec une image dithered (dégradée), un menu d'ancre avec de la navigation douce, des beaux tableaux et des graphiques dynamiques avec une bibliothèque assez légère.\n\nAu final une page de 441Kb, ce qui est plutôt pas mal quand on voit tout ce contenu bien illustré. On aurait pu faire plus léger.\n\nMais le plus important est dans le rapport, je vous laisse le découvrir : [rapport sur l’empreinte environnementale du numérique mondial](https://www.greenit.fr/etude-empreinte-environnementale-du-numerique-mondial/).\n" }