{ "id": "/2016/09/15/jekyll-remede-complexite", "title": "Les générateurs de site statique, remèdes contre la complexité", "url": "https://bertrandkeller.info/2016/09/15/jekyll-remede-complexite/", "date": 1473890400, "html": "<p>La technique est une chose difficile à apprivoiser par l’homme. D’un côté, elle lui apporte, bien évidemment, des bénéfices lui permettant de survivre dans une environnement hostile ; d’une autre côté, elle peut être source de remise en question sociale, déséquilibrante pour le groupe ou la société.</p>\n\n<h2 id=\"pourquoi-faire-simple\">Pourquoi faire simple</h2>\n\n<p>Les études anthropologiques sur la vie et la mort des civilisations montre les raisons de leur succès et de leur chute.</p>\n\n<blockquote>\n <p>Les civilisations ne sont pas éternelles. Elles ne peuvent pas s’étendre et se complexifier indéfiniment.</p>\n</blockquote>\n\n<p>On observe que les grandes civilisations ont pour la plupart du temps disparues suite à de causes internes et non de causes externes. Personne n’est venu les concurrencer directement, ces grands ensembles se sont tout simplement écroulés sur eux-même.</p>\n\n<p>Comme pour n’importe quel système, si l’énergie nécessaire pour votre survie est supérieure à ce que vous pouvez trouver ou consommer : le système meurt.</p>\n\n<h2 id=\"en-quoi-les-gnrateurs-de-site-statique-sont-un-remde-\">En quoi les générateurs de site statique sont un remède ?</h2>\n\n<p>Si vous avez un besoin simple, pour consommer le moins d’énergie possible, vous allez chercher une solution simple.</p>\n\n<p>Simple, non pas au sens de simpliste, mais simple au sens facile à mettre en œuvre et aisé à maintenir.</p>\n\n<p>Sur le web, pour afficher une simple page web. Inutile de connaître le moindre système technique ; il suffit de copier un peu de code HTML dans un fichier et de le mettre sur un serveur.</p>\n\n<p>De même pour afficher un site “carte de visite” ou un simple blog ; inutile de mettre en place un serveur avec une base de données, le tout piloté par un CMS. L’utilisation d’un <a href=\"/generateur-site-statique/\">générateur de site statique</a> peut amplement suffire.</p>\n\n<p>Votre choix doit être dicté par un rapport entre le temps d’installation et de maintenance divisé par la fréquence/volume de publication. Dans 80% des cas, comme ce qui pêche se situant au niveau du contenu, le générateurs de site statique sera en bonne position dans votre liste de solutions possibles.</p>\n\n<h2 id=\"conclusion\">Conclusion</h2>\n\n<p>La technique propose des solutions à l’homme pour répondre à des problématiques. Si on veut perdurer, il est indispensable de dépenser le moins d’énergie possible pour des besoins simples.</p>\n\n<p>L’énergie restante sera encore disponible pour l’amélioration de système existant ou pour la répondre à d’autres besoins simple.</p>\n\n<p>Les générateurs de site statique ne répondent pas à tous les besoins, mais répondent à un grand nombre de besoins fondamentaux du web en ne demandant qu’un faible investissement.</p>\n", "markdown": "La technique est une chose difficile à apprivoiser par l'homme. D'un côté, elle lui apporte, bien évidemment, des bénéfices lui permettant de survivre dans une environnement hostile ; d'une autre côté, elle peut être source de remise en question sociale, déséquilibrante pour le groupe ou la société.\n\n## Pourquoi faire simple\n\nLes études anthropologiques sur la vie et la mort des civilisations montre les raisons de leur succès et de leur chute.\n\n> Les civilisations ne sont pas éternelles. Elles ne peuvent pas s'étendre et se complexifier indéfiniment.\n\nOn observe que les grandes civilisations ont pour la plupart du temps disparues suite à de causes internes et non de causes externes. Personne n'est venu les concurrencer directement, ces grands ensembles se sont tout simplement écroulés sur eux-même.\n\nComme pour n'importe quel système, si l'énergie nécessaire pour votre survie est supérieure à ce que vous pouvez trouver ou consommer : le système meurt.\n\n## En quoi les générateurs de site statique sont un remède ?\n\nSi vous avez un besoin simple, pour consommer le moins d'énergie possible, vous allez chercher une solution simple.\n\nSimple, non pas au sens de simpliste, mais simple au sens facile à mettre en œuvre et aisé à maintenir.\n\nSur le web, pour afficher une simple page web. Inutile de connaître le moindre système technique ; il suffit de copier un peu de code HTML dans un fichier et de le mettre sur un serveur. \n\nDe même pour afficher un site \"carte de visite\" ou un simple blog ; inutile de mettre en place un serveur avec une base de données, le tout piloté par un CMS. L'utilisation d'un [générateur de site statique](/generateur-site-statique/) peut amplement suffire.\n\nVotre choix doit être dicté par un rapport entre le temps d'installation et de maintenance divisé par la fréquence/volume de publication. Dans 80% des cas, comme ce qui pêche se situant au niveau du contenu, le générateurs de site statique sera en bonne position dans votre liste de solutions possibles.\n\n## Conclusion\n\nLa technique propose des solutions à l'homme pour répondre à des problématiques. Si on veut perdurer, il est indispensable de dépenser le moins d'énergie possible pour des besoins simples.\n\nL'énergie restante sera encore disponible pour l'amélioration de système existant ou pour la répondre à d'autres besoins simple.\n\nLes générateurs de site statique ne répondent pas à tous les besoins, mais répondent à un grand nombre de besoins fondamentaux du web en ne demandant qu'un faible investissement.\n" }