{ "id": "/2016/06/08/sudweb-et-la-technique", "title": "Sud-Web et la technique", "url": "https://bertrandkeller.info/2016/06/08/sudweb-et-la-technique/", "date": 1465336800, "html": "<p>Qu’est-ce qui caractérise la conférence Sud-Web, la conférence itinérante qui parle de web mais pas que.</p>\n\n<p>Écoutons Jacques Elul :</p>\n\n<blockquote>\n <p>J’ai trouvé qu’il y avait certaines tendances dans la société soviétique et dans la société capitaliste qui étaient extrêmement voisines, que l’on retrouvait au-delà des transformations économiques et des modalités politiques et juridiques. En particulier, on retrouvait la nécessité de développer à tout prix l’industrie et les objets de type technique.</p>\n</blockquote>\n\n<p>En d’autres termes, nous sommes au quotidien témoins d’analyses des sociétés à travers un prisme soit disant économique (régulation des flux de marchandises). La pensée d’Ellul se caractérise par l’ajout de la technique en temps que paramètre. Il a construit une vision sur le trio : Technique, Argent, État.</p>\n\n<p>Pour lui, le principe de la technique se résume à la recherche d’efficience sans prise en considération des conséquences. Et cette recherche d’efficience permanente est devenue sacrée. Le rôle de l’État par exemple est d’optimiser ses ressources en développant des techniques de plus en plus perfectionnées ; sans se soucier des risques sur l’environnement, la santé,…</p>\n\n<blockquote>\n <p>L’homme ne pouvant s’empêcher de sacraliser son environnement, ce n’est plus la nature qu’il sacralise mais ce par quoi il a désacralisé, profané et même pollué celle-ci : la technique. Et les conséquences de ce « transfert » ne sont pas seulement environnementales, elles sont aussi psychologiques et se traduisent par des comportements de dépendance à l’égard de la technique.</p>\n</blockquote>\n\n<p>A Sud-Web, on ne parle pas de technique, certes, mais pas de la technique. Les orateurs parlent de leur vie et de leurs envies. L’équipe les place dans un espace le plus conviviale pour le partager avec les participants.</p>\n\n<p>Utiliser tel outil pour travailler plus vite ! Et alors ? Utiliser telle librairie pour accélerer vos développements ! Et alors ?</p>\n\n<p>Le vendredi, on expose nos problématiques et, le samedi, on échange sur ce qu’on est et ce qu’on désire en tant que personne humaine. Durant ces 2 jours, les participants oublient la société productive aliénante avec laquelle ils doivent composer pour construire un autre monde (dans leur tête au moins et c’est déjà ça).</p>\n", "markdown": "Qu'est-ce qui caractérise la conférence Sud-Web, la conférence itinérante qui parle de web mais pas que.\n\nÉcoutons Jacques Elul :\n\n> J'ai trouvé qu’il y avait certaines tendances dans la société soviétique et dans la société capitaliste qui étaient extrêmement voisines, que l’on retrouvait au-delà des transformations économiques et des modalités politiques et juridiques. En particulier, on retrouvait la nécessité de développer à tout prix l’industrie et les objets de type technique.\n\nEn d'autres termes, nous sommes au quotidien témoins d'analyses des sociétés à travers un prisme soit disant économique (régulation des flux de marchandises). La pensée d'Ellul se caractérise par l'ajout de la technique en temps que paramètre. Il a construit une vision sur le trio : Technique, Argent, État.\n\nPour lui, le principe de la technique se résume à la recherche d'efficience sans prise en considération des conséquences. Et cette recherche d'efficience permanente est devenue sacrée. Le rôle de l'État par exemple est d'optimiser ses ressources en développant des techniques de plus en plus perfectionnées ; sans se soucier des risques sur l'environnement, la santé,…\n\n> L'homme ne pouvant s'empêcher de sacraliser son environnement, ce n'est plus la nature qu'il sacralise mais ce par quoi il a désacralisé, profané et même pollué celle-ci : la technique. Et les conséquences de ce « transfert » ne sont pas seulement environnementales, elles sont aussi psychologiques et se traduisent par des comportements de dépendance à l'égard de la technique.\n\nA Sud-Web, on ne parle pas de technique, certes, mais pas de la technique. Les orateurs parlent de leur vie et de leurs envies. L'équipe les place dans un espace le plus conviviale pour le partager avec les participants.\n\nUtiliser tel outil pour travailler plus vite ! Et alors ? Utiliser telle librairie pour accélerer vos développements ! Et alors ?\n\nLe vendredi, on expose nos problématiques et, le samedi, on échange sur ce qu'on est et ce qu'on désire en tant que personne humaine. Durant ces 2 jours, les participants oublient la société productive aliénante avec laquelle ils doivent composer pour construire un autre monde (dans leur tête au moins et c'est déjà ça).\n" }